m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Texas Instruments</vendor>
  <vendorID>TI</vendorID>
  <name>TM4C1294NCPDT</name>
  <series>Tiva C Series</series>
  <version>1</version>
  <description>(no description)</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/watchdog.xml -->
    <peripheral>
      <name>WATCHDOG0</name>
      <description>Watchdog Timer register offsets</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>WDT_LOAD</name>
          <displayName>WDT_LOAD</displayName>
          <description>Watchdog Load</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WDT_VALUE</name>
          <displayName>WDT_VALUE</displayName>
          <description>Watchdog Value</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>WDT_CTL</name>
          <displayName>WDT_CTL</displayName>
          <description>Watchdog Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_CTL_INTEN</name>
              <description>Watchdog Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CTL_RESEN</name>
              <description>Watchdog Reset Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CTL_INTTYPE</name>
              <description>Watchdog Interrupt Type</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CTL_WRC</name>
              <description>Write Complete</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_ICR</name>
          <displayName>WDT_ICR</displayName>
          <description>Watchdog Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>WDT_RIS</name>
          <displayName>WDT_RIS</displayName>
          <description>Watchdog Raw Interrupt Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_RIS_WDTRIS</name>
              <description>Watchdog Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_MIS</name>
          <displayName>WDT_MIS</displayName>
          <description>Watchdog Masked Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_MIS_WDTMIS</name>
              <description>Watchdog Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_TEST</name>
          <displayName>WDT_TEST</displayName>
          <description>Watchdog Test</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_TEST_STALL</name>
              <description>Watchdog Stall Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_LOCK</name>
          <displayName>WDT_LOCK</displayName>
          <description>Watchdog Lock</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/watchdog.xml -->
    <peripheral derivedFrom="WATCHDOG0">
      <name>WATCHDOG1</name>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/ssi.xml -->
    <peripheral>
      <name>SSI0</name>
      <description>SSI register offsets</description>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>SSI_CR0</name>
          <displayName>SSI_CR0</displayName>
          <description>SSI Control 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_CR0_DSS</name>
              <description>SSI Data Size Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_4</name>
                  <description>4-bit data</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_5</name>
                  <description>5-bit data</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_6</name>
                  <description>6-bit data</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_7</name>
                  <description>7-bit data</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_8</name>
                  <description>8-bit data</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_9</name>
                  <description>9-bit data</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_10</name>
                  <description>10-bit data</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_11</name>
                  <description>11-bit data</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_12</name>
                  <description>12-bit data</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_13</name>
                  <description>13-bit data</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_14</name>
                  <description>14-bit data</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_15</name>
                  <description>15-bit data</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_16</name>
                  <description>16-bit data</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR0_FRF</name>
              <description>SSI Frame Format Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_MOTO</name>
                  <description>Freescale SPI Frame Format</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_TI</name>
                  <description>Synchronous Serial Frame Format</description>
                  <value>0x00000010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR0_SPO</name>
              <description>SSI Serial Clock Polarity</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR0_SPH</name>
              <description>SSI Serial Clock Phase</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR0_SCR</name>
              <description>SSI Serial Clock Rate</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_CR1</name>
          <displayName>SSI_CR1</displayName>
          <description>SSI Control 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_CR1_LBM</name>
              <description>SSI Loopback Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_SSE</name>
              <description>SSI Synchronous Serial Port Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_MS</name>
              <description>SSI Master/Slave Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_EOT</name>
              <description>End of Transmission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_MODE</name>
              <description>SSI Mode</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_LEGACY</name>
                  <description>Legacy SSI mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_BI</name>
                  <description>Bi-SSI mode</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_QUAD</name>
                  <description>Quad-SSI Mode</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_ADVANCED</name>
                  <description>Advanced SSI Mode with 8-bit packet size</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR1_DIR</name>
              <description>SSI Direction of Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_HSCLKEN</name>
              <description>High Speed Clock Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_FSSHLDFRM</name>
              <description>FSS Hold Frame</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_CR1_EOM</name>
              <description>Stop Frame (End of Message)</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_DR</name>
          <displayName>SSI_DR</displayName>
          <description>SSI Data</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_DR_DATA</name>
              <description>SSI Receive/Transmit Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_SR</name>
          <displayName>SSI_SR</displayName>
          <description>SSI Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_SR_TFE</name>
              <description>SSI Transmit FIFO Empty</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_SR_TNF</name>
              <description>SSI Transmit FIFO Not Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_SR_RNE</name>
              <description>SSI Receive FIFO Not Empty</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_SR_RFF</name>
              <description>SSI Receive FIFO Full</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_SR_BSY</name>
              <description>SSI Busy Bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_CPSR</name>
          <displayName>SSI_CPSR</displayName>
          <description>SSI Clock Prescale</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_CPSR_CPSDVSR</name>
              <description>SSI Clock Prescale Divisor</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_IM</name>
          <displayName>SSI_IM</displayName>
          <description>SSI Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_IM_RORIM</name>
              <description>SSI Receive Overrun Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_IM_RTIM</name>
              <description>SSI Receive Time-Out Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_IM_RXIM</name>
              <description>SSI Receive FIFO Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_IM_TXIM</name>
              <description>SSI Transmit FIFO Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_IM_DMARXIM</name>
              <description>SSI Receive DMA Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_IM_DMATXIM</name>
              <description>SSI Transmit DMA Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_IM_EOTIM</name>
              <description>End of Transmit Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_RIS</name>
          <displayName>SSI_RIS</displayName>
          <description>SSI Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_RIS_RORRIS</name>
              <description>SSI Receive Overrun Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_RIS_RTRIS</name>
              <description>SSI Receive Time-Out Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_RIS_RXRIS</name>
              <description>SSI Receive FIFO Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_RIS_TXRIS</name>
              <description>SSI Transmit FIFO Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_RIS_DMARXRIS</name>
              <description>SSI Receive DMA Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_RIS_DMATXRIS</name>
              <description>SSI Transmit DMA Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_RIS_EOTRIS</name>
              <description>End of Transmit Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_MIS</name>
          <displayName>SSI_MIS</displayName>
          <description>SSI Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_MIS_RORMIS</name>
              <description>SSI Receive Overrun Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_MIS_RTMIS</name>
              <description>SSI Receive Time-Out Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_MIS_RXMIS</name>
              <description>SSI Receive FIFO Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_MIS_TXMIS</name>
              <description>SSI Transmit FIFO Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_MIS_DMARXMIS</name>
              <description>SSI Receive DMA Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_MIS_DMATXMIS</name>
              <description>SSI Transmit DMA Masked Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_MIS_EOTMIS</name>
              <description>End of Transmit Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
