m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SSI_ICR</name>
          <displayName>SSI_ICR</displayName>
          <description>SSI Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_ICR_RORIC</name>
              <description>SSI Receive Overrun Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_RTIC</name>
              <description>SSI Receive Time-Out Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_DMARXIC</name>
              <description>SSI Receive DMA Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_DMATXIC</name>
              <description>SSI Transmit DMA Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_EOTIC</name>
              <description>End of Transmit Interrupt Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_DMACTL</name>
          <displayName>SSI_DMACTL</displayName>
          <description>SSI DMA Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSI_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_PP</name>
          <displayName>SSI_PP</displayName>
          <description>SSI Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_PP_HSCLK</name>
              <description>High Speed Capability</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI_PP_MODE</name>
              <description>Mode of Operation</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_PP_MODE_LEGACY</name>
                  <description>Legacy SSI mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_PP_MODE_ADVBI</name>
                  <description>Legacy mode, Advanced SSI mode and Bi-SSI mode enabled</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_PP_MODE_ADVBIQUAD</name>
                  <description>Legacy mode, Advanced mode, Bi-SSI and Quad-SSI mode enabled</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_PP_FSSHLDFRM</name>
              <description>FSS Hold Frame Capability</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSI_CC</name>
          <displayName>SSI_CC</displayName>
          <description>SSI Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSI_CC_CS</name>
              <description>SSI Baud Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CC_CS_SYSPLL</name>
                  <description>System clock (based on clock source and divisor factor)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/ssi.xml -->
    <peripheral derivedFrom="SSI0">
      <name>SSI1</name>
      <baseAddress>0x40009000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/ssi.xml -->
    <peripheral derivedFrom="SSI0">
      <name>SSI2</name>
      <baseAddress>0x4000A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/ssi.xml -->
    <peripheral derivedFrom="SSI0">
      <name>SSI3</name>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral>
      <name>UART0</name>
      <description>UART register offsets</description>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>UART_DR</name>
          <displayName>UART_DR</displayName>
          <description>UART Data</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_DR_DATA</name>
              <description>Data Transmitted or Received</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_DR_FE</name>
              <description>UART Framing Error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_DR_PE</name>
              <description>UART Parity Error</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_DR_BE</name>
              <description>UART Break Error</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_DR_OE</name>
              <description>UART Overrun Error</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RSR</name>
          <displayName>UART_RSR</displayName>
          <description>UART Receive Status/Error Clear</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_RSR_FE</name>
              <description>UART Framing Error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_RSR_PE</name>
              <description>UART Parity Error</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_RSR_BE</name>
              <description>UART Break Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_RSR_OE</name>
              <description>UART Overrun Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_ECR</name>
          <displayName>UART_ECR</displayName>
          <description>UART Receive Status/Error Clear</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_ECR_DATA</name>
              <description>Error Clear</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_FR</name>
          <displayName>UART_FR</displayName>
          <description>UART Flag</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_FR_CTS</name>
              <description>Clear To Send</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_DSR</name>
              <description>Data Set Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_DCD</name>
              <description>Data Carrier Detect</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_BUSY</name>
              <description>UART Busy</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_RXFE</name>
              <description>UART Receive FIFO Empty</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_TXFF</name>
              <description>UART Transmit FIFO Full</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_RXFF</name>
              <description>UART Receive FIFO Full</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_TXFE</name>
              <description>UART Transmit FIFO Empty</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_FR_RI</name>
              <description>Ring Indicator</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_ILPR</name>
          <displayName>UART_ILPR</displayName>
          <description>UART IrDA Low-Power Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_ILPR_ILPDVSR</name>
              <description>IrDA Low-Power Divisor</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_IBRD</name>
          <displayName>UART_IBRD</displayName>
          <description>UART Integer Baud-Rate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_IBRD_DIVINT</name>
              <description>Integer Baud-Rate Divisor</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_FBRD</name>
          <displayName>UART_FBRD</displayName>
          <description>UART Fractional Baud-Rate Divisor</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_FBRD_DIVFRAC</name>
              <description>Fractional Baud-Rate Divisor</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LCRH</name>
          <displayName>UART_LCRH</displayName>
          <description>UART Line Control</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_LCRH_BRK</name>
              <description>UART Send Break</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_LCRH_PEN</name>
              <description>UART Parity Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_LCRH_EPS</name>
              <description>UART Even Parity Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_LCRH_STP2</name>
              <description>UART Two Stop Bits Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_LCRH_FEN</name>
              <description>UART Enable FIFOs</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_LCRH_WLEN</name>
              <description>UART Word Length</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_5</name>
                  <description>5 bits (default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_6</name>
                  <description>6 bits</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_7</name>
                  <description>7 bits</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_8</name>
                  <description>8 bits</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART_LCRH_SPS</name>
              <description>UART Stick Parity Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CTL</name>
          <displayName>UART_CTL</displayName>
          <description>UART Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_CTL_UARTEN</name>
              <description>UART Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_SIREN</name>
              <description>UART SIR Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_SIRLP</name>
              <description>UART SIR Low-Power Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_SMART</name>
              <description>ISO 7816 Smart Card Support</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_EOT</name>
              <description>End of Transmission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_HSE</name>
              <description>High-Speed Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_LBE</name>
              <description>UART Loop Back Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_TXE</name>
              <description>UART Transmit Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_RXE</name>
              <description>UART Receive Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_DTR</name>
              <description>Data Terminal Ready</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_RTS</name>
              <description>Request to Send</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_RTSEN</name>
              <description>Enable Request to Send</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_CTL_CTSEN</name>
              <description>Enable Clear To Send</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_IFLS</name>
          <displayName>UART_IFLS</displayName>
          <description>UART Interrupt FIFO Level Select</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_IFLS_TX</name>
              <description>UART Transmit Interrupt FIFO Level Select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_IFLS_TX1_8</name>
                  <description>TX FIFO &amp;lt;= 1/8 full</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX2_8</name>
                  <description>TX FIFO &amp;lt;= 1/4 full</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX4_8</name>
                  <description>TX FIFO &amp;lt;= 1/2 full (default)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX6_8</name>
                  <description>TX FIFO &amp;lt;= 3/4 full</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX7_8</name>
                  <description>TX FIFO &amp;lt;= 7/8 full</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART_IFLS_RX</name>
              <description>UART Receive Interrupt FIFO Level Select</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_IFLS_RX1_8</name>
                  <description>RX FIFO &gt;= 1/8 full</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX2_8</name>
                  <description>RX FIFO &gt;= 1/4 full</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX4_8</name>
                  <description>RX FIFO &gt;= 1/2 full (default)</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX6_8</name>
                  <description>RX FIFO &gt;= 3/4 full</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX7_8</name>
                  <description>RX FIFO &gt;= 7/8 full</description>
                  <value>0x00000020</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
