m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>UART_IM</name>
          <displayName>UART_IM</displayName>
          <description>UART Interrupt Mask</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_IM_RIMIM</name>
              <description>UART Ring Indicator Modem Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_CTSMIM</name>
              <description>UART Clear to Send Modem Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_DCDMIM</name>
              <description>UART Data Carrier Detect Modem Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_DSRMIM</name>
              <description>UART Data Set Ready Modem Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_RXIM</name>
              <description>UART Receive Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_TXIM</name>
              <description>UART Transmit Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_RTIM</name>
              <description>UART Receive Time-Out Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_FEIM</name>
              <description>UART Framing Error Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_PEIM</name>
              <description>UART Parity Error Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_BEIM</name>
              <description>UART Break Error Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_OEIM</name>
              <description>UART Overrun Error Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_EOTIM</name>
              <description>End of Transmission Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_9BITIM</name>
              <description>9-Bit Mode Interrupt Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_DMARXIM</name>
              <description>Receive DMA Interrupt Mask</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IM_DMATXIM</name>
              <description>Transmit DMA Interrupt Mask</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RIS</name>
          <displayName>UART_RIS</displayName>
          <description>UART Raw Interrupt Status</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_RIS_RIRIS</name>
              <description>UART Ring Indicator Modem Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_CTSRIS</name>
              <description>UART Clear to Send Modem Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_DCDRIS</name>
              <description>UART Data Carrier Detect Modem Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_DSRRIS</name>
              <description>UART Data Set Ready Modem Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_RXRIS</name>
              <description>UART Receive Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_TXRIS</name>
              <description>UART Transmit Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_RTRIS</name>
              <description>UART Receive Time-Out Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_FERIS</name>
              <description>UART Framing Error Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_PERIS</name>
              <description>UART Parity Error Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_BERIS</name>
              <description>UART Break Error Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_OERIS</name>
              <description>UART Overrun Error Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_EOTRIS</name>
              <description>End of Transmission Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_9BITRIS</name>
              <description>9-Bit Mode Raw Interrupt Status</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_DMARXRIS</name>
              <description>Receive DMA Raw Interrupt Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_RIS_DMATXRIS</name>
              <description>Transmit DMA Raw Interrupt Status</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_MIS</name>
          <displayName>UART_MIS</displayName>
          <description>UART Masked Interrupt Status</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_MIS_RIMIS</name>
              <description>UART Ring Indicator Modem Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_CTSMIS</name>
              <description>UART Clear to Send Modem Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_DCDMIS</name>
              <description>UART Data Carrier Detect Modem Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_DSRMIS</name>
              <description>UART Data Set Ready Modem Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_RXMIS</name>
              <description>UART Receive Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_TXMIS</name>
              <description>UART Transmit Masked Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_RTMIS</name>
              <description>UART Receive Time-Out Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_FEMIS</name>
              <description>UART Framing Error Masked Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_PEMIS</name>
              <description>UART Parity Error Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_BEMIS</name>
              <description>UART Break Error Masked Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_OEMIS</name>
              <description>UART Overrun Error Masked Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_EOTMIS</name>
              <description>End of Transmission Masked Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_9BITMIS</name>
              <description>9-Bit Mode Masked Interrupt Status</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_DMARXMIS</name>
              <description>Receive DMA Masked Interrupt Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_MIS_DMATXMIS</name>
              <description>Transmit DMA Masked Interrupt Status</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_ICR</name>
          <displayName>UART_ICR</displayName>
          <description>UART Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_ICR_RIMIC</name>
              <description>UART Ring Indicator Modem Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_CTSMIC</name>
              <description>UART Clear to Send Modem Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DCDMIC</name>
              <description>UART Data Carrier Detect Modem Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DSRMIC</name>
              <description>UART Data Set Ready Modem Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RXIC</name>
              <description>Receive Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_TXIC</name>
              <description>Transmit Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RTIC</name>
              <description>Receive Time-Out Interrupt Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_FEIC</name>
              <description>Framing Error Interrupt Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_PEIC</name>
              <description>Parity Error Interrupt Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_BEIC</name>
              <description>Break Error Interrupt Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_OEIC</name>
              <description>Overrun Error Interrupt Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_EOTIC</name>
              <description>End of Transmission Interrupt Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_9BITIC</name>
              <description>9-Bit Mode Interrupt Clear</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DMARXIC</name>
              <description>Receive DMA Interrupt Clear</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DMATXIC</name>
              <description>Transmit DMA Interrupt Clear</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_DMACTL</name>
          <displayName>UART_DMACTL</displayName>
          <description>UART DMA Control</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_DMACTL_DMAERR</name>
              <description>DMA on Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_9BITADDR</name>
          <displayName>UART_9BITADDR</displayName>
          <description>UART 9-Bit Self Address</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_9BITADDR_ADDR</name>
              <description>Self Address for 9-Bit Mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_9BITADDR_9BITEN</name>
              <description>Enable 9-Bit Mode</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_9BITAMASK</name>
          <displayName>UART_9BITAMASK</displayName>
          <description>UART 9-Bit Self Address Mask</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_9BITAMASK_MASK</name>
              <description>Self Address Mask for 9-Bit Mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_PP</name>
          <displayName>UART_PP</displayName>
          <description>UART Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_PP_SC</name>
              <description>Smart Card Support</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PP_NB</name>
              <description>9-Bit Support</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PP_MS</name>
              <description>Modem Support</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PP_MSE</name>
              <description>Modem Support Extended</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CC</name>
          <displayName>UART_CC</displayName>
          <description>UART Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_CC_CS</name>
              <description>UART Baud Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_CC_CS_SYSCLK</name>
                  <description>System clock (based on clock source and divisor factor)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
