m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <baseAddress>0x4000D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <baseAddress>0x4000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <baseAddress>0x4000F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART4</name>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART5</name>
      <baseAddress>0x40011000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART6</name>
      <baseAddress>0x40012000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART7</name>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral>
      <name>I2C0</name>
      <description>I2C register offsets</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>I2C_MSA</name>
          <displayName>I2C_MSA</displayName>
          <description>I2C Master Slave Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MSA_RS</name>
              <description>Receive not send</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MSA_SA</name>
              <description>I2C Slave Address</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MCS</name>
          <displayName>I2C_MCS</displayName>
          <description>I2C Master Control/Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MCS_RUN</name>
              <description>I2C Master Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_BUSY</name>
              <description>I2C Busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_ERROR</name>
              <description>Error</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_START</name>
              <description>Generate START</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_ADRACK</name>
              <description>Acknowledge Address</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_STOP</name>
              <description>Generate STOP</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_ACK</name>
              <description>Data Acknowledge Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_DATACK</name>
              <description>Acknowledge Data</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_ARBLST</name>
              <description>Arbitration Lost</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_HS</name>
              <description>High-Speed Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_IDLE</name>
              <description>I2C Idle</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_QCMD</name>
              <description>Quick Command</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_BURST</name>
              <description>Burst Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_BUSBSY</name>
              <description>Bus Busy</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_CLKTO</name>
              <description>Clock Timeout Error</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_ACTDMATX</name>
              <description>DMA TX Active Status</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCS_ACTDMARX</name>
              <description>DMA RX Active Status</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MDR</name>
          <displayName>I2C_MDR</displayName>
          <description>I2C Master Data</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MDR_DATA</name>
              <description>This byte contains the data transferred during a transaction</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MTPR</name>
          <displayName>I2C_MTPR</displayName>
          <description>I2C Master Timer Period</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MTPR_TPR</name>
              <description>Timer Period</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MTPR_HS</name>
              <description>High-Speed Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MTPR_PULSEL</name>
              <description>Glitch Suppression Pulse Width</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_BYPASS</name>
                  <description>Bypass</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_1</name>
                  <description>1 clock</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_2</name>
                  <description>2 clocks</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_3</name>
                  <description>3 clocks</description>
                  <value>0x00030000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_4</name>
                  <description>4 clocks</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_8</name>
                  <description>8 clocks</description>
                  <value>0x00050000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_16</name>
                  <description>16 clocks</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_31</name>
                  <description>31 clocks</description>
                  <value>0x00070000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MIMR</name>
          <displayName>I2C_MIMR</displayName>
          <description>I2C Master Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MIMR_IM</name>
              <description>Master Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_CLKIM</name>
              <description>Clock Timeout Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_DMARXIM</name>
              <description>Receive DMA Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_DMATXIM</name>
              <description>Transmit DMA Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_NACKIM</name>
              <description>Address/Data NACK Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_STARTIM</name>
              <description>START Detection Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_STOPIM</name>
              <description>STOP Detection Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_ARBLOSTIM</name>
              <description>Arbitration Lost Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_TXIM</name>
              <description>Transmit FIFO Request Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_RXIM</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_TXFEIM</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MIMR_RXFFIM</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MRIS</name>
          <displayName>I2C_MRIS</displayName>
          <description>I2C Master Raw Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MRIS_RIS</name>
              <description>Master Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_CLKRIS</name>
              <description>Clock Timeout Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_DMARXRIS</name>
              <description>Receive DMA Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_DMATXRIS</name>
              <description>Transmit DMA Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_NACKRIS</name>
              <description>Address/Data NACK Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_STARTRIS</name>
              <description>START Detection Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_STOPRIS</name>
              <description>STOP Detection Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_ARBLOSTRIS</name>
              <description>Arbitration Lost Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_TXRIS</name>
              <description>Transmit Request Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_RXRIS</name>
              <description>Receive FIFO Request Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_TXFERIS</name>
              <description>Transmit FIFO Empty Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MRIS_RXFFRIS</name>
              <description>Receive FIFO Full Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MMIS</name>
          <displayName>I2C_MMIS</displayName>
          <description>I2C Master Masked Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MMIS_MIS</name>
              <description>Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_CLKMIS</name>
              <description>Clock Timeout Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_DMARXMIS</name>
              <description>Receive DMA Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_DMATXMIS</name>
              <description>Transmit DMA Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_NACKMIS</name>
              <description>Address/Data NACK Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_STARTMIS</name>
              <description>START Detection Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_STOPMIS</name>
              <description>STOP Detection Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_ARBLOSTMIS</name>
              <description>Arbitration Lost Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_TXMIS</name>
              <description>Transmit Request Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_RXMIS</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_TXFEMIS</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MMIS_RXFFMIS</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
