m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>I2C_MICR</name>
          <displayName>I2C_MICR</displayName>
          <description>I2C Master Interrupt Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MICR_IC</name>
              <description>Master Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_CLKIC</name>
              <description>Clock Timeout Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_DMARXIC</name>
              <description>Receive DMA Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_DMATXIC</name>
              <description>Transmit DMA Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_NACKIC</name>
              <description>Address/Data NACK Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_STARTIC</name>
              <description>START Detection Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_STOPIC</name>
              <description>STOP Detection Interrupt Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_ARBLOSTIC</name>
              <description>Arbitration Lost Interrupt Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_TXIC</name>
              <description>Transmit FIFO Request Interrupt Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_RXIC</name>
              <description>Receive FIFO Request Interrupt Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_TXFEIC</name>
              <description>Transmit FIFO Empty Interrupt Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_RXFFIC</name>
              <description>Receive FIFO Full Interrupt Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MCR</name>
          <displayName>I2C_MCR</displayName>
          <description>I2C Master Configuration</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MCR_LPBK</name>
              <description>I2C Loopback</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCR_MFE</name>
              <description>I2C Master Function Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MCR_SFE</name>
              <description>I2C Slave Function Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MCLKOCNT</name>
          <displayName>I2C_MCLKOCNT</displayName>
          <description>I2C Master Clock Low Timeout Count</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MCLKOCNT_CNTL</name>
              <description>I2C Master Count</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MBMON</name>
          <displayName>I2C_MBMON</displayName>
          <description>I2C Master Bus Monitor</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MBMON_SCL</name>
              <description>I2C SCL Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_MBMON_SDA</name>
              <description>I2C SDA Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MBLEN</name>
          <displayName>I2C_MBLEN</displayName>
          <description>I2C Master Burst Length</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MBLEN_CNTL</name>
              <description>I2C Burst Length</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MBCNT</name>
          <displayName>I2C_MBCNT</displayName>
          <description>I2C Master Burst Count</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MBCNT_CNTL</name>
              <description>I2C Master Burst Count</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SOAR</name>
          <displayName>I2C_SOAR</displayName>
          <description>I2C Slave Own Address</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SOAR_OAR</name>
              <description>I2C Slave Own Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SCSR</name>
          <displayName>I2C_SCSR</displayName>
          <description>I2C Slave Control/Status</description>
          <addressOffset>0x00000804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SCSR_DA</name>
              <description>Device Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_RREQ</name>
              <description>Receive Request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_TXFIFO</name>
              <description>TX FIFO Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_TREQ</name>
              <description>Transmit Request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_FBR</name>
              <description>First Byte Received</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_RXFIFO</name>
              <description>RX FIFO Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_OAR2SEL</name>
              <description>OAR2 Address Matched</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_QCMDST</name>
              <description>Quick Command Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_QCMDRW</name>
              <description>Quick Command Read / Write</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_ACTDMATX</name>
              <description>DMA TX Active Status</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SCSR_ACTDMARX</name>
              <description>DMA RX Active Status</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SDR</name>
          <displayName>I2C_SDR</displayName>
          <description>I2C Slave Data</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SDR_DATA</name>
              <description>Data for Transfer</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SIMR</name>
          <displayName>I2C_SIMR</displayName>
          <description>I2C Slave Interrupt Mask</description>
          <addressOffset>0x0000080C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SIMR_DATAIM</name>
              <description>Data Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_STARTIM</name>
              <description>Start Condition Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_STOPIM</name>
              <description>Stop Condition Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_DMARXIM</name>
              <description>Receive DMA Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_DMATXIM</name>
              <description>Transmit DMA Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_TXIM</name>
              <description>Transmit FIFO Request Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_RXIM</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_TXFEIM</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SIMR_RXFFIM</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SRIS</name>
          <displayName>I2C_SRIS</displayName>
          <description>I2C Slave Raw Interrupt Status</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SRIS_DATARIS</name>
              <description>Data Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_STARTRIS</name>
              <description>Start Condition Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_STOPRIS</name>
              <description>Stop Condition Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_DMARXRIS</name>
              <description>Receive DMA Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_DMATXRIS</name>
              <description>Transmit DMA Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_TXRIS</name>
              <description>Transmit Request Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_RXRIS</name>
              <description>Receive FIFO Request Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_TXFERIS</name>
              <description>Transmit FIFO Empty Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SRIS_RXFFRIS</name>
              <description>Receive FIFO Full Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SMIS</name>
          <displayName>I2C_SMIS</displayName>
          <description>I2C Slave Masked Interrupt Status</description>
          <addressOffset>0x00000814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SMIS_DATAMIS</name>
              <description>Data Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_STARTMIS</name>
              <description>Start Condition Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_STOPMIS</name>
              <description>Stop Condition Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_DMARXMIS</name>
              <description>Receive DMA Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_DMATXMIS</name>
              <description>Transmit DMA Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_TXMIS</name>
              <description>Transmit FIFO Request Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_RXMIS</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_TXFEMIS</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_SMIS_RXFFMIS</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SICR</name>
          <displayName>I2C_SICR</displayName>
          <description>I2C Slave Interrupt Clear</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SICR_DATAIC</name>
              <description>Data Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_STARTIC</name>
              <description>Start Condition Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_STOPIC</name>
              <description>Stop Condition Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_DMARXIC</name>
              <description>Receive DMA Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_DMATXIC</name>
              <description>Transmit DMA Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_TXIC</name>
              <description>Transmit Request Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_RXIC</name>
              <description>Receive Request Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_TXFEIC</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_RXFFIC</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SOAR2</name>
          <displayName>I2C_SOAR2</displayName>
          <description>I2C Slave Own Address 2</description>
          <addressOffset>0x0000081C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SOAR2_OAR2</name>
              <description>I2C Slave Own Address 2</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SOAR2_OAR2EN</name>
              <description>I2C Slave Own Address 2 Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_SACKCTL</name>
          <displayName>I2C_SACKCTL</displayName>
          <description>I2C Slave ACK Control</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_SACKCTL_ACKOEN</name>
              <description>I2C Slave ACK Override Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SACKCTL_ACKOVAL</name>
              <description>I2C Slave ACK Override Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_FIFODATA</name>
          <displayName>I2C_FIFODATA</displayName>
          <description>I2C FIFO Data</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_FIFODATA_DATA</name>
              <description>I2C TX FIFO Write Data Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
