m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>I2C_FIFOCTL</name>
          <displayName>I2C_FIFOCTL</displayName>
          <description>I2C FIFO Control</description>
          <addressOffset>0x00000F04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_FIFOCTL_TXTRIG</name>
              <description>TX FIFO Trigger</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_DMATXENA</name>
              <description>DMA TX Channel Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_TXFLUSH</name>
              <description>TX FIFO Flush</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_TXASGNMT</name>
              <description>TX Control Assignment</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_RXTRIG</name>
              <description>RX FIFO Trigger</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_DMARXENA</name>
              <description>DMA RX Channel Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_RXFLUSH</name>
              <description>RX FIFO Flush</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_FIFOCTL_RXASGNMT</name>
              <description>RX Control Assignment</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_FIFOSTATUS</name>
          <displayName>I2C_FIFOSTATUS</displayName>
          <description>I2C FIFO Status</description>
          <addressOffset>0x00000F08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_FIFOSTATUS_TXFE</name>
              <description>TX FIFO Empty</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_TXFF</name>
              <description>TX FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_TXBLWTRIG</name>
              <description>TX FIFO Below Trigger Level</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_RXFE</name>
              <description>RX FIFO Empty</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_RXFF</name>
              <description>RX FIFO Full</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_RXABVTRIG</name>
              <description>RX FIFO Above Trigger Level</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_PP</name>
          <displayName>I2C_PP</displayName>
          <description>I2C Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_PP_HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_PC</name>
          <displayName>I2C_PC</displayName>
          <description>I2C Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_PC_HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C2</name>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C3</name>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1290kcpdt/pwm.xml -->
    <peripheral>
      <name>PWM0</name>
      <description>PWM register offsets</description>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>PWM_CTL</name>
          <displayName>PWM_CTL</displayName>
          <description>PWM Master Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_CTL_GLOBALSYNC0</name>
              <description>Update PWM Generator 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC1</name>
              <description>Update PWM Generator 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC2</name>
              <description>Update PWM Generator 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC3</name>
              <description>Update PWM Generator 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_SYNC</name>
          <displayName>PWM_SYNC</displayName>
          <description>PWM Time Base Sync</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_SYNC_SYNC0</name>
              <description>Reset Generator 0 Counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_SYNC_SYNC1</name>
              <description>Reset Generator 1 Counter</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_SYNC_SYNC2</name>
              <description>Reset Generator 2 Counter</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_SYNC_SYNC3</name>
              <description>Reset Generator 3 Counter</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_ENABLE</name>
          <displayName>PWM_ENABLE</displayName>
          <description>PWM Output Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_ENABLE_PWM0EN</name>
              <description>MnPWM0 Output Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM1EN</name>
              <description>MnPWM1 Output Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM2EN</name>
              <description>MnPWM2 Output Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM3EN</name>
              <description>MnPWM3 Output Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM4EN</name>
              <description>MnPWM4 Output Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM5EN</name>
              <description>MnPWM5 Output Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM6EN</name>
              <description>MnPWM6 Output Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ENABLE_PWM7EN</name>
              <description>MnPWM7 Output Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_INVERT</name>
          <displayName>PWM_INVERT</displayName>
          <description>PWM Output Inversion</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_INVERT_PWM0INV</name>
              <description>Invert MnPWM0 Signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM1INV</name>
              <description>Invert MnPWM1 Signal</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM2INV</name>
              <description>Invert MnPWM2 Signal</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM3INV</name>
              <description>Invert MnPWM3 Signal</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM4INV</name>
              <description>Invert MnPWM4 Signal</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM5INV</name>
              <description>Invert MnPWM5 Signal</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM6INV</name>
              <description>Invert MnPWM6 Signal</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INVERT_PWM7INV</name>
              <description>Invert MnPWM7 Signal</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_FAULT</name>
          <displayName>PWM_FAULT</displayName>
          <description>PWM Output Fault</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_FAULT_FAULT0</name>
              <description>MnPWM0 Fault</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT1</name>
              <description>MnPWM1 Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT2</name>
              <description>MnPWM2 Fault</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT3</name>
              <description>MnPWM3 Fault</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT4</name>
              <description>MnPWM4 Fault</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT5</name>
              <description>MnPWM5 Fault</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT6</name>
              <description>MnPWM6 Fault</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_FAULT_FAULT7</name>
              <description>MnPWM7 Fault</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_INTEN</name>
          <displayName>PWM_INTEN</displayName>
          <description>PWM Interrupt Enable</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_INTEN_INTPWM0</name>
              <description>PWM0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM1</name>
              <description>PWM1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM2</name>
              <description>PWM2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM3</name>
              <description>PWM3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT0</name>
              <description>Interrupt Fault 0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT1</name>
              <description>Interrupt Fault 1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT2</name>
              <description>Interrupt Fault 2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT3</name>
              <description>Interrupt Fault 3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_RIS</name>
          <displayName>PWM_RIS</displayName>
          <description>PWM Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_RIS_INTPWM0</name>
              <description>PWM0 Interrupt Asserted</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTPWM1</name>
              <description>PWM1 Interrupt Asserted</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTPWM2</name>
              <description>PWM2 Interrupt Asserted</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTPWM3</name>
              <description>PWM3 Interrupt Asserted</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT0</name>
              <description>Interrupt Fault PWM 0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT1</name>
              <description>Interrupt Fault PWM 1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT2</name>
              <description>Interrupt Fault PWM 2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT3</name>
              <description>Interrupt Fault PWM 3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_ISC</name>
          <displayName>PWM_ISC</displayName>
          <description>PWM Interrupt Status and Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_ISC_INTPWM0</name>
              <description>PWM0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTPWM1</name>
              <description>PWM1 Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTPWM2</name>
              <description>PWM2 Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTPWM3</name>
              <description>PWM3 Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT0</name>
              <description>FAULT0 Interrupt Asserted</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT1</name>
              <description>FAULT1 Interrupt Asserted</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT2</name>
              <description>FAULT2 Interrupt Asserted</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT3</name>
              <description>FAULT3 Interrupt Asserted</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_STATUS</name>
          <displayName>PWM_STATUS</displayName>
          <description>PWM Status</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_STATUS_FAULT0</name>
              <description>Generator 0 Fault Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_STATUS_FAULT1</name>
              <description>Generator 1 Fault Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_STATUS_FAULT2</name>
              <description>Generator 2 Fault Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_STATUS_FAULT3</name>
              <description>Generator 3 Fault Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
