m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>PWM_0_ISC</name>
          <displayName>PWM_0_ISC</displayName>
          <description>PWM0 Interrupt Status and Clear</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_ISC_INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_ISC_INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_ISC_INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_ISC_INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_ISC_INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_ISC_INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_LOAD</name>
          <displayName>PWM_0_LOAD</displayName>
          <description>PWM0 Load</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_LOAD</name>
              <description>Counter Load Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_COUNT</name>
          <displayName>PWM_0_COUNT</displayName>
          <description>PWM0 Counter</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_COUNT</name>
              <description>Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_CMPA</name>
          <displayName>PWM_0_CMPA</displayName>
          <description>PWM0 Compare A</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_CMPA</name>
              <description>Comparator A Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_CMPB</name>
          <displayName>PWM_0_CMPB</displayName>
          <description>PWM0 Compare B</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_CMPB</name>
              <description>Comparator B Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_GENA</name>
          <displayName>PWM_0_GENA</displayName>
          <description>PWM0 Generator A Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_GENA_ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_GENB</name>
          <displayName>PWM_0_GENB</displayName>
          <description>PWM0 Generator B Control</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_DBCTL</name>
          <displayName>PWM_0_DBCTL</displayName>
          <description>PWM0 Dead-Band Control</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_DBRISE</name>
          <displayName>PWM_0_DBRISE</displayName>
          <description>PWM0 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_DBRISE_DELAY</name>
              <description>Dead-Band Rise Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_DBFALL</name>
          <displayName>PWM_0_DBFALL</displayName>
          <description>PWM0 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_DBFALL_DELAY</name>
              <description>Dead-Band Fall Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_0_FLTSRC0</name>
          <displayName>PWM_0_FLTSRC0</displayName>
          <description>PWM0 Fault Source 0</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_FLTSRC0_FAULT0</name>
              <description>Fault0 Input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSRC0_FAULT1</name>
              <description>Fault1 Input</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSRC0_FAULT2</name>
              <description>Fault2 Input</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSRC0_FAULT3</name>
              <description>Fault3 Input</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
