m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>PWM_1_GENA</name>
          <displayName>PWM_1_GENA</displayName>
          <description>PWM1 Generator A Control</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_GENA_ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTZERO_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTLOAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENA_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENA_ACTCMPBD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_GENB</name>
          <displayName>PWM_1_GENB</displayName>
          <description>PWM1 Generator B Control</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTZERO_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTZERO_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTZERO_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENB_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTLOAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTLOAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTLOAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_1_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_1_GENB_ACTCMPBD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_DBCTL</name>
          <displayName>PWM_1_DBCTL</displayName>
          <description>PWM1 Dead-Band Control</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_DBRISE</name>
          <displayName>PWM_1_DBRISE</displayName>
          <description>PWM1 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_DBRISE_RISEDELAY</name>
              <description>Dead-Band Rise Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_DBFALL</name>
          <displayName>PWM_1_DBFALL</displayName>
          <description>PWM1 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_DBFALL_FALLDELAY</name>
              <description>Dead-Band Fall Delay</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_FLTSRC0</name>
          <displayName>PWM_1_FLTSRC0</displayName>
          <description>PWM1 Fault Source 0</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_FLTSRC0_FAULT0</name>
              <description>Fault0 Input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC0_FAULT1</name>
              <description>Fault1 Input</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC0_FAULT2</name>
              <description>Fault2 Input</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC0_FAULT3</name>
              <description>Fault3 Input</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_FLTSRC1</name>
          <displayName>PWM_1_FLTSRC1</displayName>
          <description>PWM1 Fault Source 1</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_FLTSRC1_DCMP0</name>
              <description>Digital Comparator 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP1</name>
              <description>Digital Comparator 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP2</name>
              <description>Digital Comparator 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP3</name>
              <description>Digital Comparator 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP4</name>
              <description>Digital Comparator 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP5</name>
              <description>Digital Comparator 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP6</name>
              <description>Digital Comparator 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSRC1_DCMP7</name>
              <description>Digital Comparator 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_MINFLTPER</name>
          <displayName>PWM_1_MINFLTPER</displayName>
          <description>PWM1 Minimum Fault Period</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_MINFLTPER_MFP</name>
              <description>Minimum Fault Period</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
