m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>PWM_2_CTL</name>
          <displayName>PWM_2_CTL</displayName>
          <description>PWM2 Control</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_CTL_ENABLE</name>
              <description>PWM Block Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_MODE</name>
              <description>Counter Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_DEBUG</name>
              <description>Debug Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_LOADUPD</name>
              <description>Load Register Update Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_CMPAUPD</name>
              <description>Comparator A Update Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_CMPBUPD</name>
              <description>Comparator B Update Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_GENAUPD</name>
              <description>PWMnGENA Update Mode</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_CTL_GENAUPD_I</name>
                  <description>Immediate</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_GENAUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_GENAUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_CTL_GENBUPD</name>
              <description>PWMnGENB Update Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_CTL_GENBUPD_I</name>
                  <description>Immediate</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_GENBUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_GENBUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_CTL_DBCTLUPD</name>
              <description>PWMnDBCTL Update Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBCTLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBCTLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBCTLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_CTL_DBRISEUPD</name>
              <description>PWMnDBRISE Update Mode</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBRISEUPD_I</name>
                  <description>Immediate</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBRISEUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBRISEUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x00003000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_CTL_DBFALLUPD</name>
              <description>PWMnDBFALL Update Mode</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBFALLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBFALLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_CTL_DBFALLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_CTL_FLTSRC</name>
              <description>Fault Condition Source</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_CTL_LATCH</name>
              <description>Latch Fault Input</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_INTEN</name>
          <displayName>PWM_2_INTEN</displayName>
          <description>PWM2 Interrupt and Trigger Enable</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_INTEN_INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_INTCNTLOAD</name>
              <description>Interrupt for Counter=PWMnLOAD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_INTCMPAU</name>
              <description>Interrupt for Counter=PWMnCMPA Up</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_INTCMPAD</name>
              <description>Interrupt for Counter=PWMnCMPA Down</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_INTCMPBU</name>
              <description>Interrupt for Counter=PWMnCMPB Up</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_INTCMPBD</name>
              <description>Interrupt for Counter=PWMnCMPB Down</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_TRCNTLOAD</name>
              <description>Trigger for Counter=PWMnLOAD</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_TRCMPAU</name>
              <description>Trigger for Counter=PWMnCMPA Up</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_TRCMPAD</name>
              <description>Trigger for Counter=PWMnCMPA Down</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_TRCMPBU</name>
              <description>Trigger for Counter=PWMnCMPB Up</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_INTEN_TRCMPBD</name>
              <description>Trigger for Counter=PWMnCMPB Down</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_RIS</name>
          <displayName>PWM_2_RIS</displayName>
          <description>PWM2 Raw Interrupt Status</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_RIS_INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_RIS_INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_RIS_INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_RIS_INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_RIS_INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_RIS_INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_ISC</name>
          <displayName>PWM_2_ISC</displayName>
          <description>PWM2 Interrupt Status and Clear</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_ISC_INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_ISC_INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_ISC_INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_ISC_INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_ISC_INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_ISC_INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_LOAD</name>
          <displayName>PWM_2_LOAD</displayName>
          <description>PWM2 Load</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_LOAD_LOAD</name>
              <description>Counter Load Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_COUNT</name>
          <displayName>PWM_2_COUNT</displayName>
          <description>PWM2 Counter</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_COUNT_COUNT</name>
              <description>Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_CMPA</name>
          <displayName>PWM_2_CMPA</displayName>
          <description>PWM2 Compare A</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_CMPA_COMPA</name>
              <description>Comparator A Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_CMPB</name>
          <displayName>PWM_2_CMPB</displayName>
          <description>PWM2 Compare B</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_CMPB_COMPB</name>
              <description>Comparator B Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
