m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>PWM_0_FLTSTAT1</name>
          <displayName>PWM_0_FLTSTAT1</displayName>
          <description>PWM0 Fault Status 1</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_0_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_FLTSEN</name>
          <displayName>PWM_1_FLTSEN</displayName>
          <description>PWM1 Fault Pin Logic Sense</description>
          <addressOffset>0x00000880</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_FLTSTAT0</name>
          <displayName>PWM_1_FLTSTAT0</displayName>
          <description>PWM1 Fault Status 0</description>
          <addressOffset>0x00000884</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_1_FLTSTAT1</name>
          <displayName>PWM_1_FLTSTAT1</displayName>
          <description>PWM1 Fault Status 1</description>
          <addressOffset>0x00000888</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_1_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_FLTSEN</name>
          <displayName>PWM_2_FLTSEN</displayName>
          <description>PWM2 Fault Pin Logic Sense</description>
          <addressOffset>0x00000900</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_FLTSTAT0</name>
          <displayName>PWM_2_FLTSTAT0</displayName>
          <description>PWM2 Fault Status 0</description>
          <addressOffset>0x00000904</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_2_FLTSTAT1</name>
          <displayName>PWM_2_FLTSTAT1</displayName>
          <description>PWM2 Fault Status 1</description>
          <addressOffset>0x00000908</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_3_FLTSEN</name>
          <displayName>PWM_3_FLTSEN</displayName>
          <description>PWM3 Fault Pin Logic Sense</description>
          <addressOffset>0x00000980</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_3_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_3_FLTSTAT0</name>
          <displayName>PWM_3_FLTSTAT0</displayName>
          <description>PWM3 Fault Status 0</description>
          <addressOffset>0x00000984</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_3_FLTSTAT1</name>
          <displayName>PWM_3_FLTSTAT1</displayName>
          <description>PWM3 Fault Status 1</description>
          <addressOffset>0x00000988</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_PP</name>
          <displayName>PWM_PP</displayName>
          <description>PWM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_PP_GCNT</name>
              <description>Generators</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_PP_FCNT</name>
              <description>Fault Inputs (per PWM unit)</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_PP_ESYNC</name>
              <description>Extended Synchronization</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_PP_EFAULT</name>
              <description>Extended Fault</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_PP_ONE</name>
              <description>One-Shot Mode</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CC</name>
          <displayName>PWM_CC</displayName>
          <description>PWM Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM_CC_PWMDIV</name>
              <description>PWM Clock Divider</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_2</name>
                  <description>/2</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_4</name>
                  <description>/4</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_8</name>
                  <description>/8</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_16</name>
                  <description>/16</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_32</name>
                  <description>/32</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_64</name>
                  <description>/64</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_CC_USEPWM</name>
              <description>Use PWM Clock Divisor</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
