m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/qei.xml -->
    <peripheral>
      <name>QEI0</name>
      <description>QEI register offsets</description>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>QEI_CTL</name>
          <displayName>QEI_CTL</displayName>
          <description>QEI Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_CTL_ENABLE</name>
              <description>Enable QEI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_SWAP</name>
              <description>Swap Signals</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_SIGMODE</name>
              <description>Signal Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_CAPMODE</name>
              <description>Capture Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_RESMODE</name>
              <description>Reset Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_VELEN</name>
              <description>Capture Velocity</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_VELDIV</name>
              <description>Predivide Velocity</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_1</name>
                  <description>QEI clock /1</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_2</name>
                  <description>QEI clock /2</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_4</name>
                  <description>QEI clock /4</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_8</name>
                  <description>QEI clock /8</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_16</name>
                  <description>QEI clock /16</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_32</name>
                  <description>QEI clock /32</description>
                  <value>0x00000140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_64</name>
                  <description>QEI clock /64</description>
                  <value>0x00000180</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_128</name>
                  <description>QEI clock /128</description>
                  <value>0x000001C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QEI_CTL_INVA</name>
              <description>Invert PhA</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_INVB</name>
              <description>Invert PhB</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_INVI</name>
              <description>Invert Index Pulse</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_STALLEN</name>
              <description>Stall QEI</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_FILTEN</name>
              <description>Enable Input Filter</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_CTL_FILTCNT</name>
              <description>Input Filter Prescale Count</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI_STAT</name>
          <displayName>QEI_STAT</displayName>
          <description>QEI Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_STAT_ERROR</name>
              <description>Error Detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI_STAT_DIRECTION</name>
              <description>Direction of Rotation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI_POS</name>
          <displayName>QEI_POS</displayName>
          <description>QEI Position</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>QEI_MAXPOS</name>
          <displayName>QEI_MAXPOS</displayName>
          <description>QEI Maximum Position</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>QEI_LOAD</name>
          <displayName>QEI_LOAD</displayName>
          <description>QEI Timer Load</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>QEI_TIME</name>
          <displayName>QEI_TIME</displayName>
          <description>QEI Timer</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>QEI_COUNT</name>
          <displayName>QEI_COUNT</displayName>
          <description>QEI Velocity Counter</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>QEI_SPEED</name>
          <displayName>QEI_SPEED</displayName>
          <description>QEI Velocity</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>QEI_INTEN</name>
          <displayName>QEI_INTEN</displayName>
          <description>QEI Interrupt Enable</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_INTEN_INDEX</name>
              <description>Index Pulse Detected Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_INTEN_TIMER</name>
              <description>Timer Expires Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_INTEN_DIR</name>
              <description>Direction Change Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_INTEN_ERROR</name>
              <description>Phase Error Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI_RIS</name>
          <displayName>QEI_RIS</displayName>
          <description>QEI Raw Interrupt Status</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_RIS_INDEX</name>
              <description>Index Pulse Asserted</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI_RIS_TIMER</name>
              <description>Velocity Timer Expired</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI_RIS_DIR</name>
              <description>Direction Change Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI_RIS_ERROR</name>
              <description>Phase Error Detected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI_ISC</name>
          <displayName>QEI_ISC</displayName>
          <description>QEI Interrupt Status and Clear</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_ISC_INDEX</name>
              <description>Index Pulse Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_ISC_TIMER</name>
              <description>Velocity Timer Expired Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_ISC_DIR</name>
              <description>Direction Change Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI_ISC_ERROR</name>
              <description>Phase Error Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
