m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral>
      <name>TIMER0</name>
      <description>Timer register offsets</description>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>TIMER_CFG</name>
          <displayName>TIMER_CFG</displayName>
          <description>GPTM Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CFG</name>
              <description>GPTM Configuration</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_TIMER</name>
                  <description>For a 16/32-bit timer, this value selects the 32-bit timer configuration</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_RTC</name>
                  <description>For a 16/32-bit timer, this value selects the 32-bit real-time clock (RTC) counter configuration</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_16_BIT</name>
                  <description>For a 16/32-bit timer, this value selects the 16-bit timer configuration</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TAMR</name>
          <displayName>TIMER_TAMR</displayName>
          <description>GPTM Timer A Mode</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TAMR_TAMR</name>
              <description>GPTM Timer A Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_CAP</name>
                  <description>Capture mode</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_TAMR_TACMR</name>
              <description>GPTM Timer A Capture Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAAMS</name>
              <description>GPTM Timer A Alternate Mode Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TACDIR</name>
              <description>GPTM Timer A Count Direction</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAMIE</name>
              <description>GPTM Timer A Match Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAWOT</name>
              <description>GPTM Timer A Wait-on-Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TASNAPS</name>
              <description>GPTM Timer A Snap-Shot Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAILD</name>
              <description>GPTM Timer A Interval Load Write</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAPWMIE</name>
              <description>GPTM Timer A PWM Interrupt Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAMRSU</name>
              <description>GPTM Timer A Match Register Update</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TAPLO</name>
              <description>GPTM Timer A PWM Legacy Operation</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TACINTD</name>
              <description>One-shot/Periodic Interrupt Disable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TAMR_TCACT</name>
              <description>Timer Compare Action Select</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_NONE</name>
                  <description>Disable compare operations</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_TOGGLE</name>
                  <description>Toggle State on Time-Out</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_CLRTO</name>
                  <description>Clear CCP on Time-Out</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_SETTO</name>
                  <description>Set CCP on Time-Out</description>
                  <value>0x00006000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_SETTOGTO</name>
                  <description>Set CCP immediately and toggle on Time-Out</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_CLRTOGTO</name>
                  <description>Clear CCP immediately and toggle on Time-Out</description>
                  <value>0x0000A000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_SETCLRTO</name>
                  <description>Set CCP immediately and clear on Time-Out</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TCACT_CLRSETTO</name>
                  <description>Clear CCP immediately and set on Time-Out</description>
                  <value>0x0000E000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TBMR</name>
          <displayName>TIMER_TBMR</displayName>
          <description>GPTM Timer B Mode</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TBMR_TBMR</name>
              <description>GPTM Timer B Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_CAP</name>
                  <description>Capture mode</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_TBMR_TBCMR</name>
              <description>GPTM Timer B Capture Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBAMS</name>
              <description>GPTM Timer B Alternate Mode Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBCDIR</name>
              <description>GPTM Timer B Count Direction</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBMIE</name>
              <description>GPTM Timer B Match Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBWOT</name>
              <description>GPTM Timer B Wait-on-Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBSNAPS</name>
              <description>GPTM Timer B Snap-Shot Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBILD</name>
              <description>GPTM Timer B Interval Load Write</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBPWMIE</name>
              <description>GPTM Timer B PWM Interrupt Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBMRSU</name>
              <description>GPTM Timer B Match Register Update</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBPLO</name>
              <description>GPTM Timer B PWM Legacy Operation</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TBCINTD</name>
              <description>One-Shot/Periodic Interrupt Disable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TBMR_TCACT</name>
              <description>Timer Compare Action Select</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_NONE</name>
                  <description>Disable compare operations</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_TOGGLE</name>
                  <description>Toggle State on Time-Out</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_CLRTO</name>
                  <description>Clear CCP on Time-Out</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_SETTO</name>
                  <description>Set CCP on Time-Out</description>
                  <value>0x00006000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_SETTOGTO</name>
                  <description>Set CCP immediately and toggle on Time-Out</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_CLRTOGTO</name>
                  <description>Clear CCP immediately and toggle on Time-Out</description>
                  <value>0x0000A000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_SETCLRTO</name>
                  <description>Set CCP immediately and clear on Time-Out</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TCACT_CLRSETTO</name>
                  <description>Clear CCP immediately and set on Time-Out</description>
                  <value>0x0000E000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CTL</name>
          <displayName>TIMER_CTL</displayName>
          <description>GPTM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CTL_TAEN</name>
              <description>GPTM Timer A Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TASTALL</name>
              <description>GPTM Timer A Stall Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TAEVENT</name>
              <description>GPTM Timer A Event Mode</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_POS</name>
                  <description>Positive edge</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_NEG</name>
                  <description>Negative edge</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_BOTH</name>
                  <description>Both edges</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_CTL_RTCEN</name>
              <description>GPTM RTC Stall Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TAOTE</name>
              <description>GPTM Timer A Output Trigger Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TAPWML</name>
              <description>GPTM Timer A PWM Output Level</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TBEN</name>
              <description>GPTM Timer B Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TBSTALL</name>
              <description>GPTM Timer B Stall Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TBEVENT</name>
              <description>GPTM Timer B Event Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_POS</name>
                  <description>Positive edge</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_NEG</name>
                  <description>Negative edge</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_BOTH</name>
                  <description>Both edges</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_CTL_TBOTE</name>
              <description>GPTM Timer B Output Trigger Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CTL_TBPWML</name>
              <description>GPTM Timer B PWM Output Level</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
