m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>TIMER_SYNC</name>
          <displayName>TIMER_SYNC</displayName>
          <description>GPTM Synchronize</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_SYNC_SYNCT0</name>
              <description>Synchronize GPTM Timer 0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_NONE</name>
                  <description>GPTM0 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TA</name>
                  <description>A timeout event for Timer A of GPTM0 is triggered</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TB</name>
                  <description>A timeout event for Timer B of GPTM0 is triggered</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM0 is triggered</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT1</name>
              <description>Synchronize GPTM Timer 1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_NONE</name>
                  <description>GPTM1 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TA</name>
                  <description>A timeout event for Timer A of GPTM1 is triggered</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TB</name>
                  <description>A timeout event for Timer B of GPTM1 is triggered</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM1 is triggered</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT2</name>
              <description>Synchronize GPTM Timer 2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_NONE</name>
                  <description>GPTM2 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TA</name>
                  <description>A timeout event for Timer A of GPTM2 is triggered</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TB</name>
                  <description>A timeout event for Timer B of GPTM2 is triggered</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM2 is triggered</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT3</name>
              <description>Synchronize GPTM Timer 3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_NONE</name>
                  <description>GPTM3 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TA</name>
                  <description>A timeout event for Timer A of GPTM3 is triggered</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TB</name>
                  <description>A timeout event for Timer B of GPTM3 is triggered</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM3 is triggered</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT4</name>
              <description>Synchronize GPTM Timer 4</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_NONE</name>
                  <description>GPTM4 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TA</name>
                  <description>A timeout event for Timer A of GPTM4 is triggered</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TB</name>
                  <description>A timeout event for Timer B of GPTM4 is triggered</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM4 is triggered</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT5</name>
              <description>Synchronize GPTM Timer 5</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_NONE</name>
                  <description>GPTM5 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TA</name>
                  <description>A timeout event for Timer A of GPTM5 is triggered</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TB</name>
                  <description>A timeout event for Timer B of GPTM5 is triggered</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM5 is triggered</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT6</name>
              <description>Synchronize GPTM Timer 6</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_NONE</name>
                  <description>GPTM6 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_TA</name>
                  <description>A timeout event for Timer A of GPTM6 is triggered</description>
                  <value>0x00001000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_TB</name>
                  <description>A timeout event for Timer B of GPTM6 is triggered</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM6 is triggered</description>
                  <value>0x00003000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT7</name>
              <description>Synchronize GPTM Timer 7</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_NONE</name>
                  <description>GPT7 is not affected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_TA</name>
                  <description>A timeout event for Timer A of GPTM7 is triggered</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_TB</name>
                  <description>A timeout event for Timer B of GPTM7 is triggered</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM7 is triggered</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_IMR</name>
          <displayName>TIMER_IMR</displayName>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_IMR_TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_CAMIM</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_CAEIM</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_RTCIM</name>
              <description>GPTM RTC Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_TAMIM</name>
              <description>GPTM Timer A Match Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_DMAAIM</name>
              <description>GPTM Timer A DMA Done Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_CBMIM</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_CBEIM</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_TBMIM</name>
              <description>GPTM Timer B Match Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_IMR_DMABIM</name>
              <description>GPTM Timer B DMA Done Interrupt Mask</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_RIS</name>
          <displayName>TIMER_RIS</displayName>
          <description>GPTM Raw Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_RIS_TATORIS</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_CAMRIS</name>
              <description>GPTM Timer A Capture Mode Match Raw Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_CAERIS</name>
              <description>GPTM Timer A Capture Mode Event Raw Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_RTCRIS</name>
              <description>GPTM RTC Raw Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_TAMRIS</name>
              <description>GPTM Timer A Match Raw Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_DMAARIS</name>
              <description>GPTM Timer A DMA Done Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_TBTORIS</name>
              <description>GPTM Timer B Time-Out Raw Interrupt</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_CBMRIS</name>
              <description>GPTM Timer B Capture Mode Match Raw Interrupt</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_CBERIS</name>
              <description>GPTM Timer B Capture Mode Event Raw Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_TBMRIS</name>
              <description>GPTM Timer B Match Raw Interrupt</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_RIS_DMABRIS</name>
              <description>GPTM Timer B DMA Done Raw Interrupt Status</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_MIS</name>
          <displayName>TIMER_MIS</displayName>
          <description>GPTM Masked Interrupt Status</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_MIS_TATOMIS</name>
              <description>GPTM Timer A Time-Out Masked Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_CAMMIS</name>
              <description>GPTM Timer A Capture Mode Match Masked Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_CAEMIS</name>
              <description>GPTM Timer A Capture Mode Event Masked Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_RTCMIS</name>
              <description>GPTM RTC Masked Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_TAMMIS</name>
              <description>GPTM Timer A Match Masked Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_DMAAMIS</name>
              <description>GPTM Timer A DMA Done Masked Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_TBTOMIS</name>
              <description>GPTM Timer B Time-Out Masked Interrupt</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_CBMMIS</name>
              <description>GPTM Timer B Capture Mode Match Masked Interrupt</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_CBEMIS</name>
              <description>GPTM Timer B Capture Mode Event Masked Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_TBMMIS</name>
              <description>GPTM Timer B Match Masked Interrupt</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_MIS_DMABMIS</name>
              <description>GPTM Timer B DMA Done Masked Interrupt</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_ICR</name>
          <displayName>TIMER_ICR</displayName>
          <description>GPTM Interrupt Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_ICR_TATOCINT</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAMCINT</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAECINT</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_RTCCINT</name>
              <description>GPTM RTC Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TAMCINT</name>
              <description>GPTM Timer A Match Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_DMAAINT</name>
              <description>GPTM Timer A DMA Done Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBTOCINT</name>
              <description>GPTM Timer B Time-Out Interrupt Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBMCINT</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBECINT</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBMCINT</name>
              <description>GPTM Timer B Match Interrupt Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_DMABINT</name>
              <description>GPTM Timer B DMA Done Interrupt Clear</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
