m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>TIMER_TAILR</name>
          <displayName>TIMER_TAILR</displayName>
          <description>GPTM Timer A Interval Load</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TIMER_TBILR</name>
          <displayName>TIMER_TBILR</displayName>
          <description>GPTM Timer B Interval Load</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TIMER_TAMATCHR</name>
          <displayName>TIMER_TAMATCHR</displayName>
          <description>GPTM Timer A Match</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TIMER_TBMATCHR</name>
          <displayName>TIMER_TBMATCHR</displayName>
          <description>GPTM Timer B Match</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TIMER_TAPR</name>
          <displayName>TIMER_TAPR</displayName>
          <description>GPTM Timer A Prescale</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TAPR_TAPSR</name>
              <description>GPTM Timer A Prescale</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TBPR</name>
          <displayName>TIMER_TBPR</displayName>
          <description>GPTM Timer B Prescale</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TBPR_TBPSR</name>
              <description>GPTM Timer B Prescale</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TAPMR</name>
          <displayName>TIMER_TAPMR</displayName>
          <description>GPTM TimerA Prescale Match</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TAPMR_TAPSMR</name>
              <description>GPTM TimerA Prescale Match</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TBPMR</name>
          <displayName>TIMER_TBPMR</displayName>
          <description>GPTM TimerB Prescale Match</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TBPMR_TBPSMR</name>
              <description>GPTM TimerB Prescale Match</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TAR</name>
          <displayName>TIMER_TAR</displayName>
          <description>GPTM Timer A</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>TIMER_TBR</name>
          <displayName>TIMER_TBR</displayName>
          <description>GPTM Timer B</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>TIMER_TAV</name>
          <displayName>TIMER_TAV</displayName>
          <description>GPTM Timer A Value</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TIMER_TBV</name>
          <displayName>TIMER_TBV</displayName>
          <description>GPTM Timer B Value</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TIMER_RTCPD</name>
          <displayName>TIMER_RTCPD</displayName>
          <description>GPTM RTC Predivide</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_RTCPD_RTCPD</name>
              <description>RTC Predivide Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TAPS</name>
          <displayName>TIMER_TAPS</displayName>
          <description>GPTM Timer A Prescale Snapshot</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TAPS_PSS</name>
              <description>GPTM Timer A Prescaler Snapshot</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_TBPS</name>
          <displayName>TIMER_TBPS</displayName>
          <description>GPTM Timer B Prescale Snapshot</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TBPS_PSS</name>
              <description>GPTM Timer A Prescaler Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_DMAEV</name>
          <displayName>TIMER_DMAEV</displayName>
          <description>GPTM DMA Event</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_DMAEV_TATODMAEN</name>
              <description>GPTM A Time-Out Event DMA Trigger Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_CAMDMAEN</name>
              <description>GPTM A Capture Match Event DMA Trigger Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_CAEDMAEN</name>
              <description>GPTM A Capture Event DMA Trigger Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_RTCDMAEN</name>
              <description>GPTM A RTC Match Event DMA Trigger Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_TAMDMAEN</name>
              <description>GPTM A Mode Match Event DMA Trigger Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_TBTODMAEN</name>
              <description>GPTM B Time-Out Event DMA Trigger Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_CBMDMAEN</name>
              <description>GPTM B Capture Match Event DMA Trigger Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_CBEDMAEN</name>
              <description>GPTM B Capture Event DMA Trigger Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_DMAEV_TBMDMAEN</name>
              <description>GPTM B Mode Match Event DMA Trigger Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_ADCEV</name>
          <displayName>TIMER_ADCEV</displayName>
          <description>GPTM ADC Event</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_ADCEV_TATOADCEN</name>
              <description>GPTM A Time-Out Event ADC Trigger Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_CAMADCEN</name>
              <description>GPTM A Capture Match Event ADC Trigger Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_CAEADCEN</name>
              <description>GPTM A Capture Event ADC Trigger Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_RTCADCEN</name>
              <description>GPTM RTC Match Event ADC Trigger Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_TAMADCEN</name>
              <description>GPTM A Mode Match Event ADC Trigger Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_TBTOADCEN</name>
              <description>GPTM B Time-Out Event ADC Trigger Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_CBMADCEN</name>
              <description>GPTM B Capture Match Event ADC Trigger Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_CBEADCEN</name>
              <description>GPTM B Capture Event ADC Trigger Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_ADCEV_TBMADCEN</name>
              <description>GPTM B Mode Match Event ADC Trigger Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_PP</name>
          <displayName>TIMER_PP</displayName>
          <description>GPTM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_PP_SIZE</name>
              <description>Count Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_PP_SIZE_16</name>
                  <description>Timer A and Timer B counters are 16 bits each with an 8-bit prescale counter</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_PP_SIZE_32</name>
                  <description>Timer A and Timer B counters are 32 bits each with a 16-bit prescale counter</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_PP_CHAIN</name>
              <description>Chain with Other Timers</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_PP_SYNCCNT</name>
              <description>Synchronize Start</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER_PP_ALTCLK</name>
              <description>Alternate Clock Source</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CC</name>
          <displayName>TIMER_CC</displayName>
          <description>GPTM Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CC_ALTCLK</name>
              <description>Alternate Clock Source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
