m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER1</name>
      <baseAddress>0x40031000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER2</name>
      <baseAddress>0x40032000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER3</name>
      <baseAddress>0x40033000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER4</name>
      <baseAddress>0x40034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER5</name>
      <baseAddress>0x40035000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1290kcpdt/adc.xml -->
    <peripheral>
      <name>ADC0</name>
      <description>ADC register offsets</description>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>ADC_ACTSS</name>
          <displayName>ADC_ACTSS</displayName>
          <description>ADC Active Sample Sequencer</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_ACTSS_ASEN0</name>
              <description>ADC SS0 Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN1</name>
              <description>ADC SS1 Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN2</name>
              <description>ADC SS2 Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN3</name>
              <description>ADC SS3 Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN0</name>
              <description>ADC SS1 DMA Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN1</name>
              <description>ADC SS1 DMA Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN2</name>
              <description>ADC SS2 DMA Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_ADEN3</name>
              <description>ADC SS3 DMA Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ACTSS_BUSY</name>
              <description>ADC Busy</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_RIS</name>
          <displayName>ADC_RIS</displayName>
          <description>ADC Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_RIS_INR0</name>
              <description>SS0 Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_INR1</name>
              <description>SS1 Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_INR2</name>
              <description>SS2 Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_INR3</name>
              <description>SS3 Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_DMAINR0</name>
              <description>SS0 DMA Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_DMAINR1</name>
              <description>SS1 DMA Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_DMAINR2</name>
              <description>SS2 DMA Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_DMAINR3</name>
              <description>SS3 DMA Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_RIS_INRDC</name>
              <description>Digital Comparator Raw Interrupt Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_IM</name>
          <displayName>ADC_IM</displayName>
          <description>ADC Interrupt Mask</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_IM_MASK0</name>
              <description>SS0 Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_MASK1</name>
              <description>SS1 Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_MASK2</name>
              <description>SS2 Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_MASK3</name>
              <description>SS3 Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DMAMASK0</name>
              <description>SS0 DMA Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DMAMASK1</name>
              <description>SS1 DMA Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DMAMASK2</name>
              <description>SS2 DMA Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DMAMASK3</name>
              <description>SS3 DMA Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DCONSS0</name>
              <description>Digital Comparator Interrupt on SS0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DCONSS1</name>
              <description>Digital Comparator Interrupt on SS1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DCONSS2</name>
              <description>Digital Comparator Interrupt on SS2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IM_DCONSS3</name>
              <description>Digital Comparator Interrupt on SS3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_ISC</name>
          <displayName>ADC_ISC</displayName>
          <description>ADC Interrupt Status and Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_ISC_IN0</name>
              <description>SS0 Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_IN1</name>
              <description>SS1 Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_IN2</name>
              <description>SS2 Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_IN3</name>
              <description>SS3 Interrupt Status and Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DMAIN0</name>
              <description>SS0 DMA Interrupt Status and Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DMAIN1</name>
              <description>SS1 DMA Interrupt Status and Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DMAIN2</name>
              <description>SS2 DMA Interrupt Status and Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DMAIN3</name>
              <description>SS3 DMA Interrupt Status and Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DCINSS0</name>
              <description>Digital Comparator Interrupt Status on SS0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DCINSS1</name>
              <description>Digital Comparator Interrupt Status on SS1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DCINSS2</name>
              <description>Digital Comparator Interrupt Status on SS2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ISC_DCINSS3</name>
              <description>Digital Comparator Interrupt Status on SS3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_OSTAT</name>
          <displayName>ADC_OSTAT</displayName>
          <description>ADC Overflow Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_OSTAT_OV0</name>
              <description>SS0 FIFO Overflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_OSTAT_OV1</name>
              <description>SS1 FIFO Overflow</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_OSTAT_OV2</name>
              <description>SS2 FIFO Overflow</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_OSTAT_OV3</name>
              <description>SS3 FIFO Overflow</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
