m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_EMUX</name>
          <displayName>ADC_EMUX</displayName>
          <description>ADC Event Multiplexer Select</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_EMUX_EM0</name>
              <description>SS0 Trigger Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_TIMER</name>
                  <description>Timer</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM1</name>
              <description>SS1 Trigger Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_TIMER</name>
                  <description>Timer</description>
                  <value>0x00000050</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x00000060</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x00000070</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x00000090</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0x000000E0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0x000000F0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM2</name>
              <description>SS2 Trigger Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x00000300</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_TIMER</name>
                  <description>Timer</description>
                  <value>0x00000500</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x00000600</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x00000700</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x00000900</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0x00000E00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0x00000F00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM3</name>
              <description>SS3 Trigger Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00001000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x00003000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_TIMER</name>
                  <description>Timer</description>
                  <value>0x00005000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x00006000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x00007000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x00009000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_NEVER</name>
                  <description>Never Trigger</description>
                  <value>0x0000E000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0x0000F000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_USTAT</name>
          <displayName>ADC_USTAT</displayName>
          <description>ADC Underflow Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_USTAT_UV0</name>
              <description>SS0 FIFO Underflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_USTAT_UV1</name>
              <description>SS1 FIFO Underflow</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_USTAT_UV2</name>
              <description>SS2 FIFO Underflow</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_USTAT_UV3</name>
              <description>SS3 FIFO Underflow</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_TSSEL</name>
          <displayName>ADC_TSSEL</displayName>
          <description>ADC Trigger Source Select</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_TSSEL_PS0</name>
              <description>Generator 0 PWM Module Trigger Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS0_0</name>
                  <description>Use Generator 0 (and its trigger) in PWM module 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TSSEL_PS1</name>
              <description>Generator 1 PWM Module Trigger Select</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS1_0</name>
                  <description>Use Generator 1 (and its trigger) in PWM module 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TSSEL_PS2</name>
              <description>Generator 2 PWM Module Trigger Select</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS2_0</name>
                  <description>Use Generator 2 (and its trigger) in PWM module 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_TSSEL_PS3</name>
              <description>Generator 3 PWM Module Trigger Select</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TSSEL_PS3_0</name>
                  <description>Use Generator 3 (and its trigger) in PWM module 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSPRI</name>
          <displayName>ADC_SSPRI</displayName>
          <description>ADC Sample Sequencer Priority</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSPRI_SS0</name>
              <description>SS0 Priority</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSPRI_SS1</name>
              <description>SS1 Priority</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSPRI_SS2</name>
              <description>SS2 Priority</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSPRI_SS3</name>
              <description>SS3 Priority</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SPC</name>
          <displayName>ADC_SPC</displayName>
          <description>ADC Sample Phase Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SPC_PHASE</name>
              <description>Phase Difference</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_0</name>
                  <description>ADC sample lags by 0.0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_22_5</name>
                  <description>ADC sample lags by 22.5</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_45</name>
                  <description>ADC sample lags by 45.0</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_67_5</name>
                  <description>ADC sample lags by 67.5</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_90</name>
                  <description>ADC sample lags by 90.0</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_112_5</name>
                  <description>ADC sample lags by 112.5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_135</name>
                  <description>ADC sample lags by 135.0</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_157_5</name>
                  <description>ADC sample lags by 157.5</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_180</name>
                  <description>ADC sample lags by 180.0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_202_5</name>
                  <description>ADC sample lags by 202.5</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_225</name>
                  <description>ADC sample lags by 225.0</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_247_5</name>
                  <description>ADC sample lags by 247.5</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_270</name>
                  <description>ADC sample lags by 270.0</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_292_5</name>
                  <description>ADC sample lags by 292.5</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_315</name>
                  <description>ADC sample lags by 315.0</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SPC_PHASE_337_5</name>
                  <description>ADC sample lags by 337.5</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_PSSI</name>
          <displayName>ADC_PSSI</displayName>
          <description>ADC Processor Sample Sequence Initiate</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_PSSI_SS0</name>
              <description>SS0 Initiate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_PSSI_SS1</name>
              <description>SS1 Initiate</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_PSSI_SS2</name>
              <description>SS2 Initiate</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_PSSI_SS3</name>
              <description>SS3 Initiate</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_PSSI_SYNCWAIT</name>
              <description>Synchronize Wait</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_PSSI_GSYNC</name>
              <description>Global Synchronize</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
