m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_SAC</name>
          <displayName>ADC_SAC</displayName>
          <description>ADC Sample Averaging Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SAC_AVG</name>
              <description>Hardware Averaging Control</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_OFF</name>
                  <description>No hardware oversampling</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_2X</name>
                  <description>2x hardware oversampling</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_4X</name>
                  <description>4x hardware oversampling</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_8X</name>
                  <description>8x hardware oversampling</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_16X</name>
                  <description>16x hardware oversampling</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_32X</name>
                  <description>32x hardware oversampling</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SAC_AVG_64X</name>
                  <description>64x hardware oversampling</description>
                  <value>0x00000006</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCISC</name>
          <displayName>ADC_DCISC</displayName>
          <description>ADC Digital Comparator Interrupt Status and Clear</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCISC_DCINT0</name>
              <description>Digital Comparator 0 Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT1</name>
              <description>Digital Comparator 1 Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT2</name>
              <description>Digital Comparator 2 Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT3</name>
              <description>Digital Comparator 3 Interrupt Status and Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT4</name>
              <description>Digital Comparator 4 Interrupt Status and Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT5</name>
              <description>Digital Comparator 5 Interrupt Status and Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT6</name>
              <description>Digital Comparator 6 Interrupt Status and Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCISC_DCINT7</name>
              <description>Digital Comparator 7 Interrupt Status and Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CTL</name>
          <displayName>ADC_CTL</displayName>
          <description>ADC Control</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_CTL_VREF</name>
              <description>Voltage Reference Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CTL_VREF_INTERNAL</name>
                  <description>VDDA and GNDA are the voltage references</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CTL_VREF_EXT_3V</name>
                  <description>The external VREFA+ and VREFA- inputs are the voltage references</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSMUX0</name>
          <displayName>ADC_SSMUX0</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 0</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSMUX0_MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX1</name>
              <description>2nd Sample Input Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX2</name>
              <description>3rd Sample Input Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX3</name>
              <description>4th Sample Input Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX4</name>
              <description>5th Sample Input Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX5</name>
              <description>6th Sample Input Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX6</name>
              <description>7th Sample Input Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX0_MUX7</name>
              <description>8th Sample Input Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSCTL0</name>
          <displayName>ADC_SSCTL0</displayName>
          <description>ADC Sample Sequence Control 0</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSCTL0_D0</name>
              <description>1st Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END0</name>
              <description>1st Sample is End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D1</name>
              <description>2nd Sample Differential Input Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D2</name>
              <description>3rd Sample Differential Input Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D3</name>
              <description>4th Sample Differential Input Select</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END3</name>
              <description>4th Sample is End of Sequence</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D4</name>
              <description>5th Sample Differential Input Select</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END4</name>
              <description>5th Sample is End of Sequence</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE4</name>
              <description>5th Sample Interrupt Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS4</name>
              <description>5th Sample Temp Sensor Select</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D5</name>
              <description>6th Sample Differential Input Select</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END5</name>
              <description>6th Sample is End of Sequence</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE5</name>
              <description>6th Sample Interrupt Enable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS5</name>
              <description>6th Sample Temp Sensor Select</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D6</name>
              <description>7th Sample Differential Input Select</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END6</name>
              <description>7th Sample is End of Sequence</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE6</name>
              <description>7th Sample Interrupt Enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS6</name>
              <description>7th Sample Temp Sensor Select</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_D7</name>
              <description>8th Sample Differential Input Select</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_END7</name>
              <description>8th Sample is End of Sequence</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_IE7</name>
              <description>8th Sample Interrupt Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL0_TS7</name>
              <description>8th Sample Temp Sensor Select</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFIFO0</name>
          <displayName>ADC_SSFIFO0</displayName>
          <description>ADC Sample Sequence Result FIFO 0</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFIFO0_DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFSTAT0</name>
          <displayName>ADC_SSFSTAT0</displayName>
          <description>ADC Sample Sequence FIFO 0 Status</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFSTAT0_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT0_HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT0_EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT0_FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSOP0</name>
          <displayName>ADC_SSOP0</displayName>
          <description>ADC Sample Sequence 0 Operation</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSOP0_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S4DCOP</name>
              <description>Sample 4 Digital Comparator Operation</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S5DCOP</name>
              <description>Sample 5 Digital Comparator Operation</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S6DCOP</name>
              <description>Sample 6 Digital Comparator Operation</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP0_S7DCOP</name>
              <description>Sample 7 Digital Comparator Operation</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSDC0</name>
          <displayName>ADC_SSDC0</displayName>
          <description>ADC Sample Sequence 0 Digital Comparator Select</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSDC0_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S4DCSEL</name>
              <description>Sample 4 Digital Comparator Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S5DCSEL</name>
              <description>Sample 5 Digital Comparator Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S6DCSEL</name>
              <description>Sample 6 Digital Comparator Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC0_S7DCSEL</name>
              <description>Sample 7 Digital Comparator Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
