m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_SSEMUX0</name>
          <displayName>ADC_SSEMUX0</displayName>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 0</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSEMUX0_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX4</name>
              <description>5th Sample Input Select (Upper Bit)</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX5</name>
              <description>6th Sample Input Select (Upper Bit)</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX6</name>
              <description>7th Sample Input Select (Upper Bit)</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX7</name>
              <description>8th Sample Input Select (Upper Bit)</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSTSH0</name>
          <displayName>ADC_SSTSH0</displayName>
          <description>ADC Sample Sequence 0 Sample and Hold Time</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSTSH0_TSH0</name>
              <description>1st Sample and Hold Period Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH1</name>
              <description>2nd Sample and Hold Period Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH2</name>
              <description>3rd Sample and Hold Period Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH3</name>
              <description>4th Sample and Hold Period Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH4</name>
              <description>5th Sample and Hold Period Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH5</name>
              <description>6th Sample and Hold Period Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH6</name>
              <description>7th Sample and Hold Period Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH0_TSH7</name>
              <description>8th Sample and Hold Period Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSMUX1</name>
          <displayName>ADC_SSMUX1</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 1</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSMUX1_MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX1</name>
              <description>2nd Sample Input Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX2</name>
              <description>3rd Sample Input Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX3</name>
              <description>4th Sample Input Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSCTL1</name>
          <displayName>ADC_SSCTL1</displayName>
          <description>ADC Sample Sequence Control 1</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSCTL1_D0</name>
              <description>1st Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_END0</name>
              <description>1st Sample is End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_D1</name>
              <description>2nd Sample Differential Input Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_D2</name>
              <description>3rd Sample Differential Input Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_D3</name>
              <description>4th Sample Differential Input Select</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_END3</name>
              <description>4th Sample is End of Sequence</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL1_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFIFO1</name>
          <displayName>ADC_SSFIFO1</displayName>
          <description>ADC Sample Sequence Result FIFO 1</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFIFO1_DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFSTAT1</name>
          <displayName>ADC_SSFSTAT1</displayName>
          <description>ADC Sample Sequence FIFO 1 Status</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFSTAT1_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT1_HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT1_EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT1_FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSOP1</name>
          <displayName>ADC_SSOP1</displayName>
          <description>ADC Sample Sequence 1 Operation</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSOP1_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP1_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP1_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP1_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSDC1</name>
          <displayName>ADC_SSDC1</displayName>
          <description>ADC Sample Sequence 1 Digital Comparator Select</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSDC1_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC1_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC1_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC1_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSEMUX1</name>
          <displayName>ADC_SSEMUX1</displayName>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 1</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSEMUX1_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX1_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX1_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX1_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSTSH1</name>
          <displayName>ADC_SSTSH1</displayName>
          <description>ADC Sample Sequence 1 Sample and Hold Time</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSTSH1_TSH0</name>
              <description>1st Sample and Hold Period Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH1_TSH1</name>
              <description>2nd Sample and Hold Period Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH1_TSH2</name>
              <description>3rd Sample and Hold Period Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH1_TSH3</name>
              <description>4th Sample and Hold Period Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSMUX2</name>
          <displayName>ADC_SSMUX2</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 2</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSMUX2_MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX1</name>
              <description>2nd Sample Input Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX2</name>
              <description>3rd Sample Input Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX3</name>
              <description>4th Sample Input Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSCTL2</name>
          <displayName>ADC_SSCTL2</displayName>
          <description>ADC Sample Sequence Control 2</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSCTL2_D0</name>
              <description>1st Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_END0</name>
              <description>1st Sample is End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_D1</name>
              <description>2nd Sample Differential Input Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_D2</name>
              <description>3rd Sample Differential Input Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_D3</name>
              <description>4th Sample Differential Input Select</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_END3</name>
              <description>4th Sample is End of Sequence</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL2_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFIFO2</name>
          <displayName>ADC_SSFIFO2</displayName>
          <description>ADC Sample Sequence Result FIFO 2</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFIFO2_DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
