m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_SSFSTAT2</name>
          <displayName>ADC_SSFSTAT2</displayName>
          <description>ADC Sample Sequence FIFO 2 Status</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFSTAT2_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT2_HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT2_EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT2_FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSOP2</name>
          <displayName>ADC_SSOP2</displayName>
          <description>ADC Sample Sequence 2 Operation</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSOP2_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP2_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP2_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSOP2_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSDC2</name>
          <displayName>ADC_SSDC2</displayName>
          <description>ADC Sample Sequence 2 Digital Comparator Select</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSDC2_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC2_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC2_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSDC2_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSEMUX2</name>
          <displayName>ADC_SSEMUX2</displayName>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 2</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSEMUX2_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX2_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX2_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSEMUX2_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSTSH2</name>
          <displayName>ADC_SSTSH2</displayName>
          <description>ADC Sample Sequence 2 Sample and Hold Time</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSTSH2_TSH0</name>
              <description>1st Sample and Hold Period Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH2_TSH1</name>
              <description>2nd Sample and Hold Period Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH2_TSH2</name>
              <description>3rd Sample and Hold Period Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSTSH2_TSH3</name>
              <description>4th Sample and Hold Period Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSMUX3</name>
          <displayName>ADC_SSMUX3</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 3</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSMUX3_MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSCTL3</name>
          <displayName>ADC_SSCTL3</displayName>
          <description>ADC Sample Sequence Control 3</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSCTL3_D0</name>
              <description>Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL3_END0</name>
              <description>End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL3_IE0</name>
              <description>Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SSCTL3_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFIFO3</name>
          <displayName>ADC_SSFIFO3</displayName>
          <description>ADC Sample Sequence Result FIFO 3</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFIFO3_DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSFSTAT3</name>
          <displayName>ADC_SSFSTAT3</displayName>
          <description>ADC Sample Sequence FIFO 3 Status</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSFSTAT3_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT3_HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT3_EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SSFSTAT3_FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSOP3</name>
          <displayName>ADC_SSOP3</displayName>
          <description>ADC Sample Sequence 3 Operation</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSOP3_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSDC3</name>
          <displayName>ADC_SSDC3</displayName>
          <description>ADC Sample Sequence 3 Digital Comparator Select</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSDC3_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSEMUX3</name>
          <displayName>ADC_SSEMUX3</displayName>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 3</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSEMUX3_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SSTSH3</name>
          <displayName>ADC_SSTSH3</displayName>
          <description>ADC Sample Sequence 3 Sample and Hold Time</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_SSTSH3_TSH0</name>
              <description>1st Sample and Hold Period Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCRIC</name>
          <displayName>ADC_DCRIC</displayName>
          <description>ADC Digital Comparator Reset Initial Conditions</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCRIC_DCINT0</name>
              <description>Digital Comparator Interrupt 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT1</name>
              <description>Digital Comparator Interrupt 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT2</name>
              <description>Digital Comparator Interrupt 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT3</name>
              <description>Digital Comparator Interrupt 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT4</name>
              <description>Digital Comparator Interrupt 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT5</name>
              <description>Digital Comparator Interrupt 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT6</name>
              <description>Digital Comparator Interrupt 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT7</name>
              <description>Digital Comparator Interrupt 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG0</name>
              <description>Digital Comparator Trigger 0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG1</name>
              <description>Digital Comparator Trigger 1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG2</name>
              <description>Digital Comparator Trigger 2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG3</name>
              <description>Digital Comparator Trigger 3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG4</name>
              <description>Digital Comparator Trigger 4</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG5</name>
              <description>Digital Comparator Trigger 5</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG6</name>
              <description>Digital Comparator Trigger 6</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG7</name>
              <description>Digital Comparator Trigger 7</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCTL0</name>
          <displayName>ADC_DCCTL0</displayName>
          <description>ADC Digital Comparator Control 0</description>
          <addressOffset>0x00000E00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL0_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL0_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
