m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_DCCTL1</name>
          <displayName>ADC_DCCTL1</displayName>
          <description>ADC Digital Comparator Control 1</description>
          <addressOffset>0x00000E04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL1_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL1_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCTL2</name>
          <displayName>ADC_DCCTL2</displayName>
          <description>ADC Digital Comparator Control 2</description>
          <addressOffset>0x00000E08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL2_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL2_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCTL3</name>
          <displayName>ADC_DCCTL3</displayName>
          <description>ADC Digital Comparator Control 3</description>
          <addressOffset>0x00000E0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL3_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL3_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCTL4</name>
          <displayName>ADC_DCCTL4</displayName>
          <description>ADC Digital Comparator Control 4</description>
          <addressOffset>0x00000E10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL4_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL4_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
