m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_DCCTL5</name>
          <displayName>ADC_DCCTL5</displayName>
          <description>ADC Digital Comparator Control 5</description>
          <addressOffset>0x00000E14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL5_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL5_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL5_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL5_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL5_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL5_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCTL6</name>
          <displayName>ADC_DCCTL6</displayName>
          <description>ADC Digital Comparator Control 6</description>
          <addressOffset>0x00000E18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL6_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL6_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL6_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL6_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL6_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL6_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCTL7</name>
          <displayName>ADC_DCCTL7</displayName>
          <description>ADC Digital Comparator Control 7</description>
          <addressOffset>0x00000E1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCTL7_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCTL7_CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP0</name>
          <displayName>ADC_DCCMP0</displayName>
          <description>ADC Digital Comparator Range 0</description>
          <addressOffset>0x00000E40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP0_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP0_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP1</name>
          <displayName>ADC_DCCMP1</displayName>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP1_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP1_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP2</name>
          <displayName>ADC_DCCMP2</displayName>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP2_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP2_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP3</name>
          <displayName>ADC_DCCMP3</displayName>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP3_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP3_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP4</name>
          <displayName>ADC_DCCMP4</displayName>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP4_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP4_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP5</name>
          <displayName>ADC_DCCMP5</displayName>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP5_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP5_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP6</name>
          <displayName>ADC_DCCMP6</displayName>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP6_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP6_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DCCMP7</name>
          <displayName>ADC_DCCMP7</displayName>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_DCCMP7_COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCCMP7_COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
