m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>ADC_PP</name>
          <displayName>ADC_PP</displayName>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_PP_MCR</name>
              <description>Maximum Conversion Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_MCR_FULL</name>
                  <description>Full conversion rate (FCONV) as defined by TADC and NSH</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_CH</name>
              <description>ADC Channel Count</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_PP_DC</name>
              <description>Digital Comparator Count</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_PP_TYPE</name>
              <description>ADC Architecture</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_TYPE_SAR</name>
                  <description>SAR</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_RSL</name>
              <description>Resolution</description>
              <lsb>18</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_PP_TS</name>
              <description>Temperature Sensor</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_PP_APSHT</name>
              <description>Application-Programmable Sample-and-Hold Time</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_PC</name>
          <displayName>ADC_PC</displayName>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_PC_MCR</name>
              <description>Conversion Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PC_MCR_1_8</name>
                  <description>Eighth conversion rate. After a conversion completes, the logic pauses for 112 TADC periods before starting the next conversion</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_MCR_1_4</name>
                  <description>Quarter conversion rate. After a conversion completes, the logic pauses for 48 TADC periods before starting the next conversion</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_MCR_1_2</name>
                  <description>Half conversion rate. After a conversion completes, the logic pauses for 16 TADC periods before starting the next conversion</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_MCR_FULL</name>
                  <description>Full conversion rate (FCONV) as defined by TADC and NSH</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CC</name>
          <displayName>ADC_CC</displayName>
          <description>ADC Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_CC_CS</name>
              <description>ADC Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CC_CS_SYSPLL</name>
                  <description>PLL VCO divided by CLKDIV</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CC_CS_MOSC</name>
                  <description>MOSC</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_CC_CLKDIV</name>
              <description>PLL VCO Clock Divisor</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1290kcpdt/adc.xml -->
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40039000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/comp.xml -->
    <peripheral>
      <name>COMP</name>
      <description>Comparator register offsets</description>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>COMP_ACMIS</name>
          <displayName>COMP_ACMIS</displayName>
          <description>Analog Comparator Masked Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACMIS_IN0</name>
              <description>Comparator 0 Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACMIS_IN1</name>
              <description>Comparator 1 Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACMIS_IN2</name>
              <description>Comparator 2 Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACRIS</name>
          <displayName>COMP_ACRIS</displayName>
          <description>Analog Comparator Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACRIS_IN0</name>
              <description>Comparator 0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_ACRIS_IN1</name>
              <description>Comparator 1 Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_ACRIS_IN2</name>
              <description>Comparator 2 Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACINTEN</name>
          <displayName>COMP_ACINTEN</displayName>
          <description>Analog Comparator Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACINTEN_IN0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACINTEN_IN1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACINTEN_IN2</name>
              <description>Comparator 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACREFCTL</name>
          <displayName>COMP_ACREFCTL</displayName>
          <description>Analog Comparator Reference Voltage Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACREFCTL_VREF</name>
              <description>Resistor Ladder Voltage Ref</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACREFCTL_RNG</name>
              <description>Resistor Ladder Range</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACREFCTL_EN</name>
              <description>Resistor Ladder Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACSTAT0</name>
          <displayName>COMP_ACSTAT0</displayName>
          <description>Analog Comparator Status 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACSTAT0_OVAL</name>
              <description>Comparator Output Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACCTL0</name>
          <displayName>COMP_ACCTL0</displayName>
          <description>Analog Comparator Control 0</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACCTL0_CINV</name>
              <description>Comparator Output Invert</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL0_ISEN</name>
              <description>Interrupt Sense</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL0_TSEN</name>
              <description>Trigger Sense</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL0_ASRCP</name>
              <description>Analog Source Positive</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_REF</name>
                  <description>Internal voltage reference</description>
                  <value>0x00000400</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_TOEN</name>
              <description>Trigger Output Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACSTAT1</name>
          <displayName>COMP_ACSTAT1</displayName>
          <description>Analog Comparator Status 1</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACSTAT1_OVAL</name>
              <description>Comparator Output Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACCTL1</name>
          <displayName>COMP_ACCTL1</displayName>
          <description>Analog Comparator Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACCTL1_CINV</name>
              <description>Comparator Output Invert</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL1_ISEN</name>
              <description>Interrupt Sense</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL1_TSEN</name>
              <description>Trigger Sense</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL1_ASRCP</name>
              <description>Analog Source Positive</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_REF</name>
                  <description>Internal voltage reference</description>
                  <value>0x00000400</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_TOEN</name>
              <description>Trigger Output Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ACSTAT2</name>
          <displayName>COMP_ACSTAT2</displayName>
          <description>Analog Comparator Status 2</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACSTAT2_OVAL</name>
              <description>Comparator Output Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
