m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>COMP_ACCTL2</name>
          <displayName>COMP_ACCTL2</displayName>
          <description>Analog Comparator Control 2</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_ACCTL2_CINV</name>
              <description>Comparator Output Invert</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL2_ISEN</name>
              <description>Interrupt Sense</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL2_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL2_TSEN</name>
              <description>Trigger Sense</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL2_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ACCTL2_ASRCP</name>
              <description>Analog Source Positive</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ASRCP_REF</name>
                  <description>Internal voltage reference</description>
                  <value>0x00000400</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL2_TOEN</name>
              <description>Trigger Output Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_PP</name>
          <displayName>COMP_PP</displayName>
          <description>Analog Comparator Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP_PP_CMP0</name>
              <description>Comparator 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_PP_CMP1</name>
              <description>Comparator 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_PP_CMP2</name>
              <description>Comparator 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_PP_C0O</name>
              <description>Comparator Output 0 Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_PP_C1O</name>
              <description>Comparator Output 1 Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_PP_C2O</name>
              <description>Comparator Output 2 Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
