m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/can.xml -->
    <peripheral>
      <name>CAN0</name>
      <description>CAN register offsets</description>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CAN_CTL</name>
          <displayName>CAN_CTL</displayName>
          <description>CAN Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_CTL_INIT</name>
              <description>Initialization</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_CTL_IE</name>
              <description>CAN Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_CTL_SIE</name>
              <description>Status Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_CTL_EIE</name>
              <description>Error Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_CTL_DAR</name>
              <description>Disable Automatic-Retransmission</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_CTL_CCE</name>
              <description>Configuration Change Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_CTL_TEST</name>
              <description>Test Mode Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_STS</name>
          <displayName>CAN_STS</displayName>
          <description>CAN Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_STS_LEC</name>
              <description>Last Error Code</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_STS_LEC_NONE</name>
                  <description>No Error</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_STUFF</name>
                  <description>Stuff Error</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_FORM</name>
                  <description>Format Error</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_ACK</name>
                  <description>ACK Error</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_BIT1</name>
                  <description>Bit 1 Error</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_BIT0</name>
                  <description>Bit 0 Error</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_CRC</name>
                  <description>CRC Error</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_NOEVENT</name>
                  <description>No Event</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_STS_TXOK</name>
              <description>Transmitted a Message Successfully</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_STS_RXOK</name>
              <description>Received a Message Successfully</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_STS_EPASS</name>
              <description>Error Passive</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_STS_EWARN</name>
              <description>Warning Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_STS_BOFF</name>
              <description>Bus-Off Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_ERR</name>
          <displayName>CAN_ERR</displayName>
          <description>CAN Error Counter</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_ERR_TEC</name>
              <description>Transmit Error Counter</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN_ERR_REC</name>
              <description>Receive Error Counter</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN_ERR_RP</name>
              <description>Received Error Passive</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_BIT</name>
          <displayName>CAN_BIT</displayName>
          <description>CAN Bit Timing</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_BIT_BRP</name>
              <description>Baud Rate Prescaler</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_BIT_SJW</name>
              <description>(Re)Synchronization Jump Width</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_BIT_TSEG1</name>
              <description>Time Segment Before Sample Point</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_BIT_TSEG2</name>
              <description>Time Segment after Sample Point</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_INT</name>
          <displayName>CAN_INT</displayName>
          <description>CAN Interrupt</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_INT_INTID</name>
              <description>Interrupt Identifier</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_INT_INTID_NONE</name>
                  <description>No interrupt pending</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_INT_INTID_STATUS</name>
                  <description>Status Interrupt</description>
                  <value>0x00008000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TST</name>
          <displayName>CAN_TST</displayName>
          <description>CAN Test</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_TST_BASIC</name>
              <description>Basic Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_TST_SILENT</name>
              <description>Silent Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_TST_LBACK</name>
              <description>Loopback Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_TST_TX</name>
              <description>Transmit Control</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_TST_TX_CANCTL</name>
                  <description>CAN Module Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TST_TX_SAMPLE</name>
                  <description>Sample Point</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TST_TX_DOMINANT</name>
                  <description>Driven Low</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TST_TX_RECESSIVE</name>
                  <description>Driven High</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_TST_RX</name>
              <description>Receive Observation</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_BRPE</name>
          <displayName>CAN_BRPE</displayName>
          <description>CAN Baud Rate Prescaler Extension</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_BRPE_BRPE</name>
              <description>Baud Rate Prescaler Extension</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1CRQ</name>
          <displayName>CAN_IF1CRQ</displayName>
          <description>CAN IF1 Command Request</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1CRQ_MNUM</name>
              <description>Message Number</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CRQ_BUSY</name>
              <description>Busy Flag</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1CMSK</name>
          <displayName>CAN_IF1CMSK</displayName>
          <description>CAN IF1 Command Mask</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1CMSK_DATAB</name>
              <description>Access Data Byte 4 to 7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_DATAA</name>
              <description>Access Data Byte 0 to 3</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_NEWDAT</name>
              <description>Access New Data</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_TXRQST</name>
              <description>Access Transmission Request</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_CLRINTPND</name>
              <description>Clear Interrupt Pending Bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_CONTROL</name>
              <description>Access Control Bits</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_ARB</name>
              <description>Access Arbitration Bits</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_MASK</name>
              <description>Access Mask Bits</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1CMSK_WRNRD</name>
              <description>Write, Not Read</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1MSK1</name>
          <displayName>CAN_IF1MSK1</displayName>
          <description>CAN IF1 Mask 1</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1MSK1_IDMSK</name>
              <description>Identifier Mask</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1MSK2</name>
          <displayName>CAN_IF1MSK2</displayName>
          <description>CAN IF1 Mask 2</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1MSK2_IDMSK</name>
              <description>Identifier Mask</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MSK2_MDIR</name>
              <description>Mask Message Direction</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MSK2_MXTD</name>
              <description>Mask Extended Identifier</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1ARB1</name>
          <displayName>CAN_IF1ARB1</displayName>
          <description>CAN IF1 Arbitration 1</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1ARB1_ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1ARB2</name>
          <displayName>CAN_IF1ARB2</displayName>
          <description>CAN IF1 Arbitration 2</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1ARB2_ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1ARB2_DIR</name>
              <description>Message Direction</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1ARB2_XTD</name>
              <description>Extended Identifier</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1ARB2_MSGVAL</name>
              <description>Message Valid</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1MCTL</name>
          <displayName>CAN_IF1MCTL</displayName>
          <description>CAN IF1 Message Control</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1MCTL_DLC</name>
              <description>Data Length Code</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_EOB</name>
              <description>End of Buffer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_TXRQST</name>
              <description>Transmit Request</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_RMTEN</name>
              <description>Remote Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_RXIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_UMASK</name>
              <description>Use Acceptance Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_INTPND</name>
              <description>Interrupt Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_MSGLST</name>
              <description>Message Lost</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF1MCTL_NEWDAT</name>
              <description>New Data</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1DA1</name>
          <displayName>CAN_IF1DA1</displayName>
          <description>CAN IF1 Data A1</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1DA1_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1DA2</name>
          <displayName>CAN_IF1DA2</displayName>
          <description>CAN IF1 Data A2</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1DA2_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1DB1</name>
          <displayName>CAN_IF1DB1</displayName>
          <description>CAN IF1 Data B1</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1DB1_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF1DB2</name>
          <displayName>CAN_IF1DB2</displayName>
          <description>CAN IF1 Data B2</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF1DB2_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
