m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>CAN_IF2CRQ</name>
          <displayName>CAN_IF2CRQ</displayName>
          <description>CAN IF2 Command Request</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2CRQ_MNUM</name>
              <description>Message Number</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CRQ_BUSY</name>
              <description>Busy Flag</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2CMSK</name>
          <displayName>CAN_IF2CMSK</displayName>
          <description>CAN IF2 Command Mask</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2CMSK_DATAB</name>
              <description>Access Data Byte 4 to 7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_DATAA</name>
              <description>Access Data Byte 0 to 3</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_NEWDAT</name>
              <description>Access New Data</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_TXRQST</name>
              <description>Access Transmission Request</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_CLRINTPND</name>
              <description>Clear Interrupt Pending Bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_CONTROL</name>
              <description>Access Control Bits</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_ARB</name>
              <description>Access Arbitration Bits</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_MASK</name>
              <description>Access Mask Bits</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2CMSK_WRNRD</name>
              <description>Write, Not Read</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2MSK1</name>
          <displayName>CAN_IF2MSK1</displayName>
          <description>CAN IF2 Mask 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2MSK1_IDMSK</name>
              <description>Identifier Mask</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2MSK2</name>
          <displayName>CAN_IF2MSK2</displayName>
          <description>CAN IF2 Mask 2</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2MSK2_IDMSK</name>
              <description>Identifier Mask</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MSK2_MDIR</name>
              <description>Mask Message Direction</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MSK2_MXTD</name>
              <description>Mask Extended Identifier</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2ARB1</name>
          <displayName>CAN_IF2ARB1</displayName>
          <description>CAN IF2 Arbitration 1</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2ARB1_ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2ARB2</name>
          <displayName>CAN_IF2ARB2</displayName>
          <description>CAN IF2 Arbitration 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2ARB2_ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2ARB2_DIR</name>
              <description>Message Direction</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2ARB2_XTD</name>
              <description>Extended Identifier</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2ARB2_MSGVAL</name>
              <description>Message Valid</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2MCTL</name>
          <displayName>CAN_IF2MCTL</displayName>
          <description>CAN IF2 Message Control</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2MCTL_DLC</name>
              <description>Data Length Code</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_EOB</name>
              <description>End of Buffer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_TXRQST</name>
              <description>Transmit Request</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_RMTEN</name>
              <description>Remote Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_RXIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_UMASK</name>
              <description>Use Acceptance Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_INTPND</name>
              <description>Interrupt Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_MSGLST</name>
              <description>Message Lost</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN_IF2MCTL_NEWDAT</name>
              <description>New Data</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2DA1</name>
          <displayName>CAN_IF2DA1</displayName>
          <description>CAN IF2 Data A1</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2DA1_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2DA2</name>
          <displayName>CAN_IF2DA2</displayName>
          <description>CAN IF2 Data A2</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2DA2_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2DB1</name>
          <displayName>CAN_IF2DB1</displayName>
          <description>CAN IF2 Data B1</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2DB1_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_IF2DB2</name>
          <displayName>CAN_IF2DB2</displayName>
          <description>CAN IF2 Data B2</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_IF2DB2_DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TXRQ1</name>
          <displayName>CAN_TXRQ1</displayName>
          <description>CAN Transmission Request 1</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_TXRQ1_TXRQST</name>
              <description>Transmission Request Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_TXRQ2</name>
          <displayName>CAN_TXRQ2</displayName>
          <description>CAN Transmission Request 2</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_TXRQ2_TXRQST</name>
              <description>Transmission Request Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_NWDA1</name>
          <displayName>CAN_NWDA1</displayName>
          <description>CAN New Data 1</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_NWDA1_NEWDAT</name>
              <description>New Data Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_NWDA2</name>
          <displayName>CAN_NWDA2</displayName>
          <description>CAN New Data 2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_NWDA2_NEWDAT</name>
              <description>New Data Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MSG1INT</name>
          <displayName>CAN_MSG1INT</displayName>
          <description>CAN Message 1 Interrupt Pending</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_MSG1INT_INTPND</name>
              <description>Interrupt Pending Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MSG2INT</name>
          <displayName>CAN_MSG2INT</displayName>
          <description>CAN Message 2 Interrupt Pending</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_MSG2INT_INTPND</name>
              <description>Interrupt Pending Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MSG1VAL</name>
          <displayName>CAN_MSG1VAL</displayName>
          <description>CAN Message 1 Valid</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_MSG1VAL_MSGVAL</name>
              <description>Message Valid Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_MSG2VAL</name>
          <displayName>CAN_MSG2VAL</displayName>
          <description>CAN Message 2 Valid</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN_MSG2VAL_MSGVAL</name>
              <description>Message Valid Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
