m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/can.xml -->
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1290kcpdt/usb.xml -->
    <peripheral>
      <name>USB0</name>
      <description>Univeral Serial Bus register offsets</description>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>USB_FADDR</name>
          <displayName>USB_FADDR</displayName>
          <description>USB Device Functional Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FADDR</name>
              <description>Function Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_POWER</name>
          <displayName>USB_POWER</displayName>
          <description>USB Power</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_POWER_PWRDNPHY</name>
              <description>Power Down PHY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_SUSPEND</name>
              <description>SUSPEND Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_RESUME</name>
              <description>RESUME Signaling</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_RESET</name>
              <description>RESET Signaling</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_HSMODE</name>
              <description>High Speed Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_HSENAB</name>
              <description>High Speed Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_SOFTCONN</name>
              <description>Soft Connect/Disconnect</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_POWER_ISOUP</name>
              <description>Isochronous Update</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXIS</name>
          <displayName>USB_TXIS</displayName>
          <description>USB Transmit Interrupt Status</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXIS_EP0</name>
              <description>TX and RX Endpoint 0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP1</name>
              <description>TX Endpoint 1 Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP2</name>
              <description>TX Endpoint 2 Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP3</name>
              <description>TX Endpoint 3 Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP4</name>
              <description>TX Endpoint 4 Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP5</name>
              <description>TX Endpoint 5 Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP6</name>
              <description>TX Endpoint 6 Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_TXIS_EP7</name>
              <description>TX Endpoint 7 Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXIS</name>
          <displayName>USB_RXIS</displayName>
          <description>USB Receive Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXIS_EP1</name>
              <description>RX Endpoint 1 Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RXIS_EP2</name>
              <description>RX Endpoint 2 Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RXIS_EP3</name>
              <description>RX Endpoint 3 Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RXIS_EP4</name>
              <description>RX Endpoint 4 Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RXIS_EP5</name>
              <description>RX Endpoint 5 Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RXIS_EP6</name>
              <description>RX Endpoint 6 Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RXIS_EP7</name>
              <description>RX Endpoint 7 Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXIE</name>
          <displayName>USB_TXIE</displayName>
          <description>USB Transmit Interrupt Enable</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXIE_EP0</name>
              <description>TX and RX Endpoint 0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP1</name>
              <description>TX Endpoint 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP2</name>
              <description>TX Endpoint 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP3</name>
              <description>TX Endpoint 3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP4</name>
              <description>TX Endpoint 4 Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP5</name>
              <description>TX Endpoint 5 Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP6</name>
              <description>TX Endpoint 6 Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXIE_EP7</name>
              <description>TX Endpoint 7 Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXIE</name>
          <displayName>USB_RXIE</displayName>
          <description>USB Receive Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXIE_EP1</name>
              <description>RX Endpoint 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXIE_EP2</name>
              <description>RX Endpoint 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXIE_EP3</name>
              <description>RX Endpoint 3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXIE_EP4</name>
              <description>RX Endpoint 4 Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXIE_EP5</name>
              <description>RX Endpoint 5 Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXIE_EP6</name>
              <description>RX Endpoint 6 Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXIE_EP7</name>
              <description>RX Endpoint 7 Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_IS</name>
          <displayName>USB_IS</displayName>
          <description>USB General Interrupt Status</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IS_SUSPEND</name>
              <description>SUSPEND Signaling Detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_RESUME</name>
              <description>RESUME Signaling Detected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_BABBLE</name>
              <description>Babble Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_RESET</name>
              <description>RESET Signaling Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_SOF</name>
              <description>Start of Frame</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_CONN</name>
              <description>Session Connect</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_DISCON</name>
              <description>Session Disconnect (OTG only)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_SESREQ</name>
              <description>SESSION REQUEST (OTG only)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_IS_VBUSERR</name>
              <description>VBUS Error (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_IE</name>
          <displayName>USB_IE</displayName>
          <description>USB Interrupt Enable</description>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IE_SUSPND</name>
              <description>Enable SUSPEND Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_RESUME</name>
              <description>Enable RESUME Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_BABBLE</name>
              <description>Enable Babble Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_RESET</name>
              <description>Enable RESET Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_SOF</name>
              <description>Enable Start-of-Frame Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_CONN</name>
              <description>Enable Connect Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_DISCON</name>
              <description>Enable Disconnect Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_SESREQ</name>
              <description>Enable Session Request (OTG only)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IE_VBUSERR</name>
              <description>Enable VBUS Error Interrupt (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_FRAME</name>
          <displayName>USB_FRAME</displayName>
          <description>USB Frame Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_FRAME</name>
              <description>Frame Number</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EPIDX</name>
          <displayName>USB_EPIDX</displayName>
          <description>USB Endpoint Index</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_EPIDX_EPIDX</name>
              <description>Endpoint Index</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TEST</name>
          <displayName>USB_TEST</displayName>
          <description>USB Test Mode</description>
          <addressOffset>0x0000000F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TEST_TESTSE0NAK</name>
              <description>Test_SE0_NAK Test Mode Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_TESTJ</name>
              <description>Test_J Mode Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_TESTK</name>
              <description>Test_K Mode Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_TESTPKT</name>
              <description>Test Packet Mode Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_FORCEHS</name>
              <description>Force High-Speed Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_FORCEFS</name>
              <description>Force Full-Speed Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_FIFOACC</name>
              <description>FIFO Access</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TEST_FORCEH</name>
              <description>Force Host Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_FIFO0</name>
          <displayName>USB_FIFO0</displayName>
          <description>USB FIFO Endpoint 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO1</name>
          <displayName>USB_FIFO1</displayName>
          <description>USB FIFO Endpoint 1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO2</name>
          <displayName>USB_FIFO2</displayName>
          <description>USB FIFO Endpoint 2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO3</name>
          <displayName>USB_FIFO3</displayName>
          <description>USB FIFO Endpoint 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO4</name>
          <displayName>USB_FIFO4</displayName>
          <description>USB FIFO Endpoint 4</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO5</name>
          <displayName>USB_FIFO5</displayName>
          <description>USB FIFO Endpoint 5</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO6</name>
          <displayName>USB_FIFO6</displayName>
          <description>USB FIFO Endpoint 6</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FIFO7</name>
          <displayName>USB_FIFO7</displayName>
          <description>USB FIFO Endpoint 7</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
