m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_DEVCTL</name>
          <displayName>USB_DEVCTL</displayName>
          <description>USB Device Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_DEVCTL_SESSION</name>
              <description>Session Start/End (OTG only)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_HOSTREQ</name>
              <description>Host Request (OTG only)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_HOST</name>
              <description>Host Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_VBUS</name>
              <description>VBUS Level (OTG only)</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_NONE</name>
                  <description>Below SessionEnd</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_SEND</name>
                  <description>Above SessionEnd, below AValid</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_AVALID</name>
                  <description>Above AValid, below VBUSValid</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_VALID</name>
                  <description>Above VBUSValid</description>
                  <value>0x00000018</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_DEVCTL_LSDEV</name>
              <description>Low-Speed Device Detected</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_FSDEV</name>
              <description>Full-Speed Device Detected</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_DEV</name>
              <description>Device Mode (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CCONF</name>
          <displayName>USB_CCONF</displayName>
          <description>USB Common Configuration</description>
          <addressOffset>0x00000061</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CCONF_RXEDMA</name>
              <description>TX Early DMA Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CCONF_TXEDMA</name>
              <description>TX Early DMA Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFIFOSZ</name>
          <displayName>USB_TXFIFOSZ</displayName>
          <description>USB Transmit Dynamic FIFO Sizing</description>
          <addressOffset>0x00000062</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x00000008</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFIFOSZ</name>
          <displayName>USB_RXFIFOSZ</displayName>
          <description>USB Receive Dynamic FIFO Sizing</description>
          <addressOffset>0x00000063</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x00000008</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFIFOADD</name>
          <displayName>USB_TXFIFOADD</displayName>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x00000064</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFIFOADD</name>
          <displayName>USB_RXFIFOADD</displayName>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x00000066</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_ULPIVBUSCTL</name>
          <displayName>USB_ULPIVBUSCTL</displayName>
          <description>USB ULPI VBUS Control</description>
          <addressOffset>0x00000070</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_ULPIVBUSCTL_USEEXTVBUS</name>
              <description>Use External VBUS</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_ULPIVBUSCTL_USEEXTVBUSIND</name>
              <description>Use External VBUS Indicator</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_ULPIREGDATA</name>
          <displayName>USB_ULPIREGDATA</displayName>
          <description>USB ULPI Register Data</description>
          <addressOffset>0x00000074</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_ULPIREGADDR</name>
          <displayName>USB_ULPIREGADDR</displayName>
          <description>USB ULPI Register Address</description>
          <addressOffset>0x00000075</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_ULPIREGCTL</name>
          <displayName>USB_ULPIREGCTL</displayName>
          <description>USB ULPI Register Control</description>
          <addressOffset>0x00000076</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_ULPIREGCTL_REGACC</name>
              <description>Initiate Register Access</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_ULPIREGCTL_REGCMPLT</name>
              <description>Register Access Complete</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_ULPIREGCTL_RDWR</name>
              <description>Read/Write Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EPINFO</name>
          <displayName>USB_EPINFO</displayName>
          <description>USB Endpoint Information</description>
          <addressOffset>0x00000078</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_EPINFO_TXEP</name>
              <description>TX Endpoints</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_EPINFO_RXEP</name>
              <description>RX Endpoints</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RAMINFO</name>
          <displayName>USB_RAMINFO</displayName>
          <description>USB RAM Information</description>
          <addressOffset>0x00000079</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RAMINFO_RAMBITS</name>
              <description>RAM Address Bus Width</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_RAMINFO_DMACHAN</name>
              <description>DMA Channels</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CONTIM</name>
          <displayName>USB_CONTIM</displayName>
          <description>USB Connect Timing</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CONTIM_WTID</name>
              <description>Wait ID</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CONTIM_WTCON</name>
              <description>Connect Wait</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_VPLEN</name>
          <displayName>USB_VPLEN</displayName>
          <description>USB OTG VBUS Pulse Timing</description>
          <addressOffset>0x0000007B</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_HSEOF</name>
          <displayName>USB_HSEOF</displayName>
          <description>USB High-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_FSEOF</name>
          <displayName>USB_FSEOF</displayName>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007D</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_LSEOF</name>
          <displayName>USB_LSEOF</displayName>
          <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007E</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_TXFUNCADDR0</name>
          <displayName>USB_TXFUNCADDR0</displayName>
          <description>USB Transmit Functional Address Endpoint 0</description>
          <addressOffset>0x00000080</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR0_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR0</name>
          <displayName>USB_TXHUBADDR0</displayName>
          <description>USB Transmit Hub Address Endpoint 0</description>
          <addressOffset>0x00000082</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR0_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT0</name>
          <displayName>USB_TXHUBPORT0</displayName>
          <description>USB Transmit Hub Port Endpoint 0</description>
          <addressOffset>0x00000083</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT0_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR1</name>
          <displayName>USB_TXFUNCADDR1</displayName>
          <description>USB Transmit Functional Address Endpoint 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR1</name>
          <displayName>USB_TXHUBADDR1</displayName>
          <description>USB Transmit Hub Address Endpoint 1</description>
          <addressOffset>0x0000008A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT1</name>
          <displayName>USB_TXHUBPORT1</displayName>
          <description>USB Transmit Hub Port Endpoint 1</description>
          <addressOffset>0x0000008B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR1</name>
          <displayName>USB_RXFUNCADDR1</displayName>
          <description>USB Receive Functional Address Endpoint 1</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR1</name>
          <displayName>USB_RXHUBADDR1</displayName>
          <description>USB Receive Hub Address Endpoint 1</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT1</name>
          <displayName>USB_RXHUBPORT1</displayName>
          <description>USB Receive Hub Port Endpoint 1</description>
          <addressOffset>0x0000008F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR2</name>
          <displayName>USB_TXFUNCADDR2</displayName>
          <description>USB Transmit Functional Address Endpoint 2</description>
          <addressOffset>0x00000090</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR2</name>
          <displayName>USB_TXHUBADDR2</displayName>
          <description>USB Transmit Hub Address Endpoint 2</description>
          <addressOffset>0x00000092</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT2</name>
          <displayName>USB_TXHUBPORT2</displayName>
          <description>USB Transmit Hub Port Endpoint 2</description>
          <addressOffset>0x00000093</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR2</name>
          <displayName>USB_RXFUNCADDR2</displayName>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
