m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_RXHUBADDR2</name>
          <displayName>USB_RXHUBADDR2</displayName>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x00000096</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT2</name>
          <displayName>USB_RXHUBPORT2</displayName>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x00000097</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR3</name>
          <displayName>USB_TXFUNCADDR3</displayName>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000098</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR3</name>
          <displayName>USB_TXHUBADDR3</displayName>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT3</name>
          <displayName>USB_TXHUBPORT3</displayName>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x0000009B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR3</name>
          <displayName>USB_RXFUNCADDR3</displayName>
          <description>USB Receive Functional Address Endpoint 3</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR3</name>
          <displayName>USB_RXHUBADDR3</displayName>
          <description>USB Receive Hub Address Endpoint 3</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT3</name>
          <displayName>USB_RXHUBPORT3</displayName>
          <description>USB Receive Hub Port Endpoint 3</description>
          <addressOffset>0x0000009F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR4</name>
          <displayName>USB_TXFUNCADDR4</displayName>
          <description>USB Transmit Functional Address Endpoint 4</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR4_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR4</name>
          <displayName>USB_TXHUBADDR4</displayName>
          <description>USB Transmit Hub Address Endpoint 4</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR4_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT4</name>
          <displayName>USB_TXHUBPORT4</displayName>
          <description>USB Transmit Hub Port Endpoint 4</description>
          <addressOffset>0x000000A3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR4</name>
          <displayName>USB_RXFUNCADDR4</displayName>
          <description>USB Receive Functional Address Endpoint 4</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR4_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR4</name>
          <displayName>USB_RXHUBADDR4</displayName>
          <description>USB Receive Hub Address Endpoint 4</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR4_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT4</name>
          <displayName>USB_RXHUBPORT4</displayName>
          <description>USB Receive Hub Port Endpoint 4</description>
          <addressOffset>0x000000A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR5</name>
          <displayName>USB_TXFUNCADDR5</displayName>
          <description>USB Transmit Functional Address Endpoint 5</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR5</name>
          <displayName>USB_TXHUBADDR5</displayName>
          <description>USB Transmit Hub Address Endpoint 5</description>
          <addressOffset>0x000000AA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT5</name>
          <displayName>USB_TXHUBPORT5</displayName>
          <description>USB Transmit Hub Port Endpoint 5</description>
          <addressOffset>0x000000AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR5</name>
          <displayName>USB_RXFUNCADDR5</displayName>
          <description>USB Receive Functional Address Endpoint 5</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR5</name>
          <displayName>USB_RXHUBADDR5</displayName>
          <description>USB Receive Hub Address Endpoint 5</description>
          <addressOffset>0x000000AE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT5</name>
          <displayName>USB_RXHUBPORT5</displayName>
          <description>USB Receive Hub Port Endpoint 5</description>
          <addressOffset>0x000000AF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR6</name>
          <displayName>USB_TXFUNCADDR6</displayName>
          <description>USB Transmit Functional Address Endpoint 6</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR6</name>
          <displayName>USB_TXHUBADDR6</displayName>
          <description>USB Transmit Hub Address Endpoint 6</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT6</name>
          <displayName>USB_TXHUBPORT6</displayName>
          <description>USB Transmit Hub Port Endpoint 6</description>
          <addressOffset>0x000000B3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT6_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR6</name>
          <displayName>USB_RXFUNCADDR6</displayName>
          <description>USB Receive Functional Address Endpoint 6</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR6</name>
          <displayName>USB_RXHUBADDR6</displayName>
          <description>USB Receive Hub Address Endpoint 6</description>
          <addressOffset>0x000000B6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT6</name>
          <displayName>USB_RXHUBPORT6</displayName>
          <description>USB Receive Hub Port Endpoint 6</description>
          <addressOffset>0x000000B7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT6_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR7</name>
          <displayName>USB_TXFUNCADDR7</displayName>
          <description>USB Transmit Functional Address Endpoint 7</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR7_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR7</name>
          <displayName>USB_TXHUBADDR7</displayName>
          <description>USB Transmit Hub Address Endpoint 7</description>
          <addressOffset>0x000000BA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR7_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT7</name>
          <displayName>USB_TXHUBPORT7</displayName>
          <description>USB Transmit Hub Port Endpoint 7</description>
          <addressOffset>0x000000BB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT7_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR7</name>
          <displayName>USB_RXFUNCADDR7</displayName>
          <description>USB Receive Functional Address Endpoint 7</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR7_ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR7</name>
          <displayName>USB_RXHUBADDR7</displayName>
          <description>USB Receive Hub Address Endpoint 7</description>
          <addressOffset>0x000000BE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR7_ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT7</name>
          <displayName>USB_RXHUBPORT7</displayName>
          <description>USB Receive Hub Port Endpoint 7</description>
          <addressOffset>0x000000BF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT7_PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CSRL0</name>
          <displayName>USB_CSRL0</displayName>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CSRL0_RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_DATAEND</name>
              <description>Data End</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETUP</name>
              <description>Setup Packet</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETEND</name>
              <description>Setup End</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_ERROR</name>
              <description>Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALL</name>
              <description>Send Stall</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STATUS</name>
              <description>STATUS Packet</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_RXRDYC</name>
              <description>RXRDY Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETENDC</name>
              <description>Setup End Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CSRH0</name>
          <displayName>USB_CSRH0</displayName>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CSRH0_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DISPING</name>
              <description>PING Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_COUNT0</name>
          <displayName>USB_COUNT0</displayName>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_COUNT0_COUNT</name>
              <description>FIFO Count</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
