m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_TXCSRH2</name>
          <displayName>USB_TXCSRH2</displayName>
          <description>USB Transmit Control and Status Endpoint 2 High</description>
          <addressOffset>0x00000123</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH2_DT</name>
              <description>Data Toggle</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_FDT</name>
              <description>Force Data Toggle</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_MODE</name>
              <description>Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH2_AUTOSET</name>
              <description>Auto Set</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP2</name>
          <displayName>USB_RXMAXP2</displayName>
          <description>USB Maximum Receive Data Endpoint 2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP2_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL2</name>
          <displayName>USB_RXCSRL2</displayName>
          <description>USB Receive Control and Status Endpoint 2 Low</description>
          <addressOffset>0x00000126</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL2_RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL2_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH2</name>
          <displayName>USB_RXCSRH2</displayName>
          <description>USB Receive Control and Status Endpoint 2 High</description>
          <addressOffset>0x00000127</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH2_INCOMPRX</name>
              <description>Incomplete RX Transmission Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_DISNYET</name>
              <description>Disable NYET</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_PIDERR</name>
              <description>PID Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_AUTORQ</name>
              <description>Auto Request</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH2_AUTOCL</name>
              <description>Auto Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT2</name>
          <displayName>USB_RXCOUNT2</displayName>
          <description>USB Receive Byte Count Endpoint 2</description>
          <addressOffset>0x00000128</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT2_COUNT</name>
              <description>Receive Packet Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE2</name>
          <displayName>USB_TXTYPE2</displayName>
          <description>USB Host Transmit Configure Type Endpoint 2</description>
          <addressOffset>0x0000012A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE2_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE2_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE2_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE2_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE2_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE2_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE2_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE2_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE2_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE2_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE2_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL2</name>
          <displayName>USB_TXINTERVAL2</displayName>
          <description>USB Host Transmit Interval Endpoint 2</description>
          <addressOffset>0x0000012B</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RXTYPE2</name>
          <displayName>USB_RXTYPE2</displayName>
          <description>USB Host Configure Receive Type Endpoint 2</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE2_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE2_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE2_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE2_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE2_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE2_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE2_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE2_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE2_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE2_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE2_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL2</name>
          <displayName>USB_RXINTERVAL2</displayName>
          <description>USB Host Receive Polling Interval Endpoint 2</description>
          <addressOffset>0x0000012D</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_TXMAXP3</name>
          <displayName>USB_TXMAXP3</displayName>
          <description>USB Maximum Transmit Data Endpoint 3</description>
          <addressOffset>0x00000130</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP3_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL3</name>
          <displayName>USB_TXCSRL3</displayName>
          <description>USB Transmit Control and Status Endpoint 3 Low</description>
          <addressOffset>0x00000132</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL3_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL3_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH3</name>
          <displayName>USB_TXCSRH3</displayName>
          <description>USB Transmit Control and Status Endpoint 3 High</description>
          <addressOffset>0x00000133</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH3_DT</name>
              <description>Data Toggle</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_FDT</name>
              <description>Force Data Toggle</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_MODE</name>
              <description>Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH3_AUTOSET</name>
              <description>Auto Set</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP3</name>
          <displayName>USB_RXMAXP3</displayName>
          <description>USB Maximum Receive Data Endpoint 3</description>
          <addressOffset>0x00000134</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP3_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
