m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_RXCSRL3</name>
          <displayName>USB_RXCSRL3</displayName>
          <description>USB Receive Control and Status Endpoint 3 Low</description>
          <addressOffset>0x00000136</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL3_RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL3_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH3</name>
          <displayName>USB_RXCSRH3</displayName>
          <description>USB Receive Control and Status Endpoint 3 High</description>
          <addressOffset>0x00000137</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH3_INCOMPRX</name>
              <description>Incomplete RX Transmission Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_DISNYET</name>
              <description>Disable NYET</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_PIDERR</name>
              <description>PID Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_AUTORQ</name>
              <description>Auto Request</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH3_AUTOCL</name>
              <description>Auto Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT3</name>
          <displayName>USB_RXCOUNT3</displayName>
          <description>USB Receive Byte Count Endpoint 3</description>
          <addressOffset>0x00000138</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT3_COUNT</name>
              <description>Receive Packet Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE3</name>
          <displayName>USB_TXTYPE3</displayName>
          <description>USB Host Transmit Configure Type Endpoint 3</description>
          <addressOffset>0x0000013A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE3_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE3_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE3_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL3</name>
          <displayName>USB_TXINTERVAL3</displayName>
          <description>USB Host Transmit Interval Endpoint 3</description>
          <addressOffset>0x0000013B</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RXTYPE3</name>
          <displayName>USB_RXTYPE3</displayName>
          <description>USB Host Configure Receive Type Endpoint 3</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE3_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE3_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE3_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL3</name>
          <displayName>USB_RXINTERVAL3</displayName>
          <description>USB Host Receive Polling Interval Endpoint 3</description>
          <addressOffset>0x0000013D</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_TXMAXP4</name>
          <displayName>USB_TXMAXP4</displayName>
          <description>USB Maximum Transmit Data Endpoint 4</description>
          <addressOffset>0x00000140</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP4_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL4</name>
          <displayName>USB_TXCSRL4</displayName>
          <description>USB Transmit Control and Status Endpoint 4 Low</description>
          <addressOffset>0x00000142</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL4_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL4_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH4</name>
          <displayName>USB_TXCSRH4</displayName>
          <description>USB Transmit Control and Status Endpoint 4 High</description>
          <addressOffset>0x00000143</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH4_DT</name>
              <description>Data Toggle</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_FDT</name>
              <description>Force Data Toggle</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_MODE</name>
              <description>Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH4_AUTOSET</name>
              <description>Auto Set</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP4</name>
          <displayName>USB_RXMAXP4</displayName>
          <description>USB Maximum Receive Data Endpoint 4</description>
          <addressOffset>0x00000144</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP4_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL4</name>
          <displayName>USB_RXCSRL4</displayName>
          <description>USB Receive Control and Status Endpoint 4 Low</description>
          <addressOffset>0x00000146</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL4_RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL4_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
