m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_RXCSRH4</name>
          <displayName>USB_RXCSRH4</displayName>
          <description>USB Receive Control and Status Endpoint 4 High</description>
          <addressOffset>0x00000147</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH4_INCOMPRX</name>
              <description>Incomplete RX Transmission Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_DISNYET</name>
              <description>Disable NYET</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_PIDERR</name>
              <description>PID Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_AUTORQ</name>
              <description>Auto Request</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH4_AUTOCL</name>
              <description>Auto Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT4</name>
          <displayName>USB_RXCOUNT4</displayName>
          <description>USB Receive Byte Count Endpoint 4</description>
          <addressOffset>0x00000148</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT4_COUNT</name>
              <description>Receive Packet Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE4</name>
          <displayName>USB_TXTYPE4</displayName>
          <description>USB Host Transmit Configure Type Endpoint 4</description>
          <addressOffset>0x0000014A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE4_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE4_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE4_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL4</name>
          <displayName>USB_TXINTERVAL4</displayName>
          <description>USB Host Transmit Interval Endpoint 4</description>
          <addressOffset>0x0000014B</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RXTYPE4</name>
          <displayName>USB_RXTYPE4</displayName>
          <description>USB Host Configure Receive Type Endpoint 4</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE4_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE4_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE4_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL4</name>
          <displayName>USB_RXINTERVAL4</displayName>
          <description>USB Host Receive Polling Interval Endpoint 4</description>
          <addressOffset>0x0000014D</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_TXMAXP5</name>
          <displayName>USB_TXMAXP5</displayName>
          <description>USB Maximum Transmit Data Endpoint 5</description>
          <addressOffset>0x00000150</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP5_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL5</name>
          <displayName>USB_TXCSRL5</displayName>
          <description>USB Transmit Control and Status Endpoint 5 Low</description>
          <addressOffset>0x00000152</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL5_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL5_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH5</name>
          <displayName>USB_TXCSRH5</displayName>
          <description>USB Transmit Control and Status Endpoint 5 High</description>
          <addressOffset>0x00000153</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH5_DT</name>
              <description>Data Toggle</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_FDT</name>
              <description>Force Data Toggle</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_MODE</name>
              <description>Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH5_AUTOSET</name>
              <description>Auto Set</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP5</name>
          <displayName>USB_RXMAXP5</displayName>
          <description>USB Maximum Receive Data Endpoint 5</description>
          <addressOffset>0x00000154</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP5_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL5</name>
          <displayName>USB_RXCSRL5</displayName>
          <description>USB Receive Control and Status Endpoint 5 Low</description>
          <addressOffset>0x00000156</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL5_RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL5_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH5</name>
          <displayName>USB_RXCSRH5</displayName>
          <description>USB Receive Control and Status Endpoint 5 High</description>
          <addressOffset>0x00000157</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH5_INCOMPRX</name>
              <description>Incomplete RX Transmission Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_DISNYET</name>
              <description>Disable NYET</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_PIDERR</name>
              <description>PID Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_AUTORQ</name>
              <description>Auto Request</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH5_AUTOCL</name>
              <description>Auto Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT5</name>
          <displayName>USB_RXCOUNT5</displayName>
          <description>USB Receive Byte Count Endpoint 5</description>
          <addressOffset>0x00000158</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT5_COUNT</name>
              <description>Receive Packet Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
