m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_RXTYPE6</name>
          <displayName>USB_RXTYPE6</displayName>
          <description>USB Host Configure Receive Type Endpoint 6</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE6_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE6_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE6_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE6_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE6_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE6_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE6_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE6_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE6_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE6_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE6_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL6</name>
          <displayName>USB_RXINTERVAL6</displayName>
          <description>USB Host Receive Polling Interval Endpoint 6</description>
          <addressOffset>0x0000016D</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_TXMAXP7</name>
          <displayName>USB_TXMAXP7</displayName>
          <description>USB Maximum Transmit Data Endpoint 7</description>
          <addressOffset>0x00000170</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP7_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL7</name>
          <displayName>USB_TXCSRL7</displayName>
          <description>USB Transmit Control and Status Endpoint 7 Low</description>
          <addressOffset>0x00000172</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL7_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL7_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH7</name>
          <displayName>USB_TXCSRH7</displayName>
          <description>USB Transmit Control and Status Endpoint 7 High</description>
          <addressOffset>0x00000173</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH7_DT</name>
              <description>Data Toggle</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_FDT</name>
              <description>Force Data Toggle</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_MODE</name>
              <description>Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH7_AUTOSET</name>
              <description>Auto Set</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP7</name>
          <displayName>USB_RXMAXP7</displayName>
          <description>USB Maximum Receive Data Endpoint 7</description>
          <addressOffset>0x00000174</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP7_MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL7</name>
          <displayName>USB_RXCSRL7</displayName>
          <description>USB Receive Control and Status Endpoint 7 Low</description>
          <addressOffset>0x00000176</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL7_RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL7_CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH7</name>
          <displayName>USB_RXCSRH7</displayName>
          <description>USB Receive Control and Status Endpoint 7 High</description>
          <addressOffset>0x00000177</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH7_INCOMPRX</name>
              <description>Incomplete RX Transmission Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_PIDERR</name>
              <description>PID Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_DISNYET</name>
              <description>Disable NYET</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_AUTORQ</name>
              <description>Auto Request</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH7_AUTOCL</name>
              <description>Auto Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT7</name>
          <displayName>USB_RXCOUNT7</displayName>
          <description>USB Receive Byte Count Endpoint 7</description>
          <addressOffset>0x00000178</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT7_COUNT</name>
              <description>Receive Packet Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE7</name>
          <displayName>USB_TXTYPE7</displayName>
          <description>USB Host Transmit Configure Type Endpoint 7</description>
          <addressOffset>0x0000017A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE7_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE7_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE7_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE7_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL7</name>
          <displayName>USB_TXINTERVAL7</displayName>
          <description>USB Host Transmit Interval Endpoint 7</description>
          <addressOffset>0x0000017B</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RXTYPE7</name>
          <displayName>USB_RXTYPE7</displayName>
          <description>USB Host Configure Receive Type Endpoint 7</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE7_TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE7_PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE7_SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE7_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL7</name>
          <displayName>USB_RXINTERVAL7</displayName>
          <description>USB Host Receive Polling Interval Endpoint 7</description>
          <addressOffset>0x0000017D</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
