m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_DMAINTR</name>
          <displayName>USB_DMAINTR</displayName>
          <description>USB DMA Interrupt</description>
          <addressOffset>0x00000200</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_DMAINTR_CH0</name>
              <description>Channel 0 DMA Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH1</name>
              <description>Channel 1 DMA Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH2</name>
              <description>Channel 2 DMA Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH3</name>
              <description>Channel 3 DMA Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH4</name>
              <description>Channel 4 DMA Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH5</name>
              <description>Channel 5 DMA Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH6</name>
              <description>Channel 6 DMA Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMAINTR_CH7</name>
              <description>Channel 7 DMA Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL0</name>
          <displayName>USB_DMACTL0</displayName>
          <description>USB DMA Control 0</description>
          <addressOffset>0x00000204</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL0_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL0_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL0_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL0_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL0_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL0_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL0_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR0</name>
          <displayName>USB_DMAADDR0</displayName>
          <description>USB DMA Address 0</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR0_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT0</name>
          <displayName>USB_DMACOUNT0</displayName>
          <description>USB DMA Count 0</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT0_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL1</name>
          <displayName>USB_DMACTL1</displayName>
          <description>USB DMA Control 1</description>
          <addressOffset>0x00000214</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL1_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL1_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL1_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL1_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL1_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL1_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL1_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR1</name>
          <displayName>USB_DMAADDR1</displayName>
          <description>USB DMA Address 1</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR1_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT1</name>
          <displayName>USB_DMACOUNT1</displayName>
          <description>USB DMA Count 1</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT1_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL2</name>
          <displayName>USB_DMACTL2</displayName>
          <description>USB DMA Control 2</description>
          <addressOffset>0x00000224</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL2_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL2_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL2_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL2_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL2_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL2_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL2_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR2</name>
          <displayName>USB_DMAADDR2</displayName>
          <description>USB DMA Address 2</description>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR2_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT2</name>
          <displayName>USB_DMACOUNT2</displayName>
          <description>USB DMA Count 2</description>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT2_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL3</name>
          <displayName>USB_DMACTL3</displayName>
          <description>USB DMA Control 3</description>
          <addressOffset>0x00000234</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL3_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL3_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL3_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL3_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL3_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL3_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL3_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR3</name>
          <displayName>USB_DMAADDR3</displayName>
          <description>USB DMA Address 3</description>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR3_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT3</name>
          <displayName>USB_DMACOUNT3</displayName>
          <description>USB DMA Count 3</description>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT3_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL4</name>
          <displayName>USB_DMACTL4</displayName>
          <description>USB DMA Control 4</description>
          <addressOffset>0x00000244</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL4_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL4_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL4_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL4_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL4_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL4_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL4_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR4</name>
          <displayName>USB_DMAADDR4</displayName>
          <description>USB DMA Address 4</description>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR4_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT4</name>
          <displayName>USB_DMACOUNT4</displayName>
          <description>USB DMA Count 4</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT4_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
