m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_DMACTL5</name>
          <displayName>USB_DMACTL5</displayName>
          <description>USB DMA Control 5</description>
          <addressOffset>0x00000254</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL5_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL5_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL5_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL5_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL5_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL5_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL5_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR5</name>
          <displayName>USB_DMAADDR5</displayName>
          <description>USB DMA Address 5</description>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR5_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT5</name>
          <displayName>USB_DMACOUNT5</displayName>
          <description>USB DMA Count 5</description>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT5_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL6</name>
          <displayName>USB_DMACTL6</displayName>
          <description>USB DMA Control 6</description>
          <addressOffset>0x00000264</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL6_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL6_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL6_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL6_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL6_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL6_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL6_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL6_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR6</name>
          <displayName>USB_DMAADDR6</displayName>
          <description>USB DMA Address 6</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR6_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT6</name>
          <displayName>USB_DMACOUNT6</displayName>
          <description>USB DMA Count 6</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT6_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACTL7</name>
          <displayName>USB_DMACTL7</displayName>
          <description>USB DMA Control 7</description>
          <addressOffset>0x00000274</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL7_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL7_DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL7_MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL7_IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL7_EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL7_ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DMACTL7_BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL7_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x00000600</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMAADDR7</name>
          <displayName>USB_DMAADDR7</displayName>
          <description>USB DMA Address 7</description>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMAADDR7_ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DMACOUNT7</name>
          <displayName>USB_DMACOUNT7</displayName>
          <description>USB DMA Count 7</description>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DMACOUNT7_COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RQPKTCOUNT1</name>
          <displayName>USB_RQPKTCOUNT1</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 1</description>
          <addressOffset>0x00000304</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RQPKTCOUNT2</name>
          <displayName>USB_RQPKTCOUNT2</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 2</description>
          <addressOffset>0x00000308</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RQPKTCOUNT3</name>
          <displayName>USB_RQPKTCOUNT3</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 3</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RQPKTCOUNT4</name>
          <displayName>USB_RQPKTCOUNT4</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 4</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RQPKTCOUNT5</name>
          <displayName>USB_RQPKTCOUNT5</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 5</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RQPKTCOUNT6</name>
          <displayName>USB_RQPKTCOUNT6</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 6</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RQPKTCOUNT7</name>
          <displayName>USB_RQPKTCOUNT7</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 7</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_RXDPKTBUFDIS</name>
          <displayName>USB_RXDPKTBUFDIS</displayName>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXDPKTBUFDIS_EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXDPKTBUFDIS</name>
          <displayName>USB_TXDPKTBUFDIS</displayName>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXDPKTBUFDIS_EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CTO</name>
          <displayName>USB_CTO</displayName>
          <description>USB Chirp Timeout</description>
          <addressOffset>0x00000344</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_HHSRTN</name>
          <displayName>USB_HHSRTN</displayName>
          <description>USB High Speed to UTM Operating Delay</description>
          <addressOffset>0x00000346</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USB_HSBT</name>
          <displayName>USB_HSBT</displayName>
          <description>USB High Speed Time-out Adder</description>
          <addressOffset>0x00000348</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_HSBT_HSBT</name>
              <description>High Speed Timeout Adder</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_LPMATTR</name>
          <displayName>USB_LPMATTR</displayName>
          <description>USB LPM Attributes</description>
          <addressOffset>0x00000360</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_LPMATTR_LS</name>
              <description>Link State</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_LPMATTR_LS_L1</name>
                  <description>Sleep State (L1)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_LPMATTR_HIRD</name>
              <description>Host Initiated Resume Duration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMATTR_RMTWAK</name>
              <description>Remote Wake</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMATTR_ENDPT</name>
              <description>Endpoint</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_LPMCNTRL</name>
          <displayName>USB_LPMCNTRL</displayName>
          <description>USB LPM Control</description>
          <addressOffset>0x00000362</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMCNTRL_TXLPM</name>
              <description>Transmit LPM Transaction Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMCNTRL_RES</name>
              <description>LPM Resume</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMCNTRL_EN</name>
              <description>LPM Enable</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_LPMCNTRL_EN_NONE</name>
                  <description>LPM and Extended transactions are not supported. In this case, the USB does not respond to LPM transactions and LPM transactions cause a timeout</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_LPMCNTRL_EN_EXT</name>
                  <description>LPM is not supported but extended transactions are supported. In this case, the USB does respond to an LPM transaction with a STALL</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_LPMCNTRL_EN_LPMEXT</name>
                  <description>The USB supports LPM extended transactions. In this case, the USB responds with a NYET or an ACK as determined by the value of TXLPM and other conditions</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_LPMCNTRL_NAK</name>
              <description>LPM NAK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
