m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>USB_LPMIM</name>
          <displayName>USB_LPMIM</displayName>
          <description>USB LPM Interrupt Mask</description>
          <addressOffset>0x00000363</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMIM_STALL</name>
              <description>LPM STALL Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMIM_NY</name>
              <description>LPM NY Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMIM_ACK</name>
              <description>LPM ACK Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMIM_NC</name>
              <description>LPM NC Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMIM_RES</name>
              <description>LPM Resume Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMIM_ERR</name>
              <description>LPM Error Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_LPMRIS</name>
          <displayName>USB_LPMRIS</displayName>
          <description>USB LPM Raw Interrupt Status</description>
          <addressOffset>0x00000364</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMRIS_LPMST</name>
              <description>LPM STALL Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMRIS_NY</name>
              <description>LPM NY Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMRIS_ACK</name>
              <description>LPM ACK Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMRIS_NC</name>
              <description>LPM NC Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMRIS_RES</name>
              <description>LPM Resume Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_LPMRIS_ERR</name>
              <description>LPM Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_LPMFADDR</name>
          <displayName>USB_LPMFADDR</displayName>
          <description>USB LPM Function Address</description>
          <addressOffset>0x00000365</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LPMFADDR_ADDR</name>
              <description>LPM Function Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EPC</name>
          <displayName>USB_EPC</displayName>
          <description>USB External Power Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPC_EPEN</name>
              <description>External Power Supply Enable Configuration</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_LOW</name>
                  <description>Power Enable Active Low</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_HIGH</name>
                  <description>Power Enable Active High</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_VBLOW</name>
                  <description>Power Enable High if VBUS Low (OTG only)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_VBHIGH</name>
                  <description>Power Enable High if VBUS High (OTG only)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_EPC_EPENDE</name>
              <description>EPEN Drive Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_EPC_PFLTEN</name>
              <description>Power Fault Input Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_EPC_PFLTSEN_HIGH</name>
              <description>Power Fault Sense</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_EPC_PFLTAEN</name>
              <description>Power Fault Action Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_EPC_PFLTACT</name>
              <description>Power Fault Action</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_UNCHG</name>
                  <description>Unchanged</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_TRIS</name>
                  <description>Tristate</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_LOW</name>
                  <description>Low</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_HIGH</name>
                  <description>High</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EPCRIS</name>
          <displayName>USB_EPCRIS</displayName>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPCRIS_PF</name>
              <description>USB Power Fault Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EPCIM</name>
          <displayName>USB_EPCIM</displayName>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPCIM_PF</name>
              <description>USB Power Fault Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_EPCISC</name>
          <displayName>USB_EPCISC</displayName>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPCISC_PF</name>
              <description>USB Power Fault Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DRRIS</name>
          <displayName>USB_DRRIS</displayName>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DRRIS_RESUME</name>
              <description>RESUME Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DRIM</name>
          <displayName>USB_DRIM</displayName>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DRIM_RESUME</name>
              <description>RESUME Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DRISC</name>
          <displayName>USB_DRISC</displayName>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DRISC_RESUME</name>
              <description>RESUME Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_GPCS</name>
          <displayName>USB_GPCS</displayName>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_GPCS_DEVMOD</name>
              <description>Device Mode</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_GPCS_DEVMOD_OTG</name>
                  <description>Use USB0VBUS and USB0ID pin</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_GPCS_DEVMOD_HOST</name>
                  <description>Force USB0VBUS and USB0ID low</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_GPCS_DEVMOD_DEV</name>
                  <description>Force USB0VBUS and USB0ID high</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_GPCS_DEVMOD_HOSTVBUS</name>
                  <description>Use USB0VBUS and force USB0ID low</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_GPCS_DEVMOD_DEVVBUS</name>
                  <description>Use USB0VBUS and force USB0ID high</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_VDC</name>
          <displayName>USB_VDC</displayName>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDC_VBDEN</name>
              <description>VBUS Droop Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_VDCRIS</name>
          <displayName>USB_VDCRIS</displayName>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDCRIS_VD</name>
              <description>VBUS Droop Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_VDCIM</name>
          <displayName>USB_VDCIM</displayName>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDCIM_VD</name>
              <description>VBUS Droop Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_VDCISC</name>
          <displayName>USB_VDCISC</displayName>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDCISC_VD</name>
              <description>VBUS Droop Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_PP</name>
          <displayName>USB_PP</displayName>
          <description>USB Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_PP_TYPE</name>
              <description>Controller Type</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_PP_TYPE_0</name>
                  <description>The first-generation USB controller</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_PP_TYPE_1</name>
                  <description>Second-generation USB controller.The controller implemented in post Icestorm devices that use the 3.0 version of the Mentor controller</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_PP_PHY</name>
              <description>PHY Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_PP_ULPI</name>
              <description>ULPI Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_PP_USB</name>
              <description>USB Capability</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_PP_USB_DEVICE</name>
                  <description>DEVICE</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_PP_USB_HOSTDEVICE</name>
                  <description>HOST</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_PP_USB_OTG</name>
                  <description>OTG</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_PP_ECNT</name>
              <description>Endpoint Count</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_PC</name>
          <displayName>USB_PC</displayName>
          <description>USB Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_PC_ULPIEN</name>
              <description>ULPI Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CC</name>
          <displayName>USB_CC</displayName>
          <description>USB Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_CC_CLKDIV</name>
              <description>PLL Clock Divisor</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_CC_CSD</name>
              <description>Clock Source/Direction</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_CC_CLKEN</name>
              <description>USB Clock Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
