m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTB_AHB</name>
      <baseAddress>0x40059000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTC_AHB</name>
      <baseAddress>0x4005A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTD_AHB</name>
      <baseAddress>0x4005B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTE_AHB</name>
      <baseAddress>0x4005C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTF_AHB</name>
      <baseAddress>0x4005D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTG_AHB</name>
      <baseAddress>0x4005E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTH_AHB</name>
      <baseAddress>0x4005F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTJ_AHB</name>
      <baseAddress>0x40060000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTK</name>
      <baseAddress>0x40061000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTL</name>
      <baseAddress>0x40062000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTM</name>
      <baseAddress>0x40063000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTN</name>
      <baseAddress>0x40064000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTP</name>
      <baseAddress>0x40065000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA_AHB">
      <name>GPIO_PORTQ</name>
      <baseAddress>0x40066000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/eeprom.xml -->
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM register offsets</description>
      <baseAddress>0x400AF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>EEPROM_EESIZE</name>
          <displayName>EEPROM_EESIZE</displayName>
          <description>EEPROM Size Information</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EESIZE_WORDCNT</name>
              <description>Number of 32-Bit Words</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EEPROM_EESIZE_BLKCNT</name>
              <description>Number of 16-Word Blocks</description>
              <lsb>16</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EEBLOCK</name>
          <displayName>EEPROM_EEBLOCK</displayName>
          <description>EEPROM Current Block</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEBLOCK_BLOCK</name>
              <description>Current Block</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EEOFFSET</name>
          <displayName>EEPROM_EEOFFSET</displayName>
          <description>EEPROM Current Offset</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEOFFSET_OFFSET</name>
              <description>Current Address Offset</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EERDWR</name>
          <displayName>EEPROM_EERDWR</displayName>
          <description>EEPROM Read-Write</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EERDWRINC</name>
          <displayName>EEPROM_EERDWRINC</displayName>
          <description>EEPROM Read-Write with Increment</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEDONE</name>
          <displayName>EEPROM_EEDONE</displayName>
          <description>EEPROM Done Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEDONE_WORKING</name>
              <description>EEPROM Working</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EEPROM_EEDONE_WKERASE</name>
              <description>Working on an Erase</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EEPROM_EEDONE_WKCOPY</name>
              <description>Working on a Copy</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EEPROM_EEDONE_NOPERM</name>
              <description>Write Without Permission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EEPROM_EEDONE_WRBUSY</name>
              <description>Write Busy</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EESUPP</name>
          <displayName>EEPROM_EESUPP</displayName>
          <description>EEPROM Support Control and Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EESUPP_ERETRY</name>
              <description>Erase Must Be Retried</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPROM_EESUPP_PRETRY</name>
              <description>Programming Must Be Retried</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EEUNLOCK</name>
          <displayName>EEPROM_EEUNLOCK</displayName>
          <description>EEPROM Unlock</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEPROT</name>
          <displayName>EEPROM_EEPROT</displayName>
          <description>EEPROM Protection</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEPROT_PROT</name>
              <description>Protection Control</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEPROM_EEPROT_PROT_RWNPW</name>
                  <description>This setting is the default. If there is no password, the block is not protected and is readable and writable</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_EEPROT_PROT_RWPW</name>
                  <description>If there is a password, the block is readable or writable only when unlocked</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_EEPROT_PROT_RONPW</name>
                  <description>If there is no password, the block is readable, not writable</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EEPROM_EEPROT_ACC</name>
              <description>Access Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EEPASS0</name>
          <displayName>EEPROM_EEPASS0</displayName>
          <description>EEPROM Password</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEPASS1</name>
          <displayName>EEPROM_EEPASS1</displayName>
          <description>EEPROM Password</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEPASS2</name>
          <displayName>EEPROM_EEPASS2</displayName>
          <description>EEPROM Password</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEINT</name>
          <displayName>EEPROM_EEINT</displayName>
          <description>EEPROM Interrupt</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEINT_INT</name>
              <description>Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EEHIDE0</name>
          <displayName>EEPROM_EEHIDE0</displayName>
          <description>EEPROM Block Hide 0</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEHIDE0_HN</name>
              <description>Hide Block</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_EEHIDE1</name>
          <displayName>EEPROM_EEHIDE1</displayName>
          <description>EEPROM Block Hide 1</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEHIDE2</name>
          <displayName>EEPROM_EEHIDE2</displayName>
          <description>EEPROM Block Hide 2</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EEPROM_EEDBGME</name>
          <displayName>EEPROM_EEDBGME</displayName>
          <description>EEPROM Debug Mass Erase</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_EEDBGME_ME</name>
              <description>Mass Erase</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPROM_EEDBGME_KEY</name>
              <description>Erase Key</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_PP</name>
          <displayName>EEPROM_PP</displayName>
          <description>EEPROM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EEPROM_PP_SIZE</name>
              <description>EEPROM Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_64</name>
                  <description>64 bytes of EEPROM</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_128</name>
                  <description>128 bytes of EEPROM</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_256</name>
                  <description>256 bytes of EEPROM</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_512</name>
                  <description>512 bytes of EEPROM</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_1K</name>
                  <description>1 KB of EEPROM</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_2K</name>
                  <description>2 KB of EEPROM</description>
                  <value>0x0000001F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_3K</name>
                  <description>3 KB of EEPROM</description>
                  <value>0x0000003F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_4K</name>
                  <description>4 KB of EEPROM</description>
                  <value>0x0000007F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_5K</name>
                  <description>5 KB of EEPROM</description>
                  <value>0x000000FF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_6K</name>
                  <description>6 KB of EEPROM</description>
                  <value>0x000001FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
