m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C8</name>
      <baseAddress>0x400B8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C9</name>
      <baseAddress>0x400B9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C4</name>
      <baseAddress>0x400C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C5</name>
      <baseAddress>0x400C1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C6</name>
      <baseAddress>0x400C2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C7</name>
      <baseAddress>0x400C3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/epi.xml -->
    <peripheral>
      <name>EPI0</name>
      <description>External Peripheral Interface register offsets</description>
      <baseAddress>0x400D0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>EPI_CFG</name>
          <displayName>EPI_CFG</displayName>
          <description>EPI Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_CFG_MODE</name>
              <description>Mode Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_NONE</name>
                  <description>General Purpose</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_SDRAM</name>
                  <description>SDRAM</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_HB8</name>
                  <description>8-Bit Host-Bus (HB8)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_HB16</name>
                  <description>16-Bit Host-Bus (HB16)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_CFG_BLKEN</name>
              <description>Block Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_CFG_INTDIV</name>
              <description>Integer Clock Divider Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_BAUD</name>
          <displayName>EPI_BAUD</displayName>
          <description>EPI Main Baud Rate</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_BAUD_COUNT0</name>
              <description>Baud Rate Counter 0</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_BAUD_COUNT1</name>
              <description>Baud Rate Counter 1</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_BAUD2</name>
          <displayName>EPI_BAUD2</displayName>
          <description>EPI Main Baud Rate</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_BAUD2_COUNT0</name>
              <description>CS2n Baud Rate Counter 0</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_BAUD2_COUNT1</name>
              <description>CS3n Baud Rate Counter 1</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16CFG</name>
          <displayName>EPI_HB16CFG</displayName>
          <description>EPI Host-Bus 16 Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16CFG_MODE</name>
              <description>Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_ADNMUX</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_SRAM</name>
                  <description>Continuous Read - D[15:0]</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_XFIFO</name>
                  <description>XFIFO - D[15:0]</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG_BSEL</name>
              <description>Byte Select Configuration</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_RDWS</name>
              <description>Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG_WRWS</name>
              <description>Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG_MAXWAIT</name>
              <description>Maximum Wait</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_BURST</name>
              <description>Burst Mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_RDCRE</name>
              <description>PSRAM Configuration Register Read</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_WRCRE</name>
              <description>PSRAM Configuration Register Write</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_ALEHIGH</name>
              <description>ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_RDHIGH</name>
              <description>READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_WRHIGH</name>
              <description>WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_XFEEN</name>
              <description>External FIFO EMPTY Enable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_XFFEN</name>
              <description>External FIFO FULL Enable</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_IRDYINV</name>
              <description>Input Ready Invert</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_RDYEN</name>
              <description>Input Ready Enable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_CLKINV</name>
              <description>Invert Output Clock Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_CLKGATEI</name>
              <description>Clock Gated Idle</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG_CLKGATE</name>
              <description>Clock Gated</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_GPCFG</name>
          <displayName>EPI_GPCFG</displayName>
          <description>EPI General-Purpose Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_GPCFG_DSIZE</name>
              <description>Size of Data Bus</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_4BIT</name>
                  <description>8 Bits Wide (EPI0S0 to EPI0S7)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_16BIT</name>
                  <description>16 Bits Wide (EPI0S0 to EPI0S15)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_24BIT</name>
                  <description>24 Bits Wide (EPI0S0 to EPI0S23)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_32BIT</name>
                  <description>32 Bits Wide (EPI0S0 to EPI0S31)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_GPCFG_ASIZE</name>
              <description>Address Bus Size</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_NONE</name>
                  <description>No address</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_4BIT</name>
                  <description>Up to 4 bits wide</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_12BIT</name>
                  <description>Up to 12 bits wide. This size cannot be used with 24-bit data</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_20BIT</name>
                  <description>Up to 20 bits wide. This size cannot be used with data sizes other than 8</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_GPCFG_WR2CYC</name>
              <description>2-Cycle Writes</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_GPCFG_FRMCNT</name>
              <description>Frame Count</description>
              <lsb>22</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_GPCFG_FRM50</name>
              <description>50/50 Frame</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_GPCFG_CLKGATE</name>
              <description>Clock Gated</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_GPCFG_CLKPIN</name>
              <description>Clock Pin</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_SDRAMCFG</name>
          <displayName>EPI_SDRAMCFG</displayName>
          <description>EPI SDRAM Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_SDRAMCFG_SIZE</name>
              <description>Size of SDRAM</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_8MB</name>
                  <description>64 megabits (8MB)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_16MB</name>
                  <description>128 megabits (16MB)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_32MB</name>
                  <description>256 megabits (32MB)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_64MB</name>
                  <description>512 megabits (64MB)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_SDRAMCFG_SLEEP</name>
              <description>Sleep Mode</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_SDRAMCFG_RFSH</name>
              <description>Refresh Counter</description>
              <lsb>16</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_SDRAMCFG_FREQ</name>
              <description>EPI Frequency Range</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_FREQ_NONE</name>
                  <description>0 - 15 MHz</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_FREQ_15MHZ</name>
                  <description>15 - 30 MHz</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_FREQ_30MHZ</name>
                  <description>30 - 50 MHz</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
