m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EPI_HB8CFG</name>
          <displayName>EPI_HB8CFG</displayName>
          <description>EPI Host-Bus 8 Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8CFG_MODE</name>
              <description>Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_MUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_NMUX</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_SRAM</name>
                  <description>Continuous Read - D[7:0]</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_FIFO</name>
                  <description>XFIFO - D[7:0]</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG_RDWS</name>
              <description>Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG_WRWS</name>
              <description>Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG_MAXWAIT</name>
              <description>Maximum Wait</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_ALEHIGH</name>
              <description>ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_RDHIGH</name>
              <description>READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_WRHIGH</name>
              <description>WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_XFEEN</name>
              <description>External FIFO EMPTY Enable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_XFFEN</name>
              <description>External FIFO FULL Enable</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_IRDYINV</name>
              <description>Input Ready Invert</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_RDYEN</name>
              <description>Input Ready Enable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_CLKINV</name>
              <description>Invert Output Clock Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_CLKGATEI</name>
              <description>Clock Gated when Idle</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG_CLKGATE</name>
              <description>Clock Gated</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB8CFG2</name>
          <displayName>EPI_HB8CFG2</displayName>
          <description>EPI Host-Bus 8 Configuration 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8CFG2_MODE</name>
              <description>CS1n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_MODE_ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_MODE_AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_RDWS</name>
              <description>CS1n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_WRWS</name>
              <description>CS1n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_ALEHIGH</name>
              <description>CS1n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG2_RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG2_WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x01000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x02000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x03000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate and Multiple Sub-Mode Configuration enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSCFGEXT</name>
              <description>Chip Select Extended Configuration</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16CFG2</name>
          <displayName>EPI_HB16CFG2</displayName>
          <description>EPI Host-Bus 16 Configuration 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16CFG2_MODE</name>
              <description>CS1n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_MODE_AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDWS</name>
              <description>CS1n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRWS</name>
              <description>CS1n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_BURST</name>
              <description>CS1n Burst Mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDCRE</name>
              <description>CS1n PSRAM Configuration Register Read</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRCRE</name>
              <description>CS1n PSRAM Configuration Register Write</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_ALEHIGH</name>
              <description>CS1n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x01000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x02000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x03000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate and Multiple Sub-Mode Configuration enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSCFGEXT</name>
              <description>Chip Select Extended Configuration</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
