m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EPI_ADDRMAP</name>
          <displayName>EPI_ADDRMAP</displayName>
          <description>EPI Address Map</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_ADDRMAP_ERADR</name>
              <description>External RAM Address</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_6000</name>
                  <description>At 0x6000.0000</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_8000</name>
                  <description>At 0x8000.0000</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_HBQS</name>
                  <description>Only to be used with Host Bus quad chip select. In quad chip select mode, CS0n maps to 0x6000.0000 and CS1n maps to 0x8000.0000</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ERSZ</name>
              <description>External RAM Size</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPADR</name>
              <description>External Peripheral Address</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_A000</name>
                  <description>At 0xA000.0000</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_C000</name>
                  <description>At 0xC000.0000</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_HBQS</name>
                  <description>Only to be used with Host Bus quad chip select. In quad chip select mode, CS2n maps to 0xA000.0000 and CS3n maps to 0xC000.0000</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPSZ</name>
              <description>External Peripheral Size</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ECADR</name>
              <description>External Code Address</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECADR_1000</name>
                  <description>At 0x1000.0000</description>
                  <value>0x00000100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ECSZ</name>
              <description>External Code Size</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_256MB</name>
                  <description>256MB; lower address range: 0x000.0000 to 0x0FFF.FFFF</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_RSIZE0</name>
          <displayName>EPI_RSIZE0</displayName>
          <description>EPI Read Size 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_RSIZE0_SIZE</name>
              <description>Current Size</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_RADDR0</name>
          <displayName>EPI_RADDR0</displayName>
          <description>EPI Read Address 0</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EPI_RPSTD0</name>
          <displayName>EPI_RPSTD0</displayName>
          <description>EPI Non-Blocking Read Data 0</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_RPSTD0_POSTCNT</name>
              <description>Post Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_RSIZE1</name>
          <displayName>EPI_RSIZE1</displayName>
          <description>EPI Read Size 1</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_RSIZE1_SIZE</name>
              <description>Current Size</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_RADDR1</name>
          <displayName>EPI_RADDR1</displayName>
          <description>EPI Read Address 1</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EPI_RPSTD1</name>
          <displayName>EPI_RPSTD1</displayName>
          <description>EPI Non-Blocking Read Data 1</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_RPSTD1_POSTCNT</name>
              <description>Post Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_STAT</name>
          <displayName>EPI_STAT</displayName>
          <description>EPI Status</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_STAT_ACTIVE</name>
              <description>Register Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_STAT_NBRBUSY</name>
              <description>Non-Blocking Read Busy</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_STAT_WBUSY</name>
              <description>Write Busy</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_STAT_INITSEQ</name>
              <description>Initialization Sequence</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_STAT_XFEMPTY</name>
              <description>External FIFO Empty</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_STAT_XFFULL</name>
              <description>External FIFO Full</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_RFIFOCNT</name>
          <displayName>EPI_RFIFOCNT</displayName>
          <description>EPI Read FIFO Count</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_RFIFOCNT_COUNT</name>
              <description>FIFO Count</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_READFIFO0</name>
          <displayName>EPI_READFIFO0</displayName>
          <description>EPI Read FIFO</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO1</name>
          <displayName>EPI_READFIFO1</displayName>
          <description>EPI Read FIFO Alias 1</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO2</name>
          <displayName>EPI_READFIFO2</displayName>
          <description>EPI Read FIFO Alias 2</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO3</name>
          <displayName>EPI_READFIFO3</displayName>
          <description>EPI Read FIFO Alias 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO4</name>
          <displayName>EPI_READFIFO4</displayName>
          <description>EPI Read FIFO Alias 4</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO5</name>
          <displayName>EPI_READFIFO5</displayName>
          <description>EPI Read FIFO Alias 5</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO6</name>
          <displayName>EPI_READFIFO6</displayName>
          <description>EPI Read FIFO Alias 6</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_READFIFO7</name>
          <displayName>EPI_READFIFO7</displayName>
          <description>EPI Read FIFO Alias 7</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EPI_FIFOLVL</name>
          <displayName>EPI_FIFOLVL</displayName>
          <description>EPI FIFO Level Selects</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_FIFOLVL_RDFIFO</name>
              <description>Read FIFO</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1</name>
                  <description>Trigger when there are 1 or more entries in the NBRFIFO</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_2</name>
                  <description>Trigger when there are 2 or more entries in the NBRFIFO</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_4</name>
                  <description>Trigger when there are 4 or more entries in the NBRFIFO</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_6</name>
                  <description>Trigger when there are 6 or more entries in the NBRFIFO</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_7</name>
                  <description>Trigger when there are 7 or more entries in the NBRFIFO</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_8</name>
                  <description>Trigger when there are 8 entries in the NBRFIFO</description>
                  <value>0x00000006</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_WRFIFO</name>
              <description>Write FIFO</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_EMPT</name>
                  <description>Interrupt is triggered while WRFIFO is empty.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_2</name>
                  <description>Interrupt is triggered until there are only two slots available. Thus, trigger is deasserted when there are two WRFIFO entries present. This configuration is optimized for bursts of 2</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_1</name>
                  <description>Interrupt is triggered until there is one WRFIFO entry available. This configuration expects only single writes</description>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_NFULL</name>
                  <description>Trigger interrupt when WRFIFO is not full, meaning trigger will continue to assert until there are four entries in the WRFIFO</description>
                  <value>0x00000040</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_RSERR</name>
              <description>Read Stall Error</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_FIFOLVL_WFERR</name>
              <description>Write Full Error</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_WFIFOCNT</name>
          <displayName>EPI_WFIFOCNT</displayName>
          <description>EPI Write FIFO Count</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_WFIFOCNT_WTAV</name>
              <description>Available Write Transactions</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_DMATXCNT</name>
          <displayName>EPI_DMATXCNT</displayName>
          <description>EPI DMA Transmit Count</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_DMATXCNT_TXCNT</name>
              <description>DMA Count</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_IM</name>
          <displayName>EPI_IM</displayName>
          <description>EPI Interrupt Mask</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_IM_ERRIM</name>
              <description>Error Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_IM_RDIM</name>
              <description>Read FIFO Full Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_IM_WRIM</name>
              <description>Write FIFO Empty Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_IM_DMARDIM</name>
              <description>Read uDMA Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_IM_DMAWRIM</name>
              <description>Write uDMA Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
