m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EPI_RIS</name>
          <displayName>EPI_RIS</displayName>
          <description>EPI Raw Interrupt Status</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_RIS_ERRRIS</name>
              <description>Error Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_RIS_RDRIS</name>
              <description>Read Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_RIS_WRRIS</name>
              <description>Write Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_RIS_DMARDRIS</name>
              <description>Read uDMA Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_RIS_DMAWRRIS</name>
              <description>Write uDMA Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_MIS</name>
          <displayName>EPI_MIS</displayName>
          <description>EPI Masked Interrupt Status</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_MIS_ERRMIS</name>
              <description>Error Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_MIS_RDMIS</name>
              <description>Read Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_MIS_WRMIS</name>
              <description>Write Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_MIS_DMARDMIS</name>
              <description>Read uDMA Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EPI_MIS_DMAWRMIS</name>
              <description>Write uDMA Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_EISC</name>
          <displayName>EPI_EISC</displayName>
          <description>EPI Error and Interrupt Status and Clear</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_EISC_TOUT</name>
              <description>Timeout Error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_EISC_RSTALL</name>
              <description>Read Stalled Error</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_EISC_WTFULL</name>
              <description>Write FIFO Full Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_EISC_DMARDIC</name>
              <description>Read uDMA Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_EISC_DMAWRIC</name>
              <description>Write uDMA Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB8CFG3</name>
          <displayName>EPI_HB8CFG3</displayName>
          <description>EPI Host-Bus 8 Configuration 3</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8CFG3_MODE</name>
              <description>CS2n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_MODE_ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_MODE_AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG3_RDWS</name>
              <description>CS2n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG3_WRWS</name>
              <description>CS2n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG3_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG3_ALEHIGH</name>
              <description>CS2n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG3_RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG3_WRHIGH</name>
              <description>CS2n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16CFG3</name>
          <displayName>EPI_HB16CFG3</displayName>
          <description>EPI Host-Bus 16 Configuration 3</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16CFG3_MODE</name>
              <description>CS2n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_MODE_AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG3_RDWS</name>
              <description>CS2n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG3_WRWS</name>
              <description>CS2n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG3_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG3_BURST</name>
              <description>CS2n Burst Mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG3_RDCRE</name>
              <description>CS2n PSRAM Configuration Register Read</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG3_WRCRE</name>
              <description>CS2n PSRAM Configuration Register Write</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG3_ALEHIGH</name>
              <description>CS2n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG3_RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG3_WRHIGH</name>
              <description>CS2n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16CFG4</name>
          <displayName>EPI_HB16CFG4</displayName>
          <description>EPI Host-Bus 16 Configuration 4</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16CFG4_MODE</name>
              <description>CS3n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_MODE_AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG4_RDWS</name>
              <description>CS3n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG4_WRWS</name>
              <description>CS3n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG4_BURST</name>
              <description>CS3n Burst Mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG4_RDCRE</name>
              <description>CS3n PSRAM Configuration Register Read</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG4_WRCRE</name>
              <description>CS3n PSRAM Configuration Register Write</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG4_ALEHIGH</name>
              <description>CS3n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG4_RDHIGH</name>
              <description>CS3n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16CFG4_WRHIGH</name>
              <description>CS3n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB8CFG4</name>
          <displayName>EPI_HB8CFG4</displayName>
          <description>EPI Host-Bus 8 Configuration 4</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8CFG4_MODE</name>
              <description>CS3n Host Bus Sub-Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_MODE_ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_MODE_AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG4_RDWS</name>
              <description>CS3n Read Wait States</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG4_WRWS</name>
              <description>CS3n Write Wait States</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG4_ALEHIGH</name>
              <description>CS3n ALE Strobe Polarity</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG4_RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8CFG4_WRHIGH</name>
              <description>CS3n WRITE Strobe Polarity</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
