m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EPI_HB8TIME</name>
          <displayName>EPI_HB8TIME</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8TIME_RDWSM</name>
              <description>Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME_WRWSM</name>
              <description>Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME_CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME_IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16TIME</name>
          <displayName>EPI_HB16TIME</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16TIME_RDWSM</name>
              <description>Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME_WRWSM</name>
              <description>Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME_CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x00030000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x00050000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x00070000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME_IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB8TIME2</name>
          <displayName>EPI_HB8TIME2</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8TIME2_RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME2_WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME2_CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME2_IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16TIME2</name>
          <displayName>EPI_HB16TIME2</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16TIME2_RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME2_WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME2_CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME2_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x00030000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x00050000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x00070000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME2_IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16TIME3</name>
          <displayName>EPI_HB16TIME3</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16TIME3_RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME3_WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME3_CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME3_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x00030000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x00050000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x00070000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME3_IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB8TIME3</name>
          <displayName>EPI_HB8TIME3</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8TIME3_RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME3_WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME3_CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME3_IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB8TIME4</name>
          <displayName>EPI_HB8TIME4</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB8TIME4_RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME4_WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME4_CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB8TIME4_IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HB16TIME4</name>
          <displayName>EPI_HB16TIME4</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HB16TIME4_RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME4_WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME4_CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPI_HB16TIME4_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x00030000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x00050000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x00070000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME4_IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPI_HBPSRAM</name>
          <displayName>EPI_HBPSRAM</displayName>
          <description>EPI Host-Bus PSRAM</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPI_HBPSRAM_CR</name>
              <description>PSRAM Config Register</description>
              <lsb>0</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
