m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER6</name>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/timer.xml -->
    <peripheral derivedFrom="TIMER0">
      <name>TIMER7</name>
      <baseAddress>0x400E1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1294ncpdt/emac.xml -->
    <peripheral>
      <name>EMAC0</name>
      <description>EMAC register offsets</description>
      <baseAddress>0x400EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>EMAC_CFG</name>
          <displayName>EMAC_CFG</displayName>
          <description>Ethernet MAC Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_CFG_PRELEN</name>
              <description>Preamble Length for Transmit Frames</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CFG_PRELEN_7</name>
                  <description>7 bytes of preamble</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_PRELEN_5</name>
                  <description>5 bytes of preamble</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_PRELEN_3</name>
                  <description>3 bytes of preamble</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CFG_RE</name>
              <description>Receiver Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_TE</name>
              <description>Transmitter Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_DC</name>
              <description>Deferral Check</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_BL</name>
              <description>Back-Off Limit</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_1024</name>
                  <description>k = min (n,10)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_256</name>
                  <description>k = min (n,8)</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_8</name>
                  <description>k = min (n,4)</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_BL_2</name>
                  <description>k = min (n,1)</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CFG_ACS</name>
              <description>Automatic Pad or CRC Stripping</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_DR</name>
              <description>Disable Retry</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_IPC</name>
              <description>Checksum Offload</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_DUPM</name>
              <description>Duplex Mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_LOOPBM</name>
              <description>Loopback Mode</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_DRO</name>
              <description>Disable Receive Own</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_FES</name>
              <description>Speed</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_PS</name>
              <description>Port Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_DISCRS</name>
              <description>Disable Carrier Sense During Transmission</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_IFG</name>
              <description>Inter-Frame Gap (IFG)</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_96</name>
                  <description>96 bit times</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_88</name>
                  <description>88 bit times</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_80</name>
                  <description>80 bit times</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_72</name>
                  <description>72 bit times</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_64</name>
                  <description>64 bit times</description>
                  <value>0x00080000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_56</name>
                  <description>56 bit times</description>
                  <value>0x000A0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_48</name>
                  <description>48 bit times</description>
                  <value>0x000C0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CFG_IFG_40</name>
                  <description>40 bit times</description>
                  <value>0x000E0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CFG_JFEN</name>
              <description>Jumbo Frame Enable</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_JD</name>
              <description>Jabber Disable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_WDDIS</name>
              <description>Watchdog Disable</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_CST</name>
              <description>CRC Stripping for Type Frames</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_CFG_TWOKPEN</name>
              <description>IEEE 802</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_FRAMEFLTR</name>
          <displayName>EMAC_FRAMEFLTR</displayName>
          <description>Ethernet MAC Frame Filter</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_FRAMEFLTR_PR</name>
              <description>Promiscuous Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_HUC</name>
              <description>Hash Unicast</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_HMC</name>
              <description>Hash Multicast</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_DAIF</name>
              <description>Destination Address (DA) Inverse Filtering</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_PM</name>
              <description>Pass All Multicast</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_DBF</name>
              <description>Disable Broadcast Frames</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_PCF</name>
              <description>Pass Control Frames</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_ALL</name>
                  <description>The MAC filters all control frames from reaching application</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_PAUSE</name>
                  <description>MAC forwards all control frames except PAUSE control frames to application even if they fail the address filter</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_NONE</name>
                  <description>MAC forwards all control frames to application even if they fail the address Filter</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FRAMEFLTR_PCF_ADDR</name>
                  <description>MAC forwards control frames that pass the address Filter</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_SAIF</name>
              <description>Source Address (SA) Inverse Filtering</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_SAF</name>
              <description>Source Address Filter Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_HPF</name>
              <description>Hash or Perfect Filter</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_VTFE</name>
              <description>VLAN Tag Filter Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FRAMEFLTR_RA</name>
              <description>Receive All</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_HASHTBLH</name>
          <displayName>EMAC_HASHTBLH</displayName>
          <description>Ethernet MAC Hash Table High</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_HASHTBLL</name>
          <displayName>EMAC_HASHTBLL</displayName>
          <description>Ethernet MAC Hash Table Low</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_MIIADDR</name>
          <displayName>EMAC_MIIADDR</displayName>
          <description>Ethernet MAC MII Address</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MIIADDR_MIIB</name>
              <description>MII Busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MIIADDR_MIIW</name>
              <description>MII Write</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MIIADDR_CR</name>
              <description>Clock Reference Frequency Selection</description>
              <lsb>2</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_60_100</name>
                  <description>The frequency of the System Clock is 60 to 100 MHz providing a MDIO clock of SYSCLK/42</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_100_150</name>
                  <description>The frequency of the System Clock is 100 to 150 MHz providing a MDIO clock of SYSCLK/62</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_20_35</name>
                  <description>The frequency of the System Clock is 20-35 MHz providing a MDIO clock of System Clock/16</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MIIADDR_CR_35_60</name>
                  <description>The frequency of the System Clock is 35 to 60 MHz providing a MDIO clock of System Clock/26</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_MIIADDR_MII</name>
              <description>MII Register</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MIIADDR_PLA</name>
              <description>Physical Layer Address</description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_MIIDATA</name>
          <displayName>EMAC_MIIDATA</displayName>
          <description>Ethernet MAC MII Data Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MIIDATA_DATA</name>
              <description>MII Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_FLOWCTL</name>
          <displayName>EMAC_FLOWCTL</displayName>
          <description>Ethernet MAC Flow Control</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_FLOWCTL_FCBBPA</name>
              <description>Flow Control Busy or Back-pressure Activate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FLOWCTL_TFE</name>
              <description>Transmit Flow Control Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FLOWCTL_RFE</name>
              <description>Receive Flow Control Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FLOWCTL_UP</name>
              <description>Unicast Pause Frame Detect</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FLOWCTL_DZQP</name>
              <description>Disable Zero-Quanta Pause</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_FLOWCTL_PT</name>
              <description>Pause Time</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_VLANTG</name>
          <displayName>EMAC_VLANTG</displayName>
          <description>Ethernet MAC VLAN Tag</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_VLANTG_VL</name>
              <description>VLAN Tag Identifier for Receive Frames</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_VLANTG_ETV</name>
              <description>Enable 12-Bit VLAN Tag Comparison</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_VLANTG_VTIM</name>
              <description>VLAN Tag Inverse Match Enable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_VLANTG_ESVL</name>
              <description>Enable S-VLAN</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_VLANTG_VTHM</name>
              <description>VLAN Tag Hash Table Match Enable</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
