m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EMAC_STATUS</name>
          <displayName>EMAC_STATUS</displayName>
          <description>Ethernet MAC Status</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_STATUS_RPE</name>
              <description>MAC MII Receive Protocol Engine Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_RFCFC</name>
              <description>MAC Receive Frame Controller FIFO Status</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_RWC</name>
              <description>TX/RX Controller RX FIFO Write Controller Active Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_RRC</name>
              <description>TX/RX Controller Read Controller State</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_IDLE</name>
                  <description>IDLE state</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_STATUS</name>
                  <description>Reading frame data</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_DATA</name>
                  <description>Reading frame status (or timestamp)</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_FLUSH</name>
                  <description>Flushing the frame data and status</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_RXF</name>
              <description>TX/RX Controller RX FIFO Fill-level Status</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_EMPTY</name>
                  <description>RX FIFO Empty</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_BELOW</name>
                  <description>RX FIFO fill level is below the flow-control deactivate threshold</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_ABOVE</name>
                  <description>RX FIFO fill level is above the flow-control activate threshold</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_FULL</name>
                  <description>RX FIFO Full</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_TPE</name>
              <description>MAC MII Transmit Protocol Engine Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_TFC</name>
              <description>MAC Transmit Frame Controller Status</description>
              <lsb>17</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_IDLE</name>
                  <description>IDLE state</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_STATUS</name>
                  <description>Waiting for status of previous frame or IFG or backoff period to be over</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_PAUSE</name>
                  <description>Generating and transmitting a PAUSE control frame (in the full-duplex mode)</description>
                  <value>0x00040000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_INPUT</name>
                  <description>Transferring input frame for transmission</description>
                  <value>0x00060000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_TXPAUSED</name>
              <description>MAC Transmitter PAUSE</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_TRC</name>
              <description>TX/RX Controller's TX FIFO Read Controller Status</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_IDLE</name>
                  <description>IDLE state</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_READ</name>
                  <description>READ state (transferring data to MAC transmitter)</description>
                  <value>0x00100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_WAIT</name>
                  <description>Waiting for TX Status from MAC transmitter</description>
                  <value>0x00200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_WRFLUSH</name>
                  <description>Writing the received TX Status or flushing the TX FIFO</description>
                  <value>0x00300000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_TWC</name>
              <description>TX/RX Controller TX FIFO Write Controller Active Status</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_TXFE</name>
              <description>TX/RX Controller TX FIFO Not Empty Status</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_STATUS_TXFF</name>
              <description>TX/RX Controller TX FIFO Full Status</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_RWUFF</name>
          <displayName>EMAC_RWUFF</displayName>
          <description>Ethernet MAC Remote Wake-Up Frame Filter</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_PMTCTLSTAT</name>
          <displayName>EMAC_PMTCTLSTAT</displayName>
          <description>Ethernet MAC PMT Control and Status Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_PMTCTLSTAT_PWRDWN</name>
              <description>Power Down</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_MGKPKTEN</name>
              <description>Magic Packet Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_WUPFREN</name>
              <description>Wake-Up Frame Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_MGKPRX</name>
              <description>Magic Packet Received</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_WUPRX</name>
              <description>Wake-Up Frame Received</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_GLBLUCAST</name>
              <description>Global Unicast</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_RWKPTR</name>
              <description>Remote Wake-Up FIFO Pointer</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_WUPFRRST</name>
              <description>Wake-Up Frame Filter Register Pointer Reset</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_RIS</name>
          <displayName>EMAC_RIS</displayName>
          <description>Ethernet MAC Raw Interrupt Status</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_RIS_PMT</name>
              <description>PMT Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_RIS_MMC</name>
              <description>MMC Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_RIS_MMCRX</name>
              <description>MMC Receive Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_RIS_MMCTX</name>
              <description>MMC Transmit Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_RIS_TS</name>
              <description>Timestamp Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_IM</name>
          <displayName>EMAC_IM</displayName>
          <description>Ethernet MAC Interrupt Mask</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_IM_PMT</name>
              <description>PMT Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_IM_TSI</name>
              <description>Timestamp Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_ADDR0H</name>
          <displayName>EMAC_ADDR0H</displayName>
          <description>Ethernet MAC Address 0 High</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_ADDR0H_ADDRHI</name>
              <description>MAC Address0 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR0H_AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_ADDR0L</name>
          <displayName>EMAC_ADDR0L</displayName>
          <description>Ethernet MAC Address 0 Low Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_ADDR1H</name>
          <displayName>EMAC_ADDR1H</displayName>
          <description>Ethernet MAC Address 1 High</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_ADDR1H_ADDRHI</name>
              <description>MAC Address1 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR1H_MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR1H_SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR1H_AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_ADDR1L</name>
          <displayName>EMAC_ADDR1L</displayName>
          <description>Ethernet MAC Address 1 Low</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_ADDR2H</name>
          <displayName>EMAC_ADDR2H</displayName>
          <description>Ethernet MAC Address 2 High</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_ADDR2H_ADDRHI</name>
              <description>MAC Address2 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR2H_MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR2H_SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR2H_AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_ADDR2L</name>
          <displayName>EMAC_ADDR2L</displayName>
          <description>Ethernet MAC Address 2 Low</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_ADDR3H</name>
          <displayName>EMAC_ADDR3H</displayName>
          <description>Ethernet MAC Address 3 High</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_ADDR3H_ADDRHI</name>
              <description>MAC Address3 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR3H_MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR3H_SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_ADDR3H_AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_ADDR3L</name>
          <displayName>EMAC_ADDR3L</displayName>
          <description>Ethernet MAC Address 3 Low</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_WDOGTO</name>
          <displayName>EMAC_WDOGTO</displayName>
          <description>Ethernet MAC Watchdog Timeout</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_WDOGTO_WTO</name>
              <description>Watchdog Timeout</description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_WDOGTO_PWE</name>
              <description>Programmable Watchdog Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_MMCCTRL</name>
          <displayName>EMAC_MMCCTRL</displayName>
          <description>Ethernet MAC MMC Control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MMCCTRL_CNTRST</name>
              <description>Counters Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTSTPRO</name>
              <description>Counters Stop Rollover</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCCTRL_RSTONRD</name>
              <description>Reset on Read</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTFREEZ</name>
              <description>MMC Counter Freeze</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTPRST</name>
              <description>Counters Preset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTPRSTLVL</name>
              <description>Full/Half Preset Level Value</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCCTRL_UCDBC</name>
              <description>Update MMC Counters for Dropped Broadcast Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_MMCRXRIS</name>
          <displayName>EMAC_MMCRXRIS</displayName>
          <description>Ethernet MAC MMC Receive Raw Interrupt Status</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MMCRXRIS_GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MMCRXRIS_CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MMCRXRIS_ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MMCRXRIS_UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Status</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
