m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EMAC_MMCTXRIS</name>
          <displayName>EMAC_MMCTXRIS</displayName>
          <description>Ethernet MAC MMC Transmit Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MMCTXRIS_GBF</name>
              <description>MMC Transmit Good Bad Frame Counter Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MMCTXRIS_SCOLLGF</name>
              <description>MMC Transmit Single Collision Good Frame Counter Interrupt Status</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MMCTXRIS_MCOLLGF</name>
              <description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Status</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MMCTXRIS_OCTCNT</name>
              <description>Octet Counter Interrupt Status</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_MMCRXIM</name>
          <displayName>EMAC_MMCRXIM</displayName>
          <description>Ethernet MAC MMC Receive Interrupt Mask</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MMCRXIM_GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCRXIM_CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCRXIM_ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCRXIM_UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Mask</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_MMCTXIM</name>
          <displayName>EMAC_MMCTXIM</displayName>
          <description>Ethernet MAC MMC Transmit Interrupt Mask</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MMCTXIM_GBF</name>
              <description>MMC Transmit Good Bad Frame Counter Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCTXIM_SCOLLGF</name>
              <description>MMC Transmit Single Collision Good Frame Counter Interrupt Mask</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCTXIM_MCOLLGF</name>
              <description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_MMCTXIM_OCTCNT</name>
              <description>MMC Transmit Good Octet Counter Interrupt Mask</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TXCNTGB</name>
          <displayName>EMAC_TXCNTGB</displayName>
          <description>Ethernet MAC Transmit Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_TXCNTSCOL</name>
          <displayName>EMAC_TXCNTSCOL</displayName>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Single Collision</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_TXCNTMCOL</name>
          <displayName>EMAC_TXCNTMCOL</displayName>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Multiple Collisions</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_TXOCTCNTG</name>
          <displayName>EMAC_TXOCTCNTG</displayName>
          <description>Ethernet MAC Transmit Octet Count Good</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_RXCNTGB</name>
          <displayName>EMAC_RXCNTGB</displayName>
          <description>Ethernet MAC Receive Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_RXCNTCRCERR</name>
          <displayName>EMAC_RXCNTCRCERR</displayName>
          <description>Ethernet MAC Receive Frame Count for CRC Error Frames</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_RXCNTALGNERR</name>
          <displayName>EMAC_RXCNTALGNERR</displayName>
          <description>Ethernet MAC Receive Frame Count for Alignment Error Frames</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_RXCNTGUNI</name>
          <displayName>EMAC_RXCNTGUNI</displayName>
          <description>Ethernet MAC Receive Frame Count for Good Unicast Frames</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_VLNINCREP</name>
          <displayName>EMAC_VLNINCREP</displayName>
          <description>Ethernet MAC VLAN Tag Inclusion or Replacement</description>
          <addressOffset>0x00000584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_VLNINCREP_VLT</name>
              <description>VLAN Tag for Transmit Frames</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_VLNINCREP_VLC</name>
              <description>VLAN Tag Control in Transmit Frames</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_NONE</name>
                  <description>No VLAN tag deletion, insertion, or replacement</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_TAGDEL</name>
                  <description>VLAN tag deletion</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_TAGINS</name>
                  <description>VLAN tag insertion</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_TAGREP</name>
                  <description>VLAN tag replacement</description>
                  <value>0x00030000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_VLNINCREP_VLP</name>
              <description>VLAN Priority Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_VLNINCREP_CSVL</name>
              <description>C-VLAN or S-VLAN</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_VLANHASH</name>
          <displayName>EMAC_VLANHASH</displayName>
          <description>Ethernet MAC VLAN Hash Table</description>
          <addressOffset>0x00000588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_VLANHASH_VLHT</name>
              <description>VLAN Hash Table</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TIMSTCTRL</name>
          <displayName>EMAC_TIMSTCTRL</displayName>
          <description>Ethernet MAC Timestamp Control</description>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_TIMSTCTRL_TSEN</name>
              <description>Timestamp Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSFCUPDT</name>
              <description>Timestamp Fine or Coarse Update</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSINIT</name>
              <description>Timestamp Initialize</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSUPDT</name>
              <description>Timestamp Update</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_INTTRIG</name>
              <description>Timestamp Interrupt Trigger Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_ADDREGUP</name>
              <description>Addend Register Update</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_ALLF</name>
              <description>Enable Timestamp For All Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_DGTLBIN</name>
              <description>Timestamp Digital or Binary Rollover Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPVER2</name>
              <description>Enable PTP Packet Processing For Version 2 Format</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPETH</name>
              <description>Enable Processing of PTP Over Ethernet Frames</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPIPV6</name>
              <description>Enable Processing of PTP Frames Sent Over IPv6-UDP</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPIPV4</name>
              <description>Enable Processing of PTP Frames Sent over IPv4-UDP</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSEVNT</name>
              <description>Enable Timestamp Snapshot for Event Messages</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSMAST</name>
              <description>Enable Snapshot for Messages Relevant to Master</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_SELPTP</name>
              <description>Select PTP packets for Taking Snapshots</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPFLTR</name>
              <description>Enable MAC address for PTP Frame Filtering</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_SUBSECINC</name>
          <displayName>EMAC_SUBSECINC</displayName>
          <description>Ethernet MAC Sub-Second Increment</description>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_SUBSECINC_SSINC</name>
              <description>Sub-second Increment Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TIMSEC</name>
          <displayName>EMAC_TIMSEC</displayName>
          <description>Ethernet MAC System Time - Seconds</description>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_TIMNANO</name>
          <displayName>EMAC_TIMNANO</displayName>
          <description>Ethernet MAC System Time - Nanoseconds</description>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_TIMNANO_TSSS</name>
              <description>Timestamp Sub-Seconds</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TIMSECU</name>
          <displayName>EMAC_TIMSECU</displayName>
          <description>Ethernet MAC System Time - Seconds Update</description>
          <addressOffset>0x00000710</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_TIMNANOU</name>
          <displayName>EMAC_TIMNANOU</displayName>
          <description>Ethernet MAC System Time - Nanoseconds Update</description>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_TIMNANOU_TSSS</name>
              <description>Timestamp Sub-Second</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TIMNANOU_ADDSUB</name>
              <description>Add or subtract time</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TIMADD</name>
          <displayName>EMAC_TIMADD</displayName>
          <description>Ethernet MAC Timestamp Addend</description>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_TARGSEC</name>
          <displayName>EMAC_TARGSEC</displayName>
          <description>Ethernet MAC Target Time Seconds</description>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_TARGNANO</name>
          <displayName>EMAC_TARGNANO</displayName>
          <description>Ethernet MAC Target Time Nanoseconds</description>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_TARGNANO_TTSLO</name>
              <description>Target Timestamp Low Register</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_TARGNANO_TRGTBUSY</name>
              <description>Target Time Register Busy</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_HWORDSEC</name>
          <displayName>EMAC_HWORDSEC</displayName>
          <description>Ethernet MAC System Time-Higher Word Seconds</description>
          <addressOffset>0x00000724</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_HWORDSEC_TSHWR</name>
              <description>Target Timestamp Higher Word Register</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TIMSTAT</name>
          <displayName>EMAC_TIMSTAT</displayName>
          <description>Ethernet MAC Timestamp Status</description>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_TIMSTAT_TSSOVF</name>
              <description>Timestamp Seconds Overflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_TIMSTAT_TSTARGT</name>
              <description>Timestamp Target Time Reached</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_PPSCTRL</name>
          <displayName>EMAC_PPSCTRL</displayName>
          <description>Ethernet MAC PPS Control</description>
          <addressOffset>0x0000072C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_PPSCTRL_PPSCTRL</name>
              <description>EN0PPS Output Frequency Control (PPSCTRL) or Command Control (PPSCMD)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PPSCTRL_PPSEN0</name>
              <description>Flexible PPS Output Mode Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PPSCTRL_TRGMODS0</name>
              <description>Target Time Register Mode for PPS0 Output</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_INTONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for generating the interrupt event</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_INTPPS0</name>
                  <description>Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the EN0PPS output signal</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_PPS0ONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for starting or stopping the generation of the EN0PPS output signal. No interrupt is asserted</description>
                  <value>0x00000060</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_PPS0INTVL</name>
          <displayName>EMAC_PPS0INTVL</displayName>
          <description>Ethernet MAC PPS0 Interval</description>
          <addressOffset>0x00000760</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EMAC_PPS0WIDTH</name>
          <displayName>EMAC_PPS0WIDTH</displayName>
          <description>Ethernet MAC PPS0 Width</description>
          <addressOffset>0x00000764</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
