m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EMAC_DMABUSMOD</name>
          <displayName>EMAC_DMABUSMOD</displayName>
          <description>Ethernet MAC DMA Bus Mode</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_DMABUSMOD_SWR</name>
              <description>DMA Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_DA</name>
              <description>DMA Arbitration Scheme</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_DSL</name>
              <description>Descriptor Skip Length</description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_ATDS</name>
              <description>Alternate Descriptor Size</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_PBL</name>
              <description>Programmable Burst Length</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_PR</name>
              <description>Priority Ratio</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_FB</name>
              <description>Fixed Burst</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_RPBL</name>
              <description>RX DMA Programmable Burst Length (PBL)</description>
              <lsb>17</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_USP</name>
              <description>Use Separate Programmable Burst Length (PBL)</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_8XPBL</name>
              <description>8 x Programmable Burst Length (PBL) Mode</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_AAL</name>
              <description>Address Aligned Beats</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_MB</name>
              <description>Mixed Burst</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_TXPR</name>
              <description>Transmit Priority</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_RIB</name>
              <description>Rebuild Burst</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TXPOLLD</name>
          <displayName>EMAC_TXPOLLD</displayName>
          <description>Ethernet MAC Transmit Poll Demand</description>
          <addressOffset>0x00000C04</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>EMAC_RXPOLLD</name>
          <displayName>EMAC_RXPOLLD</displayName>
          <description>Ethernet MAC Receive Poll Demand</description>
          <addressOffset>0x00000C08</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>EMAC_RXDLADDR</name>
          <displayName>EMAC_RXDLADDR</displayName>
          <description>Ethernet MAC Receive Descriptor List Address</description>
          <addressOffset>0x00000C0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_RXDLADDR_STRXLIST</name>
              <description>Start of Receive List</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_TXDLADDR</name>
          <displayName>EMAC_TXDLADDR</displayName>
          <description>Ethernet MAC Transmit Descriptor List Address</description>
          <addressOffset>0x00000C10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_TXDLADDR_TXDLADDR</name>
              <description>Start of Transmit List Base Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_DMARIS</name>
          <displayName>EMAC_DMARIS</displayName>
          <description>Ethernet MAC DMA Interrupt Status</description>
          <addressOffset>0x00000C14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_DMARIS_TI</name>
              <description>Transmit Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_TPS</name>
              <description>Transmit Process Stopped</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_TU</name>
              <description>Transmit Buffer Unavailable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_TJT</name>
              <description>Transmit Jabber Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_OVF</name>
              <description>Receive Overflow</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_UNF</name>
              <description>Transmit Underflow</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_RI</name>
              <description>Receive Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_RU</name>
              <description>Receive Buffer Unavailable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_RPS</name>
              <description>Receive Process Stopped</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_RWT</name>
              <description>Receive Watchdog Timeout</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_ETI</name>
              <description>Early Transmit Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_FBI</name>
              <description>Fatal Bus Error Interrupt</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_ERI</name>
              <description>Early Receive Interrupt</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_NIS</name>
              <description>Normal Interrupt Summary</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_RS</name>
              <description>Received Process State</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_STOP</name>
                  <description>Stopped: Reset or stop receive command issued</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNRXTD</name>
                  <description>Running: Fetching receive transfer descriptor</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNRXD</name>
                  <description>Running: Waiting for receive packet</description>
                  <value>0x00060000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_SUSPEND</name>
                  <description>Suspended: Receive descriptor unavailable</description>
                  <value>0x00080000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNCRD</name>
                  <description>Running: Closing receive descriptor</description>
                  <value>0x000A0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_TSWS</name>
                  <description>Writing Timestamp</description>
                  <value>0x000C0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNTXD</name>
                  <description>Running: Transferring the receive packet data from receive buffer to host memory</description>
                  <value>0x000E0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_TS</name>
              <description>Transmit Process State</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_STOP</name>
                  <description>Stopped; Reset or Stop transmit command processed</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNTXTD</name>
                  <description>Running; Fetching transmit transfer descriptor</description>
                  <value>0x00100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_STATUS</name>
                  <description>Running; Waiting for status</description>
                  <value>0x00200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNTX</name>
                  <description>Running; Reading data from host memory buffer and queuing it to transmit buffer (TX FIFO)</description>
                  <value>0x00300000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_TSTAMP</name>
                  <description>Writing Timestamp</description>
                  <value>0x00400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_SUSPEND</name>
                  <description>Suspended; Transmit descriptor unavailable or transmit buffer underflow</description>
                  <value>0x00600000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNCTD</name>
                  <description>Running; Closing transmit descriptor</description>
                  <value>0x00700000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_AE</name>
              <description>Access Error</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMAWD</name>
                  <description>Error during RX DMA Write Data Transfer</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMARD</name>
                  <description>Error during TX DMA Read Data Transfer</description>
                  <value>0x01800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMADW</name>
                  <description>Error during RX DMA Descriptor Write Access</description>
                  <value>0x02000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMADW</name>
                  <description>Error during TX DMA Descriptor Write Access</description>
                  <value>0x02800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMADR</name>
                  <description>Error during RX DMA Descriptor Read Access</description>
                  <value>0x03000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMADR</name>
                  <description>Error during TX DMA Descriptor Read Access</description>
                  <value>0x03800000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_MMC</name>
              <description>MAC MMC Interrupt</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_PMT</name>
              <description>MAC PMT Interrupt Status</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMARIS_TT</name>
              <description>Timestamp Trigger Interrupt Status</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_DMAOPMODE</name>
          <displayName>EMAC_DMAOPMODE</displayName>
          <description>Ethernet MAC DMA Operation Mode</description>
          <addressOffset>0x00000C18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_DMAOPMODE_SR</name>
              <description>Start or Stop Receive</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_OSF</name>
              <description>Operate on Second Frame</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_RTC</name>
              <description>Receive Threshold Control</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_64</name>
                  <description>64 bytes</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_32</name>
                  <description>32 bytes</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_96</name>
                  <description>96 bytes</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_128</name>
                  <description>128 bytes</description>
                  <value>0x00000018</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DGF</name>
              <description>Drop Giant Frame Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FUF</name>
              <description>Forward Undersized Good Frames</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FEF</name>
              <description>Forward Error Frames</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_ST</name>
              <description>Start or Stop Transmission Command</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_TTC</name>
              <description>Transmit Threshold Control</description>
              <lsb>14</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_64</name>
                  <description>64 bytes</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_128</name>
                  <description>128 bytes</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_192</name>
                  <description>192 bytes</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_256</name>
                  <description>256 bytes</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_40</name>
                  <description>40 bytes</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_32</name>
                  <description>32 bytes</description>
                  <value>0x00014000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_24</name>
                  <description>24 bytes</description>
                  <value>0x00018000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_16</name>
                  <description>16 bytes</description>
                  <value>0x0001C000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FTF</name>
              <description>Flush Transmit FIFO</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_TSF</name>
              <description>Transmit Store and Forward</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DFF</name>
              <description>Disable Flushing of Received Frames</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_RSF</name>
              <description>Receive Store and Forward</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DT</name>
              <description>Disable Dropping of TCP/IP Checksum Error Frames</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
