m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>EMAC_DMAIM</name>
          <displayName>EMAC_DMAIM</displayName>
          <description>Ethernet MAC DMA Interrupt Mask Register</description>
          <addressOffset>0x00000C1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_DMAIM_TIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_TSE</name>
              <description>Transmit Stopped Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_TUE</name>
              <description>Transmit Buffer Unvailable Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_TJE</name>
              <description>Transmit Jabber Timeout Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_OVE</name>
              <description>Overflow Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_UNE</name>
              <description>Underflow Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_RIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_RUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_RSE</name>
              <description>Receive Stopped Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_RWE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_ETE</name>
              <description>Early Transmit Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_FBE</name>
              <description>Fatal Bus Error Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_ERE</name>
              <description>Early Receive Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_DMAIM_NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_MFBOC</name>
          <displayName>EMAC_MFBOC</displayName>
          <description>Ethernet MAC Missed Frame and Buffer Overflow Counter</description>
          <addressOffset>0x00000C20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_MFBOC_MISFRMCNT</name>
              <description>Missed Frame Counter</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MFBOC_MISCNTOVF</name>
              <description>Overflow bit for Missed Frame Counter</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MFBOC_OVFFRMCNT</name>
              <description>Overflow Frame Counter</description>
              <lsb>17</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_MFBOC_OVFCNTOVF</name>
              <description>Overflow Bit for FIFO Overflow Counter</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_RXINTWDT</name>
          <displayName>EMAC_RXINTWDT</displayName>
          <description>Ethernet MAC Receive Interrupt Watchdog Timer</description>
          <addressOffset>0x00000C24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_RXINTWDT_RIWT</name>
              <description>Receive Interrupt Watchdog Timer Count</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_HOSTXDESC</name>
          <displayName>EMAC_HOSTXDESC</displayName>
          <description>Ethernet MAC Current Host Transmit Descriptor</description>
          <addressOffset>0x00000C48</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_HOSRXDESC</name>
          <displayName>EMAC_HOSRXDESC</displayName>
          <description>Ethernet MAC Current Host Receive Descriptor</description>
          <addressOffset>0x00000C4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_HOSTXBA</name>
          <displayName>EMAC_HOSTXBA</displayName>
          <description>Ethernet MAC Current Host Transmit Buffer Address</description>
          <addressOffset>0x00000C50</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_HOSRXBA</name>
          <displayName>EMAC_HOSRXBA</displayName>
          <description>Ethernet MAC Current Host Receive Buffer Address</description>
          <addressOffset>0x00000C54</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>EMAC_PP</name>
          <displayName>EMAC_PP</displayName>
          <description>Ethernet MAC Peripheral Property Register</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_PP_PHYTYPE</name>
              <description>Ethernet PHY Type</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PP_PHYTYPE_NONE</name>
                  <description>No PHY</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PP_PHYTYPE_1</name>
                  <description>Snowflake class PHY</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PP_MACTYPE</name>
              <description>Ethernet MAC Type</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_PC</name>
          <displayName>EMAC_PC</displayName>
          <description>Ethernet MAC Peripheral Configuration Register</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_PC_PHYHOLD</name>
              <description>Ethernet PHY Hold</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_ANMODE</name>
              <description>Auto Negotiation Mode</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_10HD</name>
                  <description>When ANEN = 0x0, the mode is 10Base-T, Half-Duplex</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_10FD</name>
                  <description>When ANEN = 0x0, the mode is 10Base-T, Full-Duplex</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_100HD</name>
                  <description>When ANEN = 0x0, the mode is 100Base-TX, Half-Duplex</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_100FD</name>
                  <description>When ANEN = 0x0, the mode is 100Base-TX, Full-Duplex</description>
                  <value>0x00000006</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PC_ANEN</name>
              <description>Auto Negotiation Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_FASTANSEL</name>
              <description>Fast Auto Negotiation Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_FASTANEN</name>
              <description>Fast Auto Negotiation Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_EXTFD</name>
              <description>Extended Full Duplex Ability</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_FASTLUPD</name>
              <description>FAST Link-Up in Parallel Detect</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_FASTRXDV</name>
              <description>Fast RXDV Detection</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_MDIXEN</name>
              <description>MDIX Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_FASTMDIX</name>
              <description>Fast Auto MDI-X</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_RBSTMDIX</name>
              <description>Robust Auto MDI-X</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_MDISWAP</name>
              <description>MDI Swap</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_POLSWAP</name>
              <description>Polarity Swap</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_FASTLDMODE</name>
              <description>Fast Link Down Mode</description>
              <lsb>15</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_TDRRUN</name>
              <description>TDR Auto Run</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_LRR</name>
              <description>Link Loss Recovery</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_ISOMIILL</name>
              <description>Isolate MII in Link Loss</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_RXERIDLE</name>
              <description>RXER Detection During Idle</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_NIBDETDIS</name>
              <description>Odd Nibble TXER Detection Disable</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_DIGRESTART</name>
              <description>PHY Soft Restart</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PC_PINTFS</name>
              <description>Ethernet Interface Select</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PC_PINTFS_IMII</name>
                  <description>MII (default) Used for internal PHY or external PHY connected via MII</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_PINTFS_RMII</name>
                  <description>RMII: Used for external PHY connected via RMII</description>
                  <value>0x40000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PC_PHYEXT</name>
              <description>PHY Select</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_CC</name>
          <displayName>EMAC_CC</displayName>
          <description>Ethernet MAC Clock Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_CC_POL</name>
              <description>LED Polarity Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMAC_CC_PTPCEN</name>
              <description>PTP Clock Reference Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_EPHYRIS</name>
          <displayName>EMAC_EPHYRIS</displayName>
          <description>Ethernet PHY Raw Interrupt Status</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_EPHYRIS_INT</name>
              <description>Ethernet PHY Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_EPHYIM</name>
          <displayName>EMAC_EPHYIM</displayName>
          <description>Ethernet PHY Interrupt Mask</description>
          <addressOffset>0x00000FD4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_EPHYIM_INT</name>
              <description>Ethernet PHY Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC_EPHYMISC</name>
          <displayName>EMAC_EPHYMISC</displayName>
          <description>Ethernet PHY Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000FD8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMAC_EPHYMISC_INT</name>
              <description>Ethernet PHY Status and Clear register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
