m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4c1290kcpdt/hib.xml -->
    <peripheral>
      <name>HIB</name>
      <description>Hibernation module register addresses</description>
      <baseAddress>0x400FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>HIB_RTCC</name>
          <displayName>HIB_RTCC</displayName>
          <description>Hibernation RTC Counter</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>HIB_RTCM0</name>
          <displayName>HIB_RTCM0</displayName>
          <description>Hibernation RTC Match 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HIB_RTCLD</name>
          <displayName>HIB_RTCLD</displayName>
          <description>Hibernation RTC Load</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HIB_CTL</name>
          <displayName>HIB_CTL</displayName>
          <description>Hibernation Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CTL_RTCEN</name>
              <description>RTC Timer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_HIBREQ</name>
              <description>Hibernation Request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_RTCWEN</name>
              <description>RTC Wake-up Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_PINWEN</name>
              <description>External Wake Pin Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_CLK32EN</name>
              <description>Clocking Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_VABORT</name>
              <description>Power Cut Abort Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_VDD3ON</name>
              <description>VDD Powered</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_BATWKEN</name>
              <description>Wake on Low Battery</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_BATCHK</name>
              <description>Check Battery Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_VBATSEL</name>
              <description>Select for Low-Battery Comparator</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_1_9V</name>
                  <description>1.9 Volts</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_1V</name>
                  <description>2.1 Volts (default)</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_3V</name>
                  <description>2.3 Volts</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_5V</name>
                  <description>2.5 Volts</description>
                  <value>0x00006000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIB_CTL_OSCBYP</name>
              <description>Oscillator Bypass</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_OSCDRV</name>
              <description>Oscillator Drive Capability</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_OSCSEL</name>
              <description>Oscillator Select</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_RETCLR</name>
              <description>GPIO Retention/Clear</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CTL_WRC</name>
              <description>Write Complete/Capable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_IM</name>
          <displayName>HIB_IM</displayName>
          <description>Hibernation Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_IM_RTCALT0</name>
              <description>RTC Alert 0 Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IM_LOWBAT</name>
              <description>Low Battery Voltage Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IM_EXTW</name>
              <description>External Wake-Up Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IM_WC</name>
              <description>External Write Complete/Capable Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IM_PADIOWK</name>
              <description>Pad I/O Wake-Up Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IM_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IM_VDDFAIL</name>
              <description>VDD Fail Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_RIS</name>
          <displayName>HIB_RIS</displayName>
          <description>Hibernation Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_RIS_RTCALT0</name>
              <description>RTC Alert 0 Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_RIS_LOWBAT</name>
              <description>Low Battery Voltage Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_RIS_EXTW</name>
              <description>External Wake-Up Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_RIS_WC</name>
              <description>Write Complete/Capable Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_RIS_PADIOWK</name>
              <description>Pad I/O Wake-Up Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_RIS_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_RIS_VDDFAIL</name>
              <description>VDD Fail Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_MIS</name>
          <displayName>HIB_MIS</displayName>
          <description>Hibernation Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_MIS_RTCALT0</name>
              <description>RTC Alert 0 Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_MIS_LOWBAT</name>
              <description>Low Battery Voltage Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_MIS_EXTW</name>
              <description>External Wake-Up Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_MIS_WC</name>
              <description>Write Complete/Capable Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_MIS_PADIOWK</name>
              <description>Pad I/O Wake-Up Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_MIS_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_MIS_VDDFAIL</name>
              <description>VDD Fail Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_IC</name>
          <displayName>HIB_IC</displayName>
          <description>Hibernation Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_IC_RTCALT0</name>
              <description>RTC Alert0 Masked Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IC_LOWBAT</name>
              <description>Low Battery Voltage Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IC_EXTW</name>
              <description>External Wake-Up Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IC_WC</name>
              <description>Write Complete/Capable Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IC_PADIOWK</name>
              <description>Pad I/O Wake-Up Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IC_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Interrupt Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IC_VDDFAIL</name>
              <description>VDD Fail Interrupt Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_RTCT</name>
          <displayName>HIB_RTCT</displayName>
          <description>Hibernation RTC Trim</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_RTCT_TRIM</name>
              <description>RTC Trim Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_RTCSS</name>
          <displayName>HIB_RTCSS</displayName>
          <description>Hibernation RTC Sub Seconds</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_RTCSS_RTCSSC</name>
              <description>RTC Sub Seconds Count</description>
              <lsb>0</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_RTCSS_RTCSSM</name>
              <description>RTC Sub Seconds Match</description>
              <lsb>16</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_IO</name>
          <displayName>HIB_IO</displayName>
          <description>Hibernation IO Configuration</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_IO_WUUNLK</name>
              <description>I/O Wake Pad Configuration Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IO_WURSTEN</name>
              <description>Reset Wake Source Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_IO_IOWRC</name>
              <description>I/O Write Complete</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_DATA</name>
          <displayName>HIB_DATA</displayName>
          <description>Hibernation Data</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HIB_CALCTL</name>
          <displayName>HIB_CALCTL</displayName>
          <description>Hibernation Calendar Control</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CALCTL_CALEN</name>
              <description>RTC Calendar/Counter Mode Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CALCTL_CAL24</name>
              <description>Calendar Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_CAL0</name>
          <displayName>HIB_CAL0</displayName>
          <description>Hibernation Calendar 0</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CAL0_SEC</name>
              <description>Seconds</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL0_MIN</name>
              <description>Minutes</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL0_HR</name>
              <description>Hours</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL0_AMPM</name>
              <description>AM/PM Designation</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL0_VALID</name>
              <description>Valid Calendar Load</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_CAL1</name>
          <displayName>HIB_CAL1</displayName>
          <description>Hibernation Calendar 1</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CAL1_DOM</name>
              <description>Day of Month</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL1_MON</name>
              <description>Month</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL1_YEAR</name>
              <description>Year Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL1_DOW</name>
              <description>Day of Week</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_CAL1_VALID</name>
              <description>Valid Calendar Load</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_CALLD0</name>
          <displayName>HIB_CALLD0</displayName>
          <description>Hibernation Calendar Load 0</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CALLD0_SEC</name>
              <description>Seconds</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD0_MIN</name>
              <description>Minutes</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD0_HR</name>
              <description>Hours</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD0_AMPM</name>
              <description>AM/PM Designation</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_CALLD1</name>
          <displayName>HIB_CALLD1</displayName>
          <description>Hibernation Calendar Load</description>
          <addressOffset>0x00000324</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CALLD1_DOM</name>
              <description>Day of Month</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD1_MON</name>
              <description>Month</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD1_YEAR</name>
              <description>Year Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD1_DOW</name>
              <description>Day of Week</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
