m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>HIB_CALM0</name>
          <displayName>HIB_CALM0</displayName>
          <description>Hibernation Calendar Match 0</description>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CALM0_SEC</name>
              <description>Seconds</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CALM0_MIN</name>
              <description>Minutes</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CALM0_HR</name>
              <description>Hours</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_CALM0_AMPM</name>
              <description>AM/PM Designation</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_CALM1</name>
          <displayName>HIB_CALM1</displayName>
          <description>Hibernation Calendar Match 1</description>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CALM1_DOM</name>
              <description>Day of Month</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_LOCK</name>
          <displayName>HIB_LOCK</displayName>
          <description>Hibernation Lock</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HIB_TPCTL</name>
          <displayName>HIB_TPCTL</displayName>
          <description>HIB Tamper Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPCTL_TPEN</name>
              <description>Tamper Module Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPCTL_TPCLR</name>
              <description>Tamper Event Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPCTL_MEMCLR</name>
              <description>HIB Memory Clear on Tamper Event</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_NONE</name>
                  <description>Do not Clear HIB memory on tamper event</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_LOW32</name>
                  <description>Clear Lower 32 Bytes of HIB memory on tamper event</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_HIGH32</name>
                  <description>Clear upper 32 Bytes of HIB memory on tamper event</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_ALL</name>
                  <description>Clear all HIB memory on tamper event</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIB_TPCTL_WAKE</name>
              <description>Wake from Hibernate on a Tamper Event</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_TPSTAT</name>
          <displayName>HIB_TPSTAT</displayName>
          <description>HIB Tamper Status</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPSTAT_XOSCFAIL</name>
              <description>External Oscillator Failure</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPSTAT_XOSCST</name>
              <description>External Oscillator Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPSTAT_STATE</name>
              <description>Tamper Module Status</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_TPSTAT_STATE_DISABLED</name>
                  <description>Tamper disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPSTAT_STATE_CONFIGED</name>
                  <description>Tamper configured</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPSTAT_STATE_ERROR</name>
                  <description>Tamper pin event occurred</description>
                  <value>0x00000008</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_TPIO</name>
          <displayName>HIB_TPIO</displayName>
          <description>HIB Tamper I/O Control</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPIO_EN0</name>
              <description>TMPR0 Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_LEV0</name>
              <description>TMPR0 Trigger Level</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_PUEN0</name>
              <description>TMPR0 Internal Weak Pull-up Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR0</name>
              <description>TMPR0 Glitch Filtering</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_EN1</name>
              <description>TMPR1Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_LEV1</name>
              <description>TMPR1 Trigger Level</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_PUEN1</name>
              <description>TMPR1 Internal Weak Pull-up Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR1</name>
              <description>TMPR1 Glitch Filtering</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_EN2</name>
              <description>TMPR2 Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_LEV2</name>
              <description>TMPR2 Trigger Level</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_PUEN2</name>
              <description>TMPR2 Internal Weak Pull-up Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR2</name>
              <description>TMPR2 Glitch Filtering</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_EN3</name>
              <description>TMPR3 Enable</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_LEV3</name>
              <description>TMPR3 Trigger Level</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_PUEN3</name>
              <description>TMPR3 Internal Weak Pull-up Enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR3</name>
              <description>TMPR3 Glitch Filtering</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_TPLOG0</name>
          <displayName>HIB_TPLOG0</displayName>
          <description>HIB Tamper Log 0</description>
          <addressOffset>0x000004E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>HIB_TPLOG1</name>
          <displayName>HIB_TPLOG1</displayName>
          <description>HIB Tamper Log 1</description>
          <addressOffset>0x000004E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPLOG1_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG1_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG1_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG1_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG1_XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_TPLOG2</name>
          <displayName>HIB_TPLOG2</displayName>
          <description>HIB Tamper Log 2</description>
          <addressOffset>0x000004E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>HIB_TPLOG3</name>
          <displayName>HIB_TPLOG3</displayName>
          <description>HIB Tamper Log 3</description>
          <addressOffset>0x000004EC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPLOG3_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG3_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG3_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG3_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG3_XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_TPLOG4</name>
          <displayName>HIB_TPLOG4</displayName>
          <description>HIB Tamper Log 4</description>
          <addressOffset>0x000004F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>HIB_TPLOG5</name>
          <displayName>HIB_TPLOG5</displayName>
          <description>HIB Tamper Log 5</description>
          <addressOffset>0x000004F4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPLOG5_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG5_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG5_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG5_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG5_XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_TPLOG6</name>
          <displayName>HIB_TPLOG6</displayName>
          <description>HIB Tamper Log 6</description>
          <addressOffset>0x000004F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>HIB_TPLOG7</name>
          <displayName>HIB_TPLOG7</displayName>
          <description>HIB Tamper Log 7</description>
          <addressOffset>0x000004FC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_TPLOG7_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG7_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG7_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG7_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_TPLOG7_XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_PP</name>
          <displayName>HIB_PP</displayName>
          <description>Hibernation Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_PP_WAKENC</name>
              <description>Wake Pin Presence</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB_PP_TAMPER</name>
              <description>Tamper Pin Presence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_CC</name>
          <displayName>HIB_CC</displayName>
          <description>Hibernation Clock Control</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIB_CC_SYSCLKEN</name>
              <description>RTCOSC to System Clock Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
