m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/flash.xml -->
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>FLASH register offsets</description>
      <baseAddress>0x400FD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>FLASH_FMA</name>
          <displayName>FLASH_FMA</displayName>
          <description>Flash Memory Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FMA_OFFSET</name>
              <description>Address Offset</description>
              <lsb>0</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FMD</name>
          <displayName>FLASH_FMD</displayName>
          <description>Flash Memory Data</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMC</name>
          <displayName>FLASH_FMC</displayName>
          <description>Flash Memory Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FMC_WRITE</name>
              <description>Write a Word into Flash Memory</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FMC_ERASE</name>
              <description>Erase a Page of Flash Memory</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FMC_MERASE</name>
              <description>Mass Erase Flash Memory</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FMC_COMT</name>
              <description>Commit Register Value</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FMC_WRKEY</name>
              <description>FLASH write key</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FCRIS</name>
          <displayName>FLASH_FCRIS</displayName>
          <description>Flash Controller Raw Interrupt Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FCRIS_ARIS</name>
              <description>Access Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FCRIS_PRIS</name>
              <description>Programming Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FCRIS_ERIS</name>
              <description>EEPROM Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FCRIS_VOLTRIS</name>
              <description>Pump Voltage Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FCRIS_INVDRIS</name>
              <description>Invalid Data Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FCRIS_ERRIS</name>
              <description>Erase Verify Error Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_FCRIS_PROGRIS</name>
              <description>Program Verify Error Raw Interrupt Status</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FCIM</name>
          <displayName>FLASH_FCIM</displayName>
          <description>Flash Controller Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FCIM_AMASK</name>
              <description>Access Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCIM_PMASK</name>
              <description>Programming Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCIM_EMASK</name>
              <description>EEPROM Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCIM_VOLTMASK</name>
              <description>VOLT Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCIM_INVDMASK</name>
              <description>Invalid Data Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCIM_ERMASK</name>
              <description>ERVER Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCIM_PROGMASK</name>
              <description>PROGVER Interrupt Mask</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FCMISC</name>
          <displayName>FLASH_FCMISC</displayName>
          <description>Flash Controller Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FCMISC_AMISC</name>
              <description>Access Masked Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCMISC_PMISC</name>
              <description>Programming Masked Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCMISC_EMISC</name>
              <description>EEPROM Masked Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCMISC_VOLTMISC</name>
              <description>VOLT Masked Interrupt Status and Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCMISC_INVDMISC</name>
              <description>Invalid Data Masked Interrupt Status and Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCMISC_ERMISC</name>
              <description>ERVER Masked Interrupt Status and Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_FCMISC_PROGMISC</name>
              <description>PROGVER Masked Interrupt Status and Clear</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FMC2</name>
          <displayName>FLASH_FMC2</displayName>
          <description>Flash Memory Control 2</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FMC2_WRBUF</name>
              <description>Buffered Flash Memory Write</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FWBVAL</name>
          <displayName>FLASH_FWBVAL</displayName>
          <description>Flash Write Buffer Valid</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FLPEKEY</name>
          <displayName>FLASH_FLPEKEY</displayName>
          <description>Flash Program/Erase Key</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FLPEKEY_PEKEY</name>
              <description>Key Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_FWBN</name>
          <displayName>FLASH_FWBN</displayName>
          <description>Flash Write Buffer n</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_PP</name>
          <displayName>FLASH_PP</displayName>
          <description>Flash Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_PP_SIZE</name>
              <description>Flash Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_PP_SIZE_1MB</name>
                  <description>1024 KB of Flash</description>
                  <value>0x000001FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PP_MAINSS</name>
              <description>Flash Sector Size of the physical bank</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_1KB</name>
                  <description>1 KB</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_2KB</name>
                  <description>2 KB</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_4KB</name>
                  <description>4 KB</description>
                  <value>0x00020000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_8KB</name>
                  <description>8 KB</description>
                  <value>0x00030000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_16KB</name>
                  <description>16 KB</description>
                  <value>0x00040000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PP_EESS</name>
              <description>EEPROM Sector Size of the physical bank</description>
              <lsb>19</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_1KB</name>
                  <description>1 KB</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_2KB</name>
                  <description>2 KB</description>
                  <value>0x00080000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_4KB</name>
                  <description>4 KB</description>
                  <value>0x00100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_8KB</name>
                  <description>8 KB</description>
                  <value>0x00180000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PP_DFA</name>
              <description>DMA Flash Access</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_PP_FMM</name>
              <description>Flash Mirror Mode</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_PP_PFC</name>
              <description>Prefetch Buffer Mode</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SSIZE</name>
          <displayName>FLASH_SSIZE</displayName>
          <description>SRAM Size</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_SSIZE_SIZE</name>
              <description>SRAM Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_SSIZE_SIZE_256KB</name>
                  <description>256 KB of SRAM</description>
                  <value>0x000003FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_CONF</name>
          <displayName>FLASH_CONF</displayName>
          <description>Flash Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_CONF_FPFOFF</name>
              <description>Force Prefetch Off</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_CONF_FPFON</name>
              <description>Force Prefetch On</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_CONF_CLRTV</name>
              <description>Clear Valid Tags</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_CONF_SPFE</name>
              <description>Single Prefetch Mode Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_CONF_FMME</name>
              <description>Flash Mirror Mode Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
