m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>FLASH_ROMSWMAP</name>
          <displayName>FLASH_ROMSWMAP</displayName>
          <description>ROM Software Map</description>
          <addressOffset>0x00000FCC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_ROMSWMAP_SW0EN</name>
              <description>ROM SW Region 0 Availability</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW0EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW0EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW1EN</name>
              <description>ROM SW Region 1 Availability</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW1EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW1EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW2EN</name>
              <description>ROM SW Region 2 Availability</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW2EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW2EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00000010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW3EN</name>
              <description>ROM SW Region 3 Availability</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW3EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW3EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00000040</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW4EN</name>
              <description>ROM SW Region 4 Availability</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW4EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW4EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00000100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW5EN</name>
              <description>ROM SW Region 5 Availability</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW5EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW5EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00000400</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW6EN</name>
              <description>ROM SW Region 6 Availability</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW6EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW6EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00001000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW7EN</name>
              <description>ROM SW Region 7 Availability</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW7EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW7EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x00004000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_DMASZ</name>
          <displayName>FLASH_DMASZ</displayName>
          <description>Flash DMA Address Size</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_DMASZ_SIZE</name>
              <description>uDMA-accessible Memory Size</description>
              <lsb>0</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_DMAST</name>
          <displayName>FLASH_DMAST</displayName>
          <description>Flash DMA Starting Address</description>
          <addressOffset>0x00000FD4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_DMAST_ADDR</name>
              <description>Contains the starting address of the flash region accessible by uDMA if the FLASHPP register DFA bit is set</description>
              <lsb>11</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_RVP</name>
          <displayName>FLASH_RVP</displayName>
          <description>Reset Vector Pointer</description>
          <addressOffset>0x000010D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_BOOTCFG</name>
          <displayName>FLASH_BOOTCFG</displayName>
          <description>Boot Configuration</description>
          <addressOffset>0x000011D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_BOOTCFG_DBG0</name>
              <description>Debug Control 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_BOOTCFG_DBG1</name>
              <description>Debug Control 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_BOOTCFG_KEY</name>
              <description>KEY Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_BOOTCFG_EN</name>
              <description>Boot GPIO Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_BOOTCFG_POL</name>
              <description>Boot GPIO Polarity</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_BOOTCFG_PIN</name>
              <description>Boot GPIO Pin</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_0</name>
                  <description>Pin 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_1</name>
                  <description>Pin 1</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_2</name>
                  <description>Pin 2</description>
                  <value>0x00000800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_3</name>
                  <description>Pin 3</description>
                  <value>0x00000C00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_4</name>
                  <description>Pin 4</description>
                  <value>0x00001000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_5</name>
                  <description>Pin 5</description>
                  <value>0x00001400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_6</name>
                  <description>Pin 6</description>
                  <value>0x00001800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_7</name>
                  <description>Pin 7</description>
                  <value>0x00001C00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_BOOTCFG_PORT</name>
              <description>Boot GPIO Port</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_A</name>
                  <description>Port A</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_B</name>
                  <description>Port B</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_C</name>
                  <description>Port C</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_D</name>
                  <description>Port D</description>
                  <value>0x00006000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_E</name>
                  <description>Port E</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_F</name>
                  <description>Port F</description>
                  <value>0x0000A000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_G</name>
                  <description>Port G</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_H</name>
                  <description>Port H</description>
                  <value>0x0000E000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_BOOTCFG_NW</name>
              <description>Not Written</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_USERREG0</name>
          <displayName>FLASH_USERREG0</displayName>
          <description>User Register 0</description>
          <addressOffset>0x000011E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_USERREG1</name>
          <displayName>FLASH_USERREG1</displayName>
          <description>User Register 1</description>
          <addressOffset>0x000011E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_USERREG2</name>
          <displayName>FLASH_USERREG2</displayName>
          <description>User Register 2</description>
          <addressOffset>0x000011E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_USERREG3</name>
          <displayName>FLASH_USERREG3</displayName>
          <description>User Register 3</description>
          <addressOffset>0x000011EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE0</name>
          <displayName>FLASH_FMPRE0</displayName>
          <description>Flash Memory Protection Read Enable 0</description>
          <addressOffset>0x00001200</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE1</name>
          <displayName>FLASH_FMPRE1</displayName>
          <description>Flash Memory Protection Read Enable 1</description>
          <addressOffset>0x00001204</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE2</name>
          <displayName>FLASH_FMPRE2</displayName>
          <description>Flash Memory Protection Read Enable 2</description>
          <addressOffset>0x00001208</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE3</name>
          <displayName>FLASH_FMPRE3</displayName>
          <description>Flash Memory Protection Read Enable 3</description>
          <addressOffset>0x0000120C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE4</name>
          <displayName>FLASH_FMPRE4</displayName>
          <description>Flash Memory Protection Read Enable 4</description>
          <addressOffset>0x00001210</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE5</name>
          <displayName>FLASH_FMPRE5</displayName>
          <description>Flash Memory Protection Read Enable 5</description>
          <addressOffset>0x00001214</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE6</name>
          <displayName>FLASH_FMPRE6</displayName>
          <description>Flash Memory Protection Read Enable 6</description>
          <addressOffset>0x00001218</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE7</name>
          <displayName>FLASH_FMPRE7</displayName>
          <description>Flash Memory Protection Read Enable 7</description>
          <addressOffset>0x0000121C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPRE8</name>
          <displayName>FLASH_FMPRE8</displayName>
          <description>Flash Memory Protection Read Enable 8</description>
          <addressOffset>0x00001220</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE9</name>
          <displayName>FLASH_FMPRE9</displayName>
          <description>Flash Memory Protection Read Enable 9</description>
          <addressOffset>0x00001224</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE10</name>
          <displayName>FLASH_FMPRE10</displayName>
          <description>Flash Memory Protection Read Enable 10</description>
          <addressOffset>0x00001228</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE11</name>
          <displayName>FLASH_FMPRE11</displayName>
          <description>Flash Memory Protection Read Enable 11</description>
          <addressOffset>0x0000122C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE12</name>
          <displayName>FLASH_FMPRE12</displayName>
          <description>Flash Memory Protection Read Enable 12</description>
          <addressOffset>0x00001230</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE13</name>
          <displayName>FLASH_FMPRE13</displayName>
          <description>Flash Memory Protection Read Enable 13</description>
          <addressOffset>0x00001234</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE14</name>
          <displayName>FLASH_FMPRE14</displayName>
          <description>Flash Memory Protection Read Enable 14</description>
          <addressOffset>0x00001238</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPRE15</name>
          <displayName>FLASH_FMPRE15</displayName>
          <description>Flash Memory Protection Read Enable 15</description>
          <addressOffset>0x0000123C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE0</name>
          <displayName>FLASH_FMPPE0</displayName>
          <description>Flash Memory Protection Program Enable 0</description>
          <addressOffset>0x00001400</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE1</name>
          <displayName>FLASH_FMPPE1</displayName>
          <description>Flash Memory Protection Program Enable 1</description>
          <addressOffset>0x00001404</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE2</name>
          <displayName>FLASH_FMPPE2</displayName>
          <description>Flash Memory Protection Program Enable 2</description>
          <addressOffset>0x00001408</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE3</name>
          <displayName>FLASH_FMPPE3</displayName>
          <description>Flash Memory Protection Program Enable 3</description>
          <addressOffset>0x0000140C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE4</name>
          <displayName>FLASH_FMPPE4</displayName>
          <description>Flash Memory Protection Program Enable 4</description>
          <addressOffset>0x00001410</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE5</name>
          <displayName>FLASH_FMPPE5</displayName>
          <description>Flash Memory Protection Program Enable 5</description>
          <addressOffset>0x00001414</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE6</name>
          <displayName>FLASH_FMPPE6</displayName>
          <description>Flash Memory Protection Program Enable 6</description>
          <addressOffset>0x00001418</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE7</name>
          <displayName>FLASH_FMPPE7</displayName>
          <description>Flash Memory Protection Program Enable 7</description>
          <addressOffset>0x0000141C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FLASH_FMPPE8</name>
          <displayName>FLASH_FMPPE8</displayName>
          <description>Flash Memory Protection Program Enable 8</description>
          <addressOffset>0x00001420</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE9</name>
          <displayName>FLASH_FMPPE9</displayName>
          <description>Flash Memory Protection Program Enable 9</description>
          <addressOffset>0x00001424</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE10</name>
          <displayName>FLASH_FMPPE10</displayName>
          <description>Flash Memory Protection Program Enable 10</description>
          <addressOffset>0x00001428</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE11</name>
          <displayName>FLASH_FMPPE11</displayName>
          <description>Flash Memory Protection Program Enable 11</description>
          <addressOffset>0x0000142C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE12</name>
          <displayName>FLASH_FMPPE12</displayName>
          <description>Flash Memory Protection Program Enable 12</description>
          <addressOffset>0x00001430</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
