m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>FLASH_FMPPE13</name>
          <displayName>FLASH_FMPPE13</displayName>
          <description>Flash Memory Protection Program Enable 13</description>
          <addressOffset>0x00001434</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE14</name>
          <displayName>FLASH_FMPPE14</displayName>
          <description>Flash Memory Protection Program Enable 14</description>
          <addressOffset>0x00001438</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FLASH_FMPPE15</name>
          <displayName>FLASH_FMPPE15</displayName>
          <description>Flash Memory Protection Program Enable 15</description>
          <addressOffset>0x0000143C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/tm4c1294kcpdt/sysctl.xml -->
    <peripheral>
      <name>SYSCTL</name>
      <description>System Control register addresses</description>
      <baseAddress>0x400FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>SYSCTL_DID0</name>
          <displayName>SYSCTL_DID0</displayName>
          <description>Device Identification 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_DID0_MIN</name>
              <description>Minor Revision</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_0</name>
                  <description>Initial device, or a major revision update</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_1</name>
                  <description>First metal layer change</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_2</name>
                  <description>Second metal layer change</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_MAJ</name>
              <description>Major Revision</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVA</name>
                  <description>Revision A (initial device)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVB</name>
                  <description>Revision B (first base layer revision)</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVC</name>
                  <description>Revision C (second base layer revision)</description>
                  <value>0x00000200</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_CLASS</name>
              <description>Device Class</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_CLASS_TM4C129</name>
                  <description>Tiva(TM) TM4C129-class microcontrollers</description>
                  <value>0x000A0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_VER</name>
              <description>DID0 Version</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_VER_1</name>
                  <description>Second version of the DID0 register format.</description>
                  <value>0x10000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_DID1</name>
          <displayName>SYSCTL_DID1</displayName>
          <description>Device Identification 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_DID1_QUAL</name>
              <description>Qualification Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_ES</name>
                  <description>Engineering Sample (unqualified)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_PP</name>
                  <description>Pilot Production (unqualified)</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_FQ</name>
                  <description>Fully Qualified</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_ROHS</name>
              <description>RoHS-Compliance</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_DID1_PKG</name>
              <description>Package Type</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_QFP</name>
                  <description>QFP package</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_BGA</name>
                  <description>BGA package</description>
                  <value>0x00000010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_TEMP</name>
              <description>Temperature Range</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_C</name>
                  <description>Commercial temperature range</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_I</name>
                  <description>Industrial temperature range</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_E</name>
                  <description>Extended temperature range</description>
                  <value>0x00000040</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PINCNT</name>
              <description>Package Pin Count</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_100</name>
                  <description>100-pin LQFP package</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_64</name>
                  <description>64-pin LQFP package</description>
                  <value>0x00006000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_144</name>
                  <description>144-pin LQFP package</description>
                  <value>0x00008000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_157</name>
                  <description>157-pin BGA package</description>
                  <value>0x0000A000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_128</name>
                  <description>128-pin TQFP package</description>
                  <value>0x0000C000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PRTNO</name>
              <description>Part Number</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_DID1_FAM</name>
              <description>Family</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_DID1_VER</name>
              <description>DID1 Version</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PTBOCTL</name>
          <displayName>SYSCTL_PTBOCTL</displayName>
          <description>Power-Temp Brown Out Control</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PTBOCTL_VDD_UBOR</name>
              <description>VDD (VDDS) under BOR Event Action</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_NONE</name>
                  <description>No Action</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_SYSINT</name>
                  <description>System control interrupt</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_NMI</name>
                  <description>NMI</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_RST</name>
                  <description>Reset</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PTBOCTL_VDDA_UBOR</name>
              <description>VDDA under BOR Event Action</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_NONE</name>
                  <description>No Action</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_SYSINT</name>
                  <description>System control interrupt</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_NMI</name>
                  <description>NMI</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_RST</name>
                  <description>Reset</description>
                  <value>0x00000300</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_RIS</name>
          <displayName>SYSCTL_RIS</displayName>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_RIS_BORRIS</name>
              <description>Brown-Out Reset Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_RIS_MOFRIS</name>
              <description>Main Oscillator Failure Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_RIS_PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_RIS_MOSCPUPRIS</name>
              <description>MOSC Power Up Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_IMC</name>
          <displayName>SYSCTL_IMC</displayName>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_IMC_BORIM</name>
              <description>Brown-Out Reset Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_IMC_MOFIM</name>
              <description>Main Oscillator Failure Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_IMC_PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_IMC_MOSCPUPIM</name>
              <description>MOSC Power Up Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_MISC</name>
          <displayName>SYSCTL_MISC</displayName>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_MISC_BORMIS</name>
              <description>BOR Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MISC_MOFMIS</name>
              <description>Main Oscillator Failure Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MISC_PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MISC_MOSCPUPMIS</name>
              <description>MOSC Power Up Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_RESC</name>
          <displayName>SYSCTL_RESC</displayName>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_RESC_EXT</name>
              <description>External Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_POR</name>
              <description>Power-On Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_BOR</name>
              <description>Brown-Out Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_WDT0</name>
              <description>Watchdog Timer 0 Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_SW</name>
              <description>Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_WDT1</name>
              <description>Watchdog Timer 1 Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_HSSR</name>
              <description>HSSR Reset</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RESC_MOSCFAIL</name>
              <description>MOSC Failure Reset</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PWRTC</name>
          <displayName>SYSCTL_PWRTC</displayName>
          <description>Power-Temperature Cause</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PWRTC_VDD_UBOR</name>
              <description>VDD Under BOR Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PWRTC_VDDA_UBOR</name>
              <description>VDDA Under BOR Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_NMIC</name>
          <displayName>SYSCTL_NMIC</displayName>
          <description>NMI Cause Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_NMIC_EXTERNAL</name>
              <description>External Pin NMI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_NMIC_POWER</name>
              <description>Power/Brown Out Event NMI</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_NMIC_WDT0</name>
              <description>Watch Dog Timer (WDT) 0 NMI</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_NMIC_WDT1</name>
              <description>Watch Dog Timer (WDT) 1 NMI</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_NMIC_TAMPER</name>
              <description>Tamper Event NMI</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_NMIC_MOSCFAIL</name>
              <description>MOSC Failure NMI</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_MOSCCTL</name>
          <displayName>SYSCTL_MOSCCTL</displayName>
          <description>Main Oscillator Control</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_MOSCCTL_CVAL</name>
              <description>Clock Validation for MOSC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_MOSCIM</name>
              <description>MOSC Failure Action</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_NOXTAL</name>
              <description>No Crystal Connected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_PWRDN</name>
              <description>Power Down</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_OSCRNG</name>
              <description>Oscillator Range</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
