m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SYSCTL_RSCLKCFG</name>
          <displayName>SYSCTL_RSCLKCFG</displayName>
          <description>Run and Sleep Mode Configuration Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_RSCLKCFG_PSYSDIV</name>
              <description>PLL System Clock Divisor</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_OSYSDIV</name>
              <description>Oscillator System Clock Divisor</description>
              <lsb>10</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_OSCSRC</name>
              <description>Oscillator Source</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_PIOSC</name>
                  <description>PIOSC is oscillator source</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_LFIOSC</name>
                  <description>LFIOSC is oscillator source</description>
                  <value>0x00200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_MOSC</name>
                  <description>MOSC is oscillator source</description>
                  <value>0x00300000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_RTC</name>
                  <description>Hibernation Module RTC Oscillator (RTCOSC)</description>
                  <value>0x00400000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_PLLSRC</name>
              <description>PLL Source</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_PLLSRC_PIOSC</name>
                  <description>PIOSC is PLL input clock source</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_PLLSRC_MOSC</name>
                  <description>MOSC is the PLL input clock source</description>
                  <value>0x03000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_USEPLL</name>
              <description>Use PLL</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_ACG</name>
              <description>Auto Clock Gating</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_NEWFREQ</name>
              <description>New PLLFREQ Accept</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_MEMTIMU</name>
              <description>Memory Timing Register Update</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_MEMTIM0</name>
          <displayName>SYSCTL_MEMTIM0</displayName>
          <description>Memory Timing Parameter Register 0 for Main Flash and EEPROM</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_MEMTIM0_FWS</name>
              <description>Flash Wait State</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_FBCE</name>
              <description>Flash Bank Clock Edge</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_FBCHT</name>
              <description>Flash Bank Clock High Time</description>
              <lsb>6</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_0_5</name>
                  <description>1/2 system clock period</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_1</name>
                  <description>1 system clock period</description>
                  <value>0x00000040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_1_5</name>
                  <description>1.5 system clock periods</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_2</name>
                  <description>2 system clock periods</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_2_5</name>
                  <description>2.5 system clock periods</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_3</name>
                  <description>3 system clock periods</description>
                  <value>0x00000140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_3_5</name>
                  <description>3.5 system clock periods</description>
                  <value>0x00000180</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_4</name>
                  <description>4 system clock periods</description>
                  <value>0x000001C0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_FBCHT_4_5</name>
                  <description>4.5 system clock periods</description>
                  <value>0x00000200</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_EWS</name>
              <description>EEPROM Wait States</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_EBCE</name>
              <description>EEPROM Bank Clock Edge</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_MEMTIM0_EBCHT</name>
              <description>EEPROM Clock High Time</description>
              <lsb>22</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_0_5</name>
                  <description>1/2 system clock period</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_1</name>
                  <description>1 system clock period</description>
                  <value>0x00400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_1_5</name>
                  <description>1.5 system clock periods</description>
                  <value>0x00800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_2</name>
                  <description>2 system clock periods</description>
                  <value>0x00C00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_2_5</name>
                  <description>2.5 system clock periods</description>
                  <value>0x01000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_3</name>
                  <description>3 system clock periods</description>
                  <value>0x01400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_3_5</name>
                  <description>3.5 system clock periods</description>
                  <value>0x01800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_4</name>
                  <description>4 system clock periods</description>
                  <value>0x01C00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_MEMTIM0_EBCHT_4_5</name>
                  <description>4.5 system clock periods</description>
                  <value>0x02000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_ALTCLKCFG</name>
          <displayName>SYSCTL_ALTCLKCFG</displayName>
          <description>Alternate Clock Configuration</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_ALTCLKCFG_ALTCLK</name>
              <description>Alternate Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_ALTCLKCFG_ALTCLK_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_ALTCLKCFG_ALTCLK_RTCOSC</name>
                  <description>Hibernation Module Real-time clock output (RTCOSC)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_ALTCLKCFG_ALTCLK_LFIOSC</name>
                  <description>Low-frequency internal oscillator (LFIOSC)</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_DSCLKCFG</name>
          <displayName>SYSCTL_DSCLKCFG</displayName>
          <description>Deep Sleep Clock Configuration Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_DSCLKCFG_DSSYSDIV</name>
              <description>Deep Sleep Clock Divisor</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_DSCLKCFG_DSOSCSRC</name>
              <description>Deep Sleep Oscillator Source</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_LFIOSC</name>
                  <description>LFIOSC</description>
                  <value>0x00200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_MOSC</name>
                  <description>MOSC</description>
                  <value>0x00300000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSCLKCFG_DSOSCSRC_RTC</name>
                  <description>Hibernation Module RTCOSC</description>
                  <value>0x00400000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSCLKCFG_MOSCDPD</name>
              <description>MOSC Disable Power Down</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_DSCLKCFG_PIOSCPD</name>
              <description>PIOSC Power Down</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_DIVSCLK</name>
          <displayName>SYSCTL_DIVSCLK</displayName>
          <description>Divisor and Source Clock Configuration</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_DIVSCLK_DIV</name>
              <description>Divisor Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_DIVSCLK_SRC</name>
              <description>Clock Source</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DIVSCLK_SRC_SYSCLK</name>
                  <description>System Clock</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DIVSCLK_SRC_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x00010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DIVSCLK_SRC_MOSC</name>
                  <description>MOSC</description>
                  <value>0x00020000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DIVSCLK_EN</name>
              <description>DIVSCLK Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SYSPROP</name>
          <displayName>SYSCTL_SYSPROP</displayName>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SYSPROP_FPU</name>
              <description>FPU Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PIOSCCAL</name>
          <displayName>SYSCTL_PIOSCCAL</displayName>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PIOSCCAL_UT</name>
              <description>User Trim Value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UPDATE</name>
              <description>Update Trim</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_CAL</name>
              <description>Start Calibration</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UTEN</name>
              <description>Use User Trim Value</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PIOSCSTAT</name>
          <displayName>SYSCTL_PIOSCSTAT</displayName>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PIOSCSTAT_CT</name>
              <description>Calibration Trim Value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_CR</name>
              <description>Calibration Result</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x00000200</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_DT</name>
              <description>Default Trim Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PLLFREQ0</name>
          <displayName>SYSCTL_PLLFREQ0</displayName>
          <description>PLL Frequency 0</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PLLFREQ0_MINT</name>
              <description>PLL M Integer Value</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ0_MFRAC</name>
              <description>PLL M Fractional Value</description>
              <lsb>10</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ0_PLLPWR</name>
              <description>PLL Power</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PLLFREQ1</name>
          <displayName>SYSCTL_PLLFREQ1</displayName>
          <description>PLL Frequency 1</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PLLFREQ1_N</name>
              <description>PLL N Value</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PLLFREQ1_Q</name>
              <description>PLL Q Value</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PLLSTAT</name>
          <displayName>SYSCTL_PLLSTAT</displayName>
          <description>PLL Status</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PLLSTAT_LOCK</name>
              <description>PLL Lock</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SLPPWRCFG</name>
          <displayName>SYSCTL_SLPPWRCFG</displayName>
          <description>Sleep Power Configuration</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SLPPWRCFG_SRAMPM</name>
              <description>SRAM Power Modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_SRAMPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_SRAMPM_SBY</name>
                  <description>Standby Mode</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_SRAMPM_LP</name>
                  <description>Low Power Mode</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_SLPPWRCFG_FLASHPM</name>
              <description>Flash Power Modes</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_FLASHPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_SLPPWRCFG_FLASHPM_SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x00000020</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
