m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SYSCTL_DSLPPWRCFG</name>
          <displayName>SYSCTL_DSLPPWRCFG</displayName>
          <description>Deep-Sleep Power Configuration</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_DSLPPWRCFG_SRAMPM</name>
              <description>SRAM Power Modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_SRAMPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_SRAMPM_SBY</name>
                  <description>Standby Mode</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_SRAMPM_LP</name>
                  <description>Low Power Mode</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPPWRCFG_FLASHPM</name>
              <description>Flash Power Modes</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_FLASHPM_NRM</name>
                  <description>Active Mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPPWRCFG_FLASHPM_SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x00000020</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPPWRCFG_TSPD</name>
              <description>Temperature Sense Power Down</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_DSLPPWRCFG_LDOSM</name>
              <description>LDO Sleep Mode</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_NVMSTAT</name>
          <displayName>SYSCTL_NVMSTAT</displayName>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_NVMSTAT_FWB</name>
              <description>32 Word Flash Write Buffer Available</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_LDOSPCTL</name>
          <displayName>SYSCTL_LDOSPCTL</displayName>
          <description>LDO Sleep Power Control</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_LDOSPCTL_VLDO</name>
              <description>LDO Output Voltage</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOSPCTL_VLDO_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x00000018</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_LDOSPCTL_VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_LDODPCTL</name>
          <displayName>SYSCTL_LDODPCTL</displayName>
          <description>LDO Deep-Sleep Power Control</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_LDODPCTL_VLDO</name>
              <description>LDO Output Voltage</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x00000018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_25V</name>
                  <description>1.25 V</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_30V</name>
                  <description>1.30 V</description>
                  <value>0x0000001A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_35V</name>
                  <description>1.35 V</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_LDODPCTL_VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_RESBEHAVCTL</name>
          <displayName>SYSCTL_RESBEHAVCTL</displayName>
          <description>Reset Behavior Control Register</description>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_RESBEHAVCTL_EXTRES</name>
              <description>External RST Pin Operation</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_EXTRES_SYSRST</name>
                  <description>External RST assertion issues a system reset. The application starts within 10 us</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_EXTRES_POR</name>
                  <description>External RST assertion issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RESBEHAVCTL_BOR</name>
              <description>BOR Reset operation</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_BOR_SYSRST</name>
                  <description>Brown Out Reset issues system reset. The application starts within 10 us</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_BOR_POR</name>
                  <description>Brown Out Reset issues a simulated POR sequence. The application starts less than 500 us after deassertion (Default)</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RESBEHAVCTL_WDOG0</name>
              <description>Watchdog 0 Reset Operation</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG0_SYSRST</name>
                  <description>Watchdog 0 issues a system reset. The application starts within 10 us</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG0_POR</name>
                  <description>Watchdog 0 issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RESBEHAVCTL_WDOG1</name>
              <description>Watchdog 1 Reset Operation</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG1_SYSRST</name>
                  <description>Watchdog 1 issues a system reset. The application starts within 10 us</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG1_POR</name>
                  <description>Watchdog 1 issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_HSSR</name>
          <displayName>SYSCTL_HSSR</displayName>
          <description>Hardware System Service Request</description>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_HSSR_CDOFF</name>
              <description>Command Descriptor Pointer</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_HSSR_KEY</name>
              <description>Write Key</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_USBPDS</name>
          <displayName>SYSCTL_USBPDS</displayName>
          <description>USB Power Domain Status</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_USBPDS_PWRSTAT</name>
              <description>Power Domain Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_PWRSTAT_OFF</name>
                  <description>OFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_PWRSTAT_ON</name>
                  <description>ON</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_USBPDS_MEMSTAT</name>
              <description>Memory Array Power Status</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_MEMSTAT_OFF</name>
                  <description>Array OFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_MEMSTAT_RETAIN</name>
                  <description>SRAM Retention</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_MEMSTAT_ON</name>
                  <description>Array On</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_USBMPC</name>
          <displayName>SYSCTL_USBMPC</displayName>
          <description>USB Memory Power Control</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_USBMPC_PWRCTL</name>
              <description>Memory Array Power Control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_USBMPC_PWRCTL_OFF</name>
                  <description>Array OFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBMPC_PWRCTL_RETAIN</name>
                  <description>SRAM Retention</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBMPC_PWRCTL_ON</name>
                  <description>Array On</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_EMACPDS</name>
          <displayName>SYSCTL_EMACPDS</displayName>
          <description>Ethernet MAC Power Domain Status</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_EMACPDS_PWRSTAT</name>
              <description>Power Domain Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_EMACPDS_PWRSTAT_OFF</name>
                  <description>OFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_EMACPDS_PWRSTAT_ON</name>
                  <description>ON</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_EMACPDS_MEMSTAT</name>
              <description>Memory Array Power Status</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_EMACPDS_MEMSTAT_OFF</name>
                  <description>Array OFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_EMACPDS_MEMSTAT_ON</name>
                  <description>Array On</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_EMACMPC</name>
          <displayName>SYSCTL_EMACMPC</displayName>
          <description>Ethernet MAC Memory Power Control</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_EMACMPC_PWRCTL</name>
              <description>Memory Array Power Control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_EMACMPC_PWRCTL_OFF</name>
                  <description>Array OFF</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_EMACMPC_PWRCTL_ON</name>
                  <description>Array On</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPWD</name>
          <displayName>SYSCTL_PPWD</displayName>
          <description>Watchdog Timer Peripheral Present</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPWD_P0</name>
              <description>Watchdog Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPWD_P1</name>
              <description>Watchdog Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPTIMER</name>
          <displayName>SYSCTL_PPTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPTIMER_P0</name>
              <description>16/32-Bit General-Purpose Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P1</name>
              <description>16/32-Bit General-Purpose Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P2</name>
              <description>16/32-Bit General-Purpose Timer 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P3</name>
              <description>16/32-Bit General-Purpose Timer 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P4</name>
              <description>16/32-Bit General-Purpose Timer 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P5</name>
              <description>16/32-Bit General-Purpose Timer 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P6</name>
              <description>16/32-Bit General-Purpose Timer 6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P7</name>
              <description>16/32-Bit General-Purpose Timer 7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
