m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SYSCTL_PPGPIO</name>
          <displayName>SYSCTL_PPGPIO</displayName>
          <description>General-Purpose Input/Output Peripheral Present</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPGPIO_P0</name>
              <description>GPIO Port A Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P1</name>
              <description>GPIO Port B Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P2</name>
              <description>GPIO Port C Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P3</name>
              <description>GPIO Port D Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P4</name>
              <description>GPIO Port E Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P5</name>
              <description>GPIO Port F Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P6</name>
              <description>GPIO Port G Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P7</name>
              <description>GPIO Port H Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P8</name>
              <description>GPIO Port J Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P9</name>
              <description>GPIO Port K Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P10</name>
              <description>GPIO Port L Present</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P11</name>
              <description>GPIO Port M Present</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P12</name>
              <description>GPIO Port N Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P13</name>
              <description>GPIO Port P Present</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P14</name>
              <description>GPIO Port Q Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPDMA</name>
          <displayName>SYSCTL_PPDMA</displayName>
          <description>Micro Direct Memory Access Peripheral Present</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPDMA_P0</name>
              <description>uDMA Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPEPI</name>
          <displayName>SYSCTL_PPEPI</displayName>
          <description>EPI Peripheral Present</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPEPI_P0</name>
              <description>EPI Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPHIB</name>
          <displayName>SYSCTL_PPHIB</displayName>
          <description>Hibernation Peripheral Present</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPHIB_P0</name>
              <description>Hibernation Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPUART</name>
          <displayName>SYSCTL_PPUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Present</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPUART_P0</name>
              <description>UART Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P1</name>
              <description>UART Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P2</name>
              <description>UART Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P3</name>
              <description>UART Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P4</name>
              <description>UART Module 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P5</name>
              <description>UART Module 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P6</name>
              <description>UART Module 6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPUART_P7</name>
              <description>UART Module 7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPSSI</name>
          <displayName>SYSCTL_PPSSI</displayName>
          <description>Synchronous Serial Interface Peripheral Present</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPSSI_P0</name>
              <description>SSI Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P1</name>
              <description>SSI Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P2</name>
              <description>SSI Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P3</name>
              <description>SSI Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPI2C</name>
          <displayName>SYSCTL_PPI2C</displayName>
          <description>Inter-Integrated Circuit Peripheral Present</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPI2C_P0</name>
              <description>I2C Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P1</name>
              <description>I2C Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P2</name>
              <description>I2C Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P3</name>
              <description>I2C Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P4</name>
              <description>I2C Module 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P5</name>
              <description>I2C Module 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P6</name>
              <description>I2C Module 6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P7</name>
              <description>I2C Module 7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P8</name>
              <description>I2C Module 8 Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P9</name>
              <description>I2C Module 9 Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPUSB</name>
          <displayName>SYSCTL_PPUSB</displayName>
          <description>Universal Serial Bus Peripheral Present</description>
          <addressOffset>0x00000328</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPUSB_P0</name>
              <description>USB Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPEPHY</name>
          <displayName>SYSCTL_PPEPHY</displayName>
          <description>Ethernet PHY Peripheral Present</description>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPEPHY_P0</name>
              <description>Ethernet PHY Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPCAN</name>
          <displayName>SYSCTL_PPCAN</displayName>
          <description>Controller Area Network Peripheral Present</description>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPCAN_P0</name>
              <description>CAN Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPCAN_P1</name>
              <description>CAN Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPADC</name>
          <displayName>SYSCTL_PPADC</displayName>
          <description>Analog-to-Digital Converter Peripheral Present</description>
          <addressOffset>0x00000338</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPADC_P0</name>
              <description>ADC Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PPADC_P1</name>
              <description>ADC Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPACMP</name>
          <displayName>SYSCTL_PPACMP</displayName>
          <description>Analog Comparator Peripheral Present</description>
          <addressOffset>0x0000033C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPACMP_P0</name>
              <description>Analog Comparator Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPPWM</name>
          <displayName>SYSCTL_PPPWM</displayName>
          <description>Pulse Width Modulator Peripheral Present</description>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPPWM_P0</name>
              <description>PWM Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPQEI</name>
          <displayName>SYSCTL_PPQEI</displayName>
          <description>Quadrature Encoder Interface Peripheral Present</description>
          <addressOffset>0x00000344</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPQEI_P0</name>
              <description>QEI Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPLPC</name>
          <displayName>SYSCTL_PPLPC</displayName>
          <description>Low Pin Count Interface Peripheral Present</description>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPLPC_P0</name>
              <description>LPC Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPPECI</name>
          <displayName>SYSCTL_PPPECI</displayName>
          <description>Platform Environment Control Interface Peripheral Present</description>
          <addressOffset>0x00000350</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPPECI_P0</name>
              <description>PECI Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPFAN</name>
          <displayName>SYSCTL_PPFAN</displayName>
          <description>Fan Control Peripheral Present</description>
          <addressOffset>0x00000354</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPFAN_P0</name>
              <description>FAN Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPEEPROM</name>
          <displayName>SYSCTL_PPEEPROM</displayName>
          <description>EEPROM Peripheral Present</description>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPEEPROM_P0</name>
              <description>EEPROM Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPWTIMER</name>
          <displayName>SYSCTL_PPWTIMER</displayName>
          <description>32/64-Bit Wide General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPWTIMER_P0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPRTS</name>
          <displayName>SYSCTL_PPRTS</displayName>
          <description>Remote Temperature Sensor Peripheral Present</description>
          <addressOffset>0x00000370</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPRTS_P0</name>
              <description>RTS Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPCCM</name>
          <displayName>SYSCTL_PPCCM</displayName>
          <description>CRC and Cryptographic Modules Peripheral Present</description>
          <addressOffset>0x00000374</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPCCM_P0</name>
              <description>CRC and Cryptographic Modules Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPLCD</name>
          <displayName>SYSCTL_PPLCD</displayName>
          <description>LCD Peripheral Present</description>
          <addressOffset>0x00000390</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPLCD_P0</name>
              <description>LCD Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPOWIRE</name>
          <displayName>SYSCTL_PPOWIRE</displayName>
          <description>1-Wire Peripheral Present</description>
          <addressOffset>0x00000398</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPOWIRE_P0</name>
              <description>1-Wire Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPEMAC</name>
          <displayName>SYSCTL_PPEMAC</displayName>
          <description>Ethernet MAC Peripheral Present</description>
          <addressOffset>0x0000039C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPEMAC_P0</name>
              <description>Ethernet Controller Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PPHIM</name>
          <displayName>SYSCTL_PPHIM</displayName>
          <description>Human Interface Master Peripheral Present</description>
          <addressOffset>0x000003A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PPHIM_P0</name>
              <description>HIM Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRWD</name>
          <displayName>SYSCTL_SRWD</displayName>
          <description>Watchdog Timer Software Reset</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRWD_R0</name>
              <description>Watchdog Timer 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRWD_R1</name>
              <description>Watchdog Timer 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
