m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SYSCTL_SRTIMER</name>
          <displayName>SYSCTL_SRTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Software Reset</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R6</name>
              <description>16/32-Bit General-Purpose Timer 6 Software Reset</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R7</name>
              <description>16/32-Bit General-Purpose Timer 7 Software Reset</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRGPIO</name>
          <displayName>SYSCTL_SRGPIO</displayName>
          <description>General-Purpose Input/Output Software Reset</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRGPIO_R0</name>
              <description>GPIO Port A Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R1</name>
              <description>GPIO Port B Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R2</name>
              <description>GPIO Port C Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R3</name>
              <description>GPIO Port D Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R4</name>
              <description>GPIO Port E Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R5</name>
              <description>GPIO Port F Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R6</name>
              <description>GPIO Port G Software Reset</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R7</name>
              <description>GPIO Port H Software Reset</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R8</name>
              <description>GPIO Port J Software Reset</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R9</name>
              <description>GPIO Port K Software Reset</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R10</name>
              <description>GPIO Port L Software Reset</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R11</name>
              <description>GPIO Port M Software Reset</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R12</name>
              <description>GPIO Port N Software Reset</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R13</name>
              <description>GPIO Port P Software Reset</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R14</name>
              <description>GPIO Port Q Software Reset</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRDMA</name>
          <displayName>SYSCTL_SRDMA</displayName>
          <description>Micro Direct Memory Access Software Reset</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRDMA_R0</name>
              <description>uDMA Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SREPI</name>
          <displayName>SYSCTL_SREPI</displayName>
          <description>EPI Software Reset</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SREPI_R0</name>
              <description>EPI Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRHIB</name>
          <displayName>SYSCTL_SRHIB</displayName>
          <description>Hibernation Software Reset</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRHIB_R0</name>
              <description>Hibernation Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRUART</name>
          <displayName>SYSCTL_SRUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Software Reset</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRUART_R0</name>
              <description>UART Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R1</name>
              <description>UART Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R2</name>
              <description>UART Module 2 Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R3</name>
              <description>UART Module 3 Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R4</name>
              <description>UART Module 4 Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R5</name>
              <description>UART Module 5 Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R6</name>
              <description>UART Module 6 Software Reset</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRUART_R7</name>
              <description>UART Module 7 Software Reset</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRSSI</name>
          <displayName>SYSCTL_SRSSI</displayName>
          <description>Synchronous Serial Interface Software Reset</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRSSI_R0</name>
              <description>SSI Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R1</name>
              <description>SSI Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R2</name>
              <description>SSI Module 2 Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R3</name>
              <description>SSI Module 3 Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRI2C</name>
          <displayName>SYSCTL_SRI2C</displayName>
          <description>Inter-Integrated Circuit Software Reset</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRI2C_R0</name>
              <description>I2C Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R1</name>
              <description>I2C Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R2</name>
              <description>I2C Module 2 Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R3</name>
              <description>I2C Module 3 Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R4</name>
              <description>I2C Module 4 Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R5</name>
              <description>I2C Module 5 Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R6</name>
              <description>I2C Module 6 Software Reset</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R7</name>
              <description>I2C Module 7 Software Reset</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R8</name>
              <description>I2C Module 8 Software Reset</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R9</name>
              <description>I2C Module 9 Software Reset</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRUSB</name>
          <displayName>SYSCTL_SRUSB</displayName>
          <description>Universal Serial Bus Software Reset</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRUSB_R0</name>
              <description>USB Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SREPHY</name>
          <displayName>SYSCTL_SREPHY</displayName>
          <description>Ethernet PHY Software Reset</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SREPHY_R0</name>
              <description>Ethernet PHY Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRCAN</name>
          <displayName>SYSCTL_SRCAN</displayName>
          <description>Controller Area Network Software Reset</description>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRCAN_R0</name>
              <description>CAN Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRCAN_R1</name>
              <description>CAN Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRADC</name>
          <displayName>SYSCTL_SRADC</displayName>
          <description>Analog-to-Digital Converter Software Reset</description>
          <addressOffset>0x00000538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRADC_R0</name>
              <description>ADC Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_SRADC_R1</name>
              <description>ADC Module 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRACMP</name>
          <displayName>SYSCTL_SRACMP</displayName>
          <description>Analog Comparator Software Reset</description>
          <addressOffset>0x0000053C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRACMP_R0</name>
              <description>Analog Comparator Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRPWM</name>
          <displayName>SYSCTL_SRPWM</displayName>
          <description>Pulse Width Modulator Software Reset</description>
          <addressOffset>0x00000540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRPWM_R0</name>
              <description>PWM Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRQEI</name>
          <displayName>SYSCTL_SRQEI</displayName>
          <description>Quadrature Encoder Interface Software Reset</description>
          <addressOffset>0x00000544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRQEI_R0</name>
              <description>QEI Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SREEPROM</name>
          <displayName>SYSCTL_SREEPROM</displayName>
          <description>EEPROM Software Reset</description>
          <addressOffset>0x00000558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SREEPROM_R0</name>
              <description>EEPROM Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRCCM</name>
          <displayName>SYSCTL_SRCCM</displayName>
          <description>CRC and Cryptographic Modules Software Reset</description>
          <addressOffset>0x00000574</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SRCCM_R0</name>
              <description>CRC and Cryptographic Modules Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SREMAC</name>
          <displayName>SYSCTL_SREMAC</displayName>
          <description>Ethernet MAC Software Reset</description>
          <addressOffset>0x0000059C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SREMAC_R0</name>
              <description>Ethernet Controller MAC Module 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_RCGCWD</name>
          <displayName>SYSCTL_RCGCWD</displayName>
          <description>Watchdog Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000600</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_RCGCWD_R0</name>
              <description>Watchdog Timer 0 Run Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_RCGCWD_R1</name>
              <description>Watchdog Timer 1 Run Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
