m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SYSCTL_PCTIMER</name>
          <displayName>SYSCTL_PCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Power Control</description>
          <addressOffset>0x00000904</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCTIMER_P0</name>
              <description>General-Purpose Timer 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P1</name>
              <description>General-Purpose Timer 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P2</name>
              <description>General-Purpose Timer 2 Power Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P3</name>
              <description>General-Purpose Timer 3 Power Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P4</name>
              <description>General-Purpose Timer 4 Power Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P5</name>
              <description>General-Purpose Timer 5 Power Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P6</name>
              <description>General-Purpose Timer 6 Power Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P7</name>
              <description>General-Purpose Timer 7 Power Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCGPIO</name>
          <displayName>SYSCTL_PCGPIO</displayName>
          <description>General-Purpose Input/Output Power Control</description>
          <addressOffset>0x00000908</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCGPIO_P0</name>
              <description>GPIO Port A Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P1</name>
              <description>GPIO Port B Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P2</name>
              <description>GPIO Port C Power Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P3</name>
              <description>GPIO Port D Power Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P4</name>
              <description>GPIO Port E Power Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P5</name>
              <description>GPIO Port F Power Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P6</name>
              <description>GPIO Port G Power Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P7</name>
              <description>GPIO Port H Power Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P8</name>
              <description>GPIO Port J Power Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P9</name>
              <description>GPIO Port K Power Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P10</name>
              <description>GPIO Port L Power Control</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P11</name>
              <description>GPIO Port M Power Control</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P12</name>
              <description>GPIO Port N Power Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P13</name>
              <description>GPIO Port P Power Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P14</name>
              <description>GPIO Port Q Power Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCDMA</name>
          <displayName>SYSCTL_PCDMA</displayName>
          <description>Micro Direct Memory Access Power Control</description>
          <addressOffset>0x0000090C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCDMA_P0</name>
              <description>uDMA Module Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCEPI</name>
          <displayName>SYSCTL_PCEPI</displayName>
          <description>External Peripheral Interface Power Control</description>
          <addressOffset>0x00000910</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCEPI_P0</name>
              <description>EPI Module Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCHIB</name>
          <displayName>SYSCTL_PCHIB</displayName>
          <description>Hibernation Power Control</description>
          <addressOffset>0x00000914</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCHIB_P0</name>
              <description>Hibernation Module Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCUART</name>
          <displayName>SYSCTL_PCUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Power Control</description>
          <addressOffset>0x00000918</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCUART_P0</name>
              <description>UART Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P1</name>
              <description>UART Module 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P2</name>
              <description>UART Module 2 Power Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P3</name>
              <description>UART Module 3 Power Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P4</name>
              <description>UART Module 4 Power Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P5</name>
              <description>UART Module 5 Power Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P6</name>
              <description>UART Module 6 Power Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCUART_P7</name>
              <description>UART Module 7 Power Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCSSI</name>
          <displayName>SYSCTL_PCSSI</displayName>
          <description>Synchronous Serial Interface Power Control</description>
          <addressOffset>0x0000091C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCSSI_P0</name>
              <description>SSI Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P1</name>
              <description>SSI Module 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P2</name>
              <description>SSI Module 2 Power Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P3</name>
              <description>SSI Module 3 Power Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCI2C</name>
          <displayName>SYSCTL_PCI2C</displayName>
          <description>Inter-Integrated Circuit Power Control</description>
          <addressOffset>0x00000920</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCI2C_P0</name>
              <description>I2C Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P1</name>
              <description>I2C Module 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P2</name>
              <description>I2C Module 2 Power Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P3</name>
              <description>I2C Module 3 Power Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P4</name>
              <description>I2C Module 4 Power Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P5</name>
              <description>I2C Module 5 Power Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P6</name>
              <description>I2C Module 6 Power Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P7</name>
              <description>I2C Module 7 Power Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P8</name>
              <description>I2C Module 8 Power Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P9</name>
              <description>I2C Module 9 Power Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCUSB</name>
          <displayName>SYSCTL_PCUSB</displayName>
          <description>Universal Serial Bus Power Control</description>
          <addressOffset>0x00000928</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCUSB_P0</name>
              <description>USB Module Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCEPHY</name>
          <displayName>SYSCTL_PCEPHY</displayName>
          <description>Ethernet PHY Power Control</description>
          <addressOffset>0x00000930</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCEPHY_P0</name>
              <description>Ethernet PHY Module Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCCAN</name>
          <displayName>SYSCTL_PCCAN</displayName>
          <description>Controller Area Network Power Control</description>
          <addressOffset>0x00000934</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCCAN_P0</name>
              <description>CAN Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCCAN_P1</name>
              <description>CAN Module 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCADC</name>
          <displayName>SYSCTL_PCADC</displayName>
          <description>Analog-to-Digital Converter Power Control</description>
          <addressOffset>0x00000938</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCADC_P0</name>
              <description>ADC Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL_PCADC_P1</name>
              <description>ADC Module 1 Power Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCACMP</name>
          <displayName>SYSCTL_PCACMP</displayName>
          <description>Analog Comparator Power Control</description>
          <addressOffset>0x0000093C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCACMP_P0</name>
              <description>Analog Comparator Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCPWM</name>
          <displayName>SYSCTL_PCPWM</displayName>
          <description>Pulse Width Modulator Power Control</description>
          <addressOffset>0x00000940</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCPWM_P0</name>
              <description>PWM Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCQEI</name>
          <displayName>SYSCTL_PCQEI</displayName>
          <description>Quadrature Encoder Interface Power Control</description>
          <addressOffset>0x00000944</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCQEI_P0</name>
              <description>QEI Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCEEPROM</name>
          <displayName>SYSCTL_PCEEPROM</displayName>
          <description>EEPROM Power Control</description>
          <addressOffset>0x00000958</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCEEPROM_P0</name>
              <description>EEPROM Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCCCM</name>
          <displayName>SYSCTL_PCCCM</displayName>
          <description>CRC and Cryptographic Modules Power Control</description>
          <addressOffset>0x00000974</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCCCM_P0</name>
              <description>CRC and Cryptographic Modules Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PCEMAC</name>
          <displayName>SYSCTL_PCEMAC</displayName>
          <description>Ethernet MAC Power Control</description>
          <addressOffset>0x0000099C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PCEMAC_P0</name>
              <description>Ethernet MAC Module 0 Power Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRWD</name>
          <displayName>SYSCTL_PRWD</displayName>
          <description>Watchdog Timer Peripheral Ready</description>
          <addressOffset>0x00000A00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRWD_R0</name>
              <description>Watchdog Timer 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRWD_R1</name>
              <description>Watchdog Timer 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
