m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>SYSCTL_PRTIMER</name>
          <displayName>SYSCTL_PRTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Peripheral Ready</description>
          <addressOffset>0x00000A04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R6</name>
              <description>16/32-Bit General-Purpose Timer 6 Peripheral Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R7</name>
              <description>16/32-Bit General-Purpose Timer 7 Peripheral Ready</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRGPIO</name>
          <displayName>SYSCTL_PRGPIO</displayName>
          <description>General-Purpose Input/Output Peripheral Ready</description>
          <addressOffset>0x00000A08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRGPIO_R0</name>
              <description>GPIO Port A Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R1</name>
              <description>GPIO Port B Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R2</name>
              <description>GPIO Port C Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R3</name>
              <description>GPIO Port D Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R4</name>
              <description>GPIO Port E Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R5</name>
              <description>GPIO Port F Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R6</name>
              <description>GPIO Port G Peripheral Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R7</name>
              <description>GPIO Port H Peripheral Ready</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R8</name>
              <description>GPIO Port J Peripheral Ready</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R9</name>
              <description>GPIO Port K Peripheral Ready</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R10</name>
              <description>GPIO Port L Peripheral Ready</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R11</name>
              <description>GPIO Port M Peripheral Ready</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R12</name>
              <description>GPIO Port N Peripheral Ready</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R13</name>
              <description>GPIO Port P Peripheral Ready</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R14</name>
              <description>GPIO Port Q Peripheral Ready</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRDMA</name>
          <displayName>SYSCTL_PRDMA</displayName>
          <description>Micro Direct Memory Access Peripheral Ready</description>
          <addressOffset>0x00000A0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRDMA_R0</name>
              <description>uDMA Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PREPI</name>
          <displayName>SYSCTL_PREPI</displayName>
          <description>EPI Peripheral Ready</description>
          <addressOffset>0x00000A10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PREPI_R0</name>
              <description>EPI Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRHIB</name>
          <displayName>SYSCTL_PRHIB</displayName>
          <description>Hibernation Peripheral Ready</description>
          <addressOffset>0x00000A14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRHIB_R0</name>
              <description>Hibernation Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRUART</name>
          <displayName>SYSCTL_PRUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Ready</description>
          <addressOffset>0x00000A18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRUART_R0</name>
              <description>UART Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R1</name>
              <description>UART Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R2</name>
              <description>UART Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R3</name>
              <description>UART Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R4</name>
              <description>UART Module 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R5</name>
              <description>UART Module 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R6</name>
              <description>UART Module 6 Peripheral Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRUART_R7</name>
              <description>UART Module 7 Peripheral Ready</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRSSI</name>
          <displayName>SYSCTL_PRSSI</displayName>
          <description>Synchronous Serial Interface Peripheral Ready</description>
          <addressOffset>0x00000A1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRSSI_R0</name>
              <description>SSI Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R1</name>
              <description>SSI Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R2</name>
              <description>SSI Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R3</name>
              <description>SSI Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRI2C</name>
          <displayName>SYSCTL_PRI2C</displayName>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRI2C_R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R4</name>
              <description>I2C Module 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R5</name>
              <description>I2C Module 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R6</name>
              <description>I2C Module 6 Peripheral Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R7</name>
              <description>I2C Module 7 Peripheral Ready</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R8</name>
              <description>I2C Module 8 Peripheral Ready</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R9</name>
              <description>I2C Module 9 Peripheral Ready</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRUSB</name>
          <displayName>SYSCTL_PRUSB</displayName>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRUSB_R0</name>
              <description>USB Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PREPHY</name>
          <displayName>SYSCTL_PREPHY</displayName>
          <description>Ethernet PHY Peripheral Ready</description>
          <addressOffset>0x00000A30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PREPHY_R0</name>
              <description>Ethernet PHY Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRCAN</name>
          <displayName>SYSCTL_PRCAN</displayName>
          <description>Controller Area Network Peripheral Ready</description>
          <addressOffset>0x00000A34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRCAN_R0</name>
              <description>CAN Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRCAN_R1</name>
              <description>CAN Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRADC</name>
          <displayName>SYSCTL_PRADC</displayName>
          <description>Analog-to-Digital Converter Peripheral Ready</description>
          <addressOffset>0x00000A38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRADC_R0</name>
              <description>ADC Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCTL_PRADC_R1</name>
              <description>ADC Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRACMP</name>
          <displayName>SYSCTL_PRACMP</displayName>
          <description>Analog Comparator Peripheral Ready</description>
          <addressOffset>0x00000A3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRACMP_R0</name>
              <description>Analog Comparator Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRPWM</name>
          <displayName>SYSCTL_PRPWM</displayName>
          <description>Pulse Width Modulator Peripheral Ready</description>
          <addressOffset>0x00000A40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRPWM_R0</name>
              <description>PWM Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRQEI</name>
          <displayName>SYSCTL_PRQEI</displayName>
          <description>Quadrature Encoder Interface Peripheral Ready</description>
          <addressOffset>0x00000A44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRQEI_R0</name>
              <description>QEI Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PREEPROM</name>
          <displayName>SYSCTL_PREEPROM</displayName>
          <description>EEPROM Peripheral Ready</description>
          <addressOffset>0x00000A58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PREEPROM_R0</name>
              <description>EEPROM Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PRCCM</name>
          <displayName>SYSCTL_PRCCM</displayName>
          <description>CRC and Cryptographic Modules Peripheral Ready</description>
          <addressOffset>0x00000A74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PRCCM_R0</name>
              <description>CRC and Cryptographic Modules Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PREMAC</name>
          <displayName>SYSCTL_PREMAC</displayName>
          <description>Ethernet MAC Peripheral Ready</description>
          <addressOffset>0x00000A9C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PREMAC_R0</name>
              <description>Ethernet MAC Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
