m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/ccm.xml -->
    <peripheral>
      <name>CCM0</name>
      <description>EC register offsets</description>
      <baseAddress>0x44030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CCM_CRCCTRL</name>
          <displayName>CCM_CRCCTRL</displayName>
          <description>CRC Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCM_CRCCTRL_TYPE</name>
              <description>Operation Type</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_TYPE_P8055</name>
                  <description>Polynomial 0x8005</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_TYPE_P1021</name>
                  <description>Polynomial 0x1021</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_TYPE_P4C11DB7</name>
                  <description>Polynomial 0x4C11DB7</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_TYPE_P1EDC6F41</name>
                  <description>Polynomial 0x1EDC6F41</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_TYPE_TCPCHKSUM</name>
                  <description>TCP checksum</description>
                  <value>0x00000008</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCM_CRCCTRL_ENDIAN</name>
              <description>Endian Control</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_ENDIAN_SBHW</name>
                  <description>Configuration unchanged. (B3, B2, B1, B0)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_ENDIAN_SHW</name>
                  <description>Bytes are swapped in half-words but half-words are not swapped (B2, B3, B0, B1)</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_ENDIAN_SHWNB</name>
                  <description>Half-words are swapped but bytes are not swapped in half-word. (B1, B0, B3, B2)</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_ENDIAN_SBSW</name>
                  <description>Bytes are swapped in half-words and half-words are swapped. (B0, B1, B2, B3)</description>
                  <value>0x00000030</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCM_CRCCTRL_BR</name>
              <description>Bit reverse enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_CRCCTRL_OBR</name>
              <description>Output Reverse Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_CRCCTRL_RESINV</name>
              <description>Result Inverse Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_CRCCTRL_SIZE</name>
              <description>Input Data Size</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_CRCCTRL_INIT</name>
              <description>CRC Initialization</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_INIT_SEED</name>
                  <description>Use the CRCSEED register context as the starting value</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_INIT_0</name>
                  <description>Initialize to all '0s'</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_CRCCTRL_INIT_1</name>
                  <description>Initialize to all '1s'</description>
                  <value>0x00006000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_CRCSEED</name>
          <displayName>CCM_CRCSEED</displayName>
          <description>CRC SEED/Context</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CCM_CRCDIN</name>
          <displayName>CCM_CRCDIN</displayName>
          <description>CRC Data Input</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CCM_CRCRSLTPP</name>
          <displayName>CCM_CRCRSLTPP</displayName>
          <description>CRC Post Processing Result</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
