m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/nvic.xml -->
    <peripheral>
      <name>NVIC</name>
      <description>NVIC register addresses</description>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>NVIC_ACTLR</name>
          <displayName>NVIC_ACTLR</displayName>
          <description>Auxiliary Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_ACTLR_DISMCYC</name>
              <description>Disable Interrupts of Multiple Cycle Instructions</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ACTLR_DISWBUF</name>
              <description>Disable Write Buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ACTLR_DISFOLD</name>
              <description>Disable IT Folding</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ACTLR_DISFPCA</name>
              <description>Disable CONTROL</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ACTLR_DISOOFP</name>
              <description>Disable Out-Of-Order Floating Point</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ST_CTRL</name>
          <displayName>NVIC_ST_CTRL</displayName>
          <description>SysTick Control and Status Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_ST_CTRL_ENABLE</name>
              <description>Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ST_CTRL_INTEN</name>
              <description>Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ST_CTRL_CLK_SRC</name>
              <description>Clock Source</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_ST_CTRL_COUNT</name>
              <description>Count Flag</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ST_RELOAD</name>
          <displayName>NVIC_ST_RELOAD</displayName>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_ST_RELOAD</name>
              <description>Reload Value</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ST_CURRENT</name>
          <displayName>NVIC_ST_CURRENT</displayName>
          <description>SysTick Current Value Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_ST_CURRENT</name>
              <description>Current Value</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_EN0</name>
          <displayName>NVIC_EN0</displayName>
          <description>Interrupt 0-31 Set Enable</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_EN1</name>
          <displayName>NVIC_EN1</displayName>
          <description>Interrupt 32-63 Set Enable</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_EN2</name>
          <displayName>NVIC_EN2</displayName>
          <description>Interrupt 64-95 Set Enable</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_EN3</name>
          <displayName>NVIC_EN3</displayName>
          <description>Interrupt 96-127 Set Enable</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_DIS0</name>
          <displayName>NVIC_DIS0</displayName>
          <description>Interrupt 0-31 Clear Enable</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_DIS1</name>
          <displayName>NVIC_DIS1</displayName>
          <description>Interrupt 32-63 Clear Enable</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_DIS2</name>
          <displayName>NVIC_DIS2</displayName>
          <description>Interrupt 64-95 Clear Enable</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_DIS3</name>
          <displayName>NVIC_DIS3</displayName>
          <description>Interrupt 96-127 Clear Enable</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_PEND0</name>
          <displayName>NVIC_PEND0</displayName>
          <description>Interrupt 0-31 Set Pending</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_PEND1</name>
          <displayName>NVIC_PEND1</displayName>
          <description>Interrupt 32-63 Set Pending</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_PEND2</name>
          <displayName>NVIC_PEND2</displayName>
          <description>Interrupt 64-95 Set Pending</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_PEND3</name>
          <displayName>NVIC_PEND3</displayName>
          <description>Interrupt 96-127 Set Pending</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_UNPEND0</name>
          <displayName>NVIC_UNPEND0</displayName>
          <description>Interrupt 0-31 Clear Pending</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_UNPEND1</name>
          <displayName>NVIC_UNPEND1</displayName>
          <description>Interrupt 32-63 Clear Pending</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_UNPEND2</name>
          <displayName>NVIC_UNPEND2</displayName>
          <description>Interrupt 64-95 Clear Pending</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_UNPEND3</name>
          <displayName>NVIC_UNPEND3</displayName>
          <description>Interrupt 96-127 Clear Pending</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_ACTIVE0</name>
          <displayName>NVIC_ACTIVE0</displayName>
          <description>Interrupt 0-31 Active Bit</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>NVIC_ACTIVE1</name>
          <displayName>NVIC_ACTIVE1</displayName>
          <description>Interrupt 32-63 Active Bit</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>NVIC_ACTIVE2</name>
          <displayName>NVIC_ACTIVE2</displayName>
          <description>Interrupt 64-95 Active Bit</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>NVIC_ACTIVE3</name>
          <displayName>NVIC_ACTIVE3</displayName>
          <description>Interrupt 96-127 Active Bit</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>NVIC_PRI0</name>
          <displayName>NVIC_PRI0</displayName>
          <description>Interrupt 0-3 Priority</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI0_INT0</name>
              <description>Interrupt 0 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI0_INT1</name>
              <description>Interrupt 1 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI0_INT2</name>
              <description>Interrupt 2 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI0_INT3</name>
              <description>Interrupt 3 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI1</name>
          <displayName>NVIC_PRI1</displayName>
          <description>Interrupt 4-7 Priority</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI1_INT4</name>
              <description>Interrupt 4 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI1_INT5</name>
              <description>Interrupt 5 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI1_INT6</name>
              <description>Interrupt 6 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI1_INT7</name>
              <description>Interrupt 7 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI2</name>
          <displayName>NVIC_PRI2</displayName>
          <description>Interrupt 8-11 Priority</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI2_INT8</name>
              <description>Interrupt 8 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI2_INT9</name>
              <description>Interrupt 9 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI2_INT10</name>
              <description>Interrupt 10 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI2_INT11</name>
              <description>Interrupt 11 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI3</name>
          <displayName>NVIC_PRI3</displayName>
          <description>Interrupt 12-15 Priority</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI3_INT12</name>
              <description>Interrupt 12 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI3_INT13</name>
              <description>Interrupt 13 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI3_INT14</name>
              <description>Interrupt 14 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI3_INT15</name>
              <description>Interrupt 15 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI4</name>
          <displayName>NVIC_PRI4</displayName>
          <description>Interrupt 16-19 Priority</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI4_INT16</name>
              <description>Interrupt 16 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI4_INT17</name>
              <description>Interrupt 17 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI4_INT18</name>
              <description>Interrupt 18 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI4_INT19</name>
              <description>Interrupt 19 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI5</name>
          <displayName>NVIC_PRI5</displayName>
          <description>Interrupt 20-23 Priority</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI5_INT20</name>
              <description>Interrupt 20 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI5_INT21</name>
              <description>Interrupt 21 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI5_INT22</name>
              <description>Interrupt 22 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI5_INT23</name>
              <description>Interrupt 23 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI6</name>
          <displayName>NVIC_PRI6</displayName>
          <description>Interrupt 24-27 Priority</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI6_INT24</name>
              <description>Interrupt 24 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI6_INT25</name>
              <description>Interrupt 25 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI6_INT26</name>
              <description>Interrupt 26 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI6_INT27</name>
              <description>Interrupt 27 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI7</name>
          <displayName>NVIC_PRI7</displayName>
          <description>Interrupt 28-31 Priority</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI7_INT28</name>
              <description>Interrupt 28 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI7_INT29</name>
              <description>Interrupt 29 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI7_INT30</name>
              <description>Interrupt 30 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI7_INT31</name>
              <description>Interrupt 31 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI8</name>
          <displayName>NVIC_PRI8</displayName>
          <description>Interrupt 32-35 Priority</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI8_INT32</name>
              <description>Interrupt 32 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI8_INT33</name>
              <description>Interrupt 33 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI8_INT34</name>
              <description>Interrupt 34 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI8_INT35</name>
              <description>Interrupt 35 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI9</name>
          <displayName>NVIC_PRI9</displayName>
          <description>Interrupt 36-39 Priority</description>
          <addressOffset>0x00000424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI9_INT36</name>
              <description>Interrupt 36 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI9_INT37</name>
              <description>Interrupt 37 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI9_INT38</name>
              <description>Interrupt 38 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI9_INT39</name>
              <description>Interrupt 39 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
