m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>NVIC_PRI10</name>
          <displayName>NVIC_PRI10</displayName>
          <description>Interrupt 40-43 Priority</description>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI10_INT40</name>
              <description>Interrupt 40 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI10_INT41</name>
              <description>Interrupt 41 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI10_INT42</name>
              <description>Interrupt 42 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI10_INT43</name>
              <description>Interrupt 43 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI11</name>
          <displayName>NVIC_PRI11</displayName>
          <description>Interrupt 44-47 Priority</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI11_INT44</name>
              <description>Interrupt 44 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI11_INT45</name>
              <description>Interrupt 45 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI11_INT46</name>
              <description>Interrupt 46 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI11_INT47</name>
              <description>Interrupt 47 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI12</name>
          <displayName>NVIC_PRI12</displayName>
          <description>Interrupt 48-51 Priority</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI12_INT48</name>
              <description>Interrupt 48 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI12_INT49</name>
              <description>Interrupt 49 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI12_INT50</name>
              <description>Interrupt 50 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI12_INT51</name>
              <description>Interrupt 51 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI13</name>
          <displayName>NVIC_PRI13</displayName>
          <description>Interrupt 52-55 Priority</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI13_INT52</name>
              <description>Interrupt 52 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI13_INT53</name>
              <description>Interrupt 53 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI13_INT54</name>
              <description>Interrupt 54 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI13_INT55</name>
              <description>Interrupt 55 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI14</name>
          <displayName>NVIC_PRI14</displayName>
          <description>Interrupt 56-59 Priority</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI14_INTA</name>
              <description>Interrupt 56 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI14_INTB</name>
              <description>Interrupt 57 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI14_INTC</name>
              <description>Interrupt 58 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI14_INTD</name>
              <description>Interrupt 59 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI15</name>
          <displayName>NVIC_PRI15</displayName>
          <description>Interrupt 60-63 Priority</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI15_INTA</name>
              <description>Interrupt 60 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI15_INTB</name>
              <description>Interrupt 61 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI15_INTC</name>
              <description>Interrupt 62 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI15_INTD</name>
              <description>Interrupt 63 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI16</name>
          <displayName>NVIC_PRI16</displayName>
          <description>Interrupt 64-67 Priority</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI16_INTA</name>
              <description>Interrupt 64 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI16_INTB</name>
              <description>Interrupt 65 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI16_INTC</name>
              <description>Interrupt 66 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI16_INTD</name>
              <description>Interrupt 67 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI17</name>
          <displayName>NVIC_PRI17</displayName>
          <description>Interrupt 68-71 Priority</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI17_INTA</name>
              <description>Interrupt 68 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI17_INTB</name>
              <description>Interrupt 69 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI17_INTC</name>
              <description>Interrupt 70 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI17_INTD</name>
              <description>Interrupt 71 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI18</name>
          <displayName>NVIC_PRI18</displayName>
          <description>Interrupt 72-75 Priority</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI18_INTA</name>
              <description>Interrupt 72 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI18_INTB</name>
              <description>Interrupt 73 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI18_INTC</name>
              <description>Interrupt 74 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI18_INTD</name>
              <description>Interrupt 75 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI19</name>
          <displayName>NVIC_PRI19</displayName>
          <description>Interrupt 76-79 Priority</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI19_INTA</name>
              <description>Interrupt 76 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI19_INTB</name>
              <description>Interrupt 77 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI19_INTC</name>
              <description>Interrupt 78 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI19_INTD</name>
              <description>Interrupt 79 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI20</name>
          <displayName>NVIC_PRI20</displayName>
          <description>Interrupt 80-83 Priority</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI20_INTA</name>
              <description>Interrupt 80 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI20_INTB</name>
              <description>Interrupt 81 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI20_INTC</name>
              <description>Interrupt 82 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI20_INTD</name>
              <description>Interrupt 83 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI21</name>
          <displayName>NVIC_PRI21</displayName>
          <description>Interrupt 84-87 Priority</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI21_INTA</name>
              <description>Interrupt 84 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI21_INTB</name>
              <description>Interrupt 85 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI21_INTC</name>
              <description>Interrupt 86 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI21_INTD</name>
              <description>Interrupt 87 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI22</name>
          <displayName>NVIC_PRI22</displayName>
          <description>Interrupt 88-91 Priority</description>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI22_INTA</name>
              <description>Interrupt 88 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI22_INTB</name>
              <description>Interrupt 89 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI22_INTC</name>
              <description>Interrupt 90 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI22_INTD</name>
              <description>Interrupt 91 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI23</name>
          <displayName>NVIC_PRI23</displayName>
          <description>Interrupt 92-95 Priority</description>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI23_INTA</name>
              <description>Interrupt 92 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI23_INTB</name>
              <description>Interrupt 93 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI23_INTC</name>
              <description>Interrupt 94 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI23_INTD</name>
              <description>Interrupt 95 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI24</name>
          <displayName>NVIC_PRI24</displayName>
          <description>Interrupt 96-99 Priority</description>
          <addressOffset>0x00000460</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI24_INTA</name>
              <description>Interrupt 96 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI24_INTB</name>
              <description>Interrupt 97 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI24_INTC</name>
              <description>Interrupt 98 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI24_INTD</name>
              <description>Interrupt 99 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI25</name>
          <displayName>NVIC_PRI25</displayName>
          <description>Interrupt 100-103 Priority</description>
          <addressOffset>0x00000464</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI25_INTA</name>
              <description>Interrupt 100 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI25_INTB</name>
              <description>Interrupt 101 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI25_INTC</name>
              <description>Interrupt 102 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI25_INTD</name>
              <description>Interrupt 103 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI26</name>
          <displayName>NVIC_PRI26</displayName>
          <description>Interrupt 104-107 Priority</description>
          <addressOffset>0x00000468</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI26_INTA</name>
              <description>Interrupt 104 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI26_INTB</name>
              <description>Interrupt 105 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI26_INTC</name>
              <description>Interrupt 106 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI26_INTD</name>
              <description>Interrupt 107 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_PRI27</name>
          <displayName>NVIC_PRI27</displayName>
          <description>Interrupt 108-111 Priority</description>
          <addressOffset>0x0000046C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI27_INTA</name>
              <description>Interrupt 108 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI27_INTB</name>
              <description>Interrupt 109 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI27_INTC</name>
              <description>Interrupt 110 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI27_INTD</name>
              <description>Interrupt 111 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
