m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>NVIC_PRI28</name>
          <displayName>NVIC_PRI28</displayName>
          <description>Interrupt 112-115 Priority</description>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_PRI28_INTA</name>
              <description>Interrupt 112 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI28_INTB</name>
              <description>Interrupt 113 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI28_INTC</name>
              <description>Interrupt 114 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_PRI28_INTD</name>
              <description>Interrupt 115 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_CPUID</name>
          <displayName>NVIC_CPUID</displayName>
          <description>CPU ID Base</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_CPUID_REV</name>
              <description>Revision Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NVIC_CPUID_PARTNO</name>
              <description>Part Number</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_PARTNO_CM4</name>
                  <description>Cortex-M4 processor</description>
                  <value>0x0000C240</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_CPUID_CON</name>
              <description>Constant</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NVIC_CPUID_VAR</name>
              <description>Variant Number</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NVIC_CPUID_IMP</name>
              <description>Implementer Code</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_IMP_ARM</name>
                  <description>ARM</description>
                  <value>0x41000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_INT_CTRL</name>
          <displayName>NVIC_INT_CTRL</displayName>
          <description>Interrupt Control and State</description>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_INT_CTRL_VEC_ACT</name>
              <description>Interrupt Pending Vector Number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_RET_BASE</name>
              <description>Return to Base</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_VEC_PEN</name>
              <description>Interrupt Pending Vector Number</description>
              <lsb>12</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_NMI</name>
                  <description>NMI</description>
                  <value>0x00002000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_HARD</name>
                  <description>Hard fault</description>
                  <value>0x00003000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_MEM</name>
                  <description>Memory management fault</description>
                  <value>0x00004000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_BUS</name>
                  <description>Bus fault</description>
                  <value>0x00005000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_USG</name>
                  <description>Usage fault</description>
                  <value>0x00006000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_SVC</name>
                  <description>SVCall</description>
                  <value>0x0000B000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_PNDSV</name>
                  <description>PendSV</description>
                  <value>0x0000E000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_TICK</name>
                  <description>SysTick</description>
                  <value>0x0000F000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_INT_CTRL_ISR_PEND</name>
              <description>Interrupt Pending</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_ISR_PRE</name>
              <description>Debug Interrupt Handling</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_PENDSTCLR</name>
              <description>SysTick Clear Pending</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_PENDSTSET</name>
              <description>SysTick Set Pending</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_UNPEND_SV</name>
              <description>PendSV Clear Pending</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_PEND_SV</name>
              <description>PendSV Set Pending</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_INT_CTRL_NMI_SET</name>
              <description>NMI Set Pending</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_VTABLE</name>
          <displayName>NVIC_VTABLE</displayName>
          <description>Vector Table Offset</description>
          <addressOffset>0x00000D08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_VTABLE_OFFSET</name>
              <description>Vector Table Offset</description>
              <lsb>10</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_APINT</name>
          <displayName>NVIC_APINT</displayName>
          <description>Application Interrupt and Reset Control</description>
          <addressOffset>0x00000D0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_APINT_VECT_RESET</name>
              <description>System Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_APINT_VECT_CLR_ACT</name>
              <description>Clear Active NMI / Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_APINT_SYSRESETREQ</name>
              <description>System Reset Request</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_APINT_PRIGROUP</name>
              <description>Interrupt Priority Grouping</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_7_1</name>
                  <description>Priority group 7.1 split</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_6_2</name>
                  <description>Priority group 6.2 split</description>
                  <value>0x00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_5_3</name>
                  <description>Priority group 5.3 split</description>
                  <value>0x00000200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_4_4</name>
                  <description>Priority group 4.4 split</description>
                  <value>0x00000300</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_3_5</name>
                  <description>Priority group 3.5 split</description>
                  <value>0x00000400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_2_6</name>
                  <description>Priority group 2.6 split</description>
                  <value>0x00000500</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_1_7</name>
                  <description>Priority group 1.7 split</description>
                  <value>0x00000600</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_0_8</name>
                  <description>Priority group 0.8 split</description>
                  <value>0x00000700</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_APINT_ENDIANESS</name>
              <description>Data Endianess</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_APINT_VECTKEY</name>
              <description>Register Key</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_APINT_VECTKEY</name>
                  <description>Vector key</description>
                  <value>0x05FA0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_SYS_CTRL</name>
          <displayName>NVIC_SYS_CTRL</displayName>
          <description>System Control</description>
          <addressOffset>0x00000D10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_SYS_CTRL_SLEEPEXIT</name>
              <description>Sleep on ISR Exit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_CTRL_SLEEPDEEP</name>
              <description>Deep Sleep Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_CTRL_SEVONPEND</name>
              <description>Wake Up on Pending</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_CFG_CTRL</name>
          <displayName>NVIC_CFG_CTRL</displayName>
          <description>Configuration and Control</description>
          <addressOffset>0x00000D14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_CFG_CTRL_BASE_THR</name>
              <description>Thread State Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_MAIN_PEND</name>
              <description>Allow Main Interrupt Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_UNALIGNED</name>
              <description>Trap on Unaligned Access</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_DIV0</name>
              <description>Trap on Divide by 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_BFHFNMIGN</name>
              <description>Ignore Bus Fault in NMI and Fault</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_STKALIGN</name>
              <description>Stack Alignment on Exception Entry</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_SYS_PRI1</name>
          <displayName>NVIC_SYS_PRI1</displayName>
          <description>System Handler Priority 1</description>
          <addressOffset>0x00000D18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_SYS_PRI1_MEM</name>
              <description>Memory Management Fault Priority</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_PRI1_BUS</name>
              <description>Bus Fault Priority</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_PRI1_USAGE</name>
              <description>Usage Fault Priority</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_SYS_PRI2</name>
          <displayName>NVIC_SYS_PRI2</displayName>
          <description>System Handler Priority 2</description>
          <addressOffset>0x00000D1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_SYS_PRI2_SVC</name>
              <description>SVCall Priority</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_SYS_PRI3</name>
          <displayName>NVIC_SYS_PRI3</displayName>
          <description>System Handler Priority 3</description>
          <addressOffset>0x00000D20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_SYS_PRI3_DEBUG</name>
              <description>Debug Priority</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_PRI3_PENDSV</name>
              <description>PendSV Priority</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_PRI3_TICK</name>
              <description>SysTick Exception Priority</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_SYS_HND_CTRL</name>
          <displayName>NVIC_SYS_HND_CTRL</displayName>
          <description>System Handler Control and State</description>
          <addressOffset>0x00000D24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_SYS_HND_CTRL_MEMA</name>
              <description>Memory Management Fault Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_BUSA</name>
              <description>Bus Fault Active</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_USGA</name>
              <description>Usage Fault Active</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_SVCA</name>
              <description>SVC Call Active</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_MON</name>
              <description>Debug Monitor Active</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_PNDSV</name>
              <description>PendSV Exception Active</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_TICK</name>
              <description>SysTick Exception Active</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_USAGEP</name>
              <description>Usage Fault Pending</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_MEMP</name>
              <description>Memory Management Fault Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_BUSP</name>
              <description>Bus Fault Pending</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_SVC</name>
              <description>SVC Call Pending</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_MEM</name>
              <description>Memory Management Fault Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_BUS</name>
              <description>Bus Fault Enable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_USAGE</name>
              <description>Usage Fault Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
