m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>NVIC_FAULT_STAT</name>
          <displayName>NVIC_FAULT_STAT</displayName>
          <description>Configurable Fault Status</description>
          <addressOffset>0x00000D28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_FAULT_STAT_IERR</name>
              <description>Instruction Access Violation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_DERR</name>
              <description>Data Access Violation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MUSTKE</name>
              <description>Unstack Access Violation</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MSTKE</name>
              <description>Stack Access Violation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MLSPERR</name>
              <description>Memory Management Fault on Floating-Point Lazy State Preservation</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MMARV</name>
              <description>Memory Management Fault Address Register Valid</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_IBUS</name>
              <description>Instruction Bus Error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_PRECISE</name>
              <description>Precise Data Bus Error</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_IMPRE</name>
              <description>Imprecise Data Bus Error</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BUSTKE</name>
              <description>Unstack Bus Fault</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BSTKE</name>
              <description>Stack Bus Fault</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BLSPERR</name>
              <description>Bus Fault on Floating-Point Lazy State Preservation</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BFARV</name>
              <description>Bus Fault Address Register Valid</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_UNDEF</name>
              <description>Undefined Instruction Usage Fault</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_INVSTAT</name>
              <description>Invalid State Usage Fault</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_INVPC</name>
              <description>Invalid PC Load Usage Fault</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_NOCP</name>
              <description>No Coprocessor Usage Fault</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_UNALIGN</name>
              <description>Unaligned Access Usage Fault</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_DIV0</name>
              <description>Divide-by-Zero Usage Fault</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_HFAULT_STAT</name>
          <displayName>NVIC_HFAULT_STAT</displayName>
          <description>Hard Fault Status</description>
          <addressOffset>0x00000D2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_HFAULT_STAT_VECT</name>
              <description>Vector Table Read Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_HFAULT_STAT_FORCED</name>
              <description>Forced Hard Fault</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_HFAULT_STAT_DBG</name>
              <description>Debug Event</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_DEBUG_STAT</name>
          <displayName>NVIC_DEBUG_STAT</displayName>
          <description>Debug Status Register</description>
          <addressOffset>0x00000D30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_DEBUG_STAT_HALTED</name>
              <description>Halt request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_BKPT</name>
              <description>Breakpoint instruction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_DWTTRAP</name>
              <description>DWT match</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_VCATCH</name>
              <description>Vector catch</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_EXTRNL</name>
              <description>EDBGRQ asserted</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MM_ADDR</name>
          <displayName>NVIC_MM_ADDR</displayName>
          <description>Memory Management Fault Address</description>
          <addressOffset>0x00000D34</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_FAULT_ADDR</name>
          <displayName>NVIC_FAULT_ADDR</displayName>
          <description>Bus Fault Address</description>
          <addressOffset>0x00000D38</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_CPAC</name>
          <displayName>NVIC_CPAC</displayName>
          <description>Coprocessor Access Control</description>
          <addressOffset>0x00000D88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_CPAC_CP10</name>
              <description>CP10 Coprocessor Access Privilege</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP10_DIS</name>
                  <description>Access Denied</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP10_PRIV</name>
                  <description>Privileged Access Only</description>
                  <value>0x00100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP10_FULL</name>
                  <description>Full Access</description>
                  <value>0x00300000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_CPAC_CP11</name>
              <description>CP11 Coprocessor Access Privilege</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP11_DIS</name>
                  <description>Access Denied</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP11_PRIV</name>
                  <description>Privileged Access Only</description>
                  <value>0x00400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP11_FULL</name>
                  <description>Full Access</description>
                  <value>0x00C00000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_TYPE</name>
          <displayName>NVIC_MPU_TYPE</displayName>
          <description>MPU Type</description>
          <addressOffset>0x00000D90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_TYPE_SEPARATE</name>
              <description>Separate or Unified MPU</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NVIC_MPU_TYPE_DREGION</name>
              <description>Number of D Regions</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NVIC_MPU_TYPE_IREGION</name>
              <description>Number of I Regions</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_CTRL</name>
          <displayName>NVIC_MPU_CTRL</displayName>
          <description>MPU Control</description>
          <addressOffset>0x00000D94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_CTRL_ENABLE</name>
              <description>MPU Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_CTRL_HFNMIENA</name>
              <description>MPU Enabled During Faults</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_CTRL_PRIVDEFEN</name>
              <description>MPU Default Region</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_NUMBER</name>
          <displayName>NVIC_MPU_NUMBER</displayName>
          <description>MPU Region Number</description>
          <addressOffset>0x00000D98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_NUMBER</name>
              <description>MPU Region to Access</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_BASE</name>
          <displayName>NVIC_MPU_BASE</displayName>
          <description>MPU Region Base Address</description>
          <addressOffset>0x00000D9C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_BASE_REGION</name>
              <description>Region Number</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE_VALID</name>
              <description>Region Number Valid</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE_ADDR</name>
              <description>Base Address Mask</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_ATTR</name>
          <displayName>NVIC_MPU_ATTR</displayName>
          <description>MPU Region Attribute and Size</description>
          <addressOffset>0x00000DA0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR_ENABLE</name>
              <description>Region Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SIZE</name>
              <description>Region Size Mask</description>
              <lsb>1</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SRD</name>
              <description>Subregion Disable Bits</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_BUFFRABLE</name>
              <description>Bufferable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_CACHEABLE</name>
              <description>Cacheable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SHAREABLE</name>
              <description>Shareable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_TEX</name>
              <description>Type Extension Mask</description>
              <lsb>19</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_AP</name>
              <description>Access Privilege</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_XN</name>
              <description>Instruction Access Disable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_BASE1</name>
          <displayName>NVIC_MPU_BASE1</displayName>
          <description>MPU Region Base Address Alias 1</description>
          <addressOffset>0x00000DA4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_BASE1_REGION</name>
              <description>Region Number</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_VALID</name>
              <description>Region Number Valid</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_ADDR</name>
              <description>Base Address Mask</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_ATTR1</name>
          <displayName>NVIC_MPU_ATTR1</displayName>
          <description>MPU Region Attribute and Size Alias 1</description>
          <addressOffset>0x00000DA8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR1_ENABLE</name>
              <description>Region Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SIZE</name>
              <description>Region Size Mask</description>
              <lsb>1</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SRD</name>
              <description>Subregion Disable Bits</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_BUFFRABLE</name>
              <description>Bufferable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_CACHEABLE</name>
              <description>Cacheable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SHAREABLE</name>
              <description>Shareable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_TEX</name>
              <description>Type Extension Mask</description>
              <lsb>19</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_AP</name>
              <description>Access Privilege</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_XN</name>
              <description>Instruction Access Disable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_BASE2</name>
          <displayName>NVIC_MPU_BASE2</displayName>
          <description>MPU Region Base Address Alias 2</description>
          <addressOffset>0x00000DAC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_BASE2_REGION</name>
              <description>Region Number</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE2_VALID</name>
              <description>Region Number Valid</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE2_ADDR</name>
              <description>Base Address Mask</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_ATTR2</name>
          <displayName>NVIC_MPU_ATTR2</displayName>
          <description>MPU Region Attribute and Size Alias 2</description>
          <addressOffset>0x00000DB0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR2_ENABLE</name>
              <description>Region Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SIZE</name>
              <description>Region Size Mask</description>
              <lsb>1</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SRD</name>
              <description>Subregion Disable Bits</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_BUFFRABLE</name>
              <description>Bufferable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_CACHEABLE</name>
              <description>Cacheable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SHAREABLE</name>
              <description>Shareable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_TEX</name>
              <description>Type Extension Mask</description>
              <lsb>19</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_AP</name>
              <description>Access Privilege</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_XN</name>
              <description>Instruction Access Disable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
