m-labs/dslite2svd/svd/tm4c1294ncpdt.xml
        <register>
          <name>NVIC_MPU_BASE3</name>
          <displayName>NVIC_MPU_BASE3</displayName>
          <description>MPU Region Base Address Alias 3</description>
          <addressOffset>0x00000DB4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_BASE3_REGION</name>
              <description>Region Number</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE3_VALID</name>
              <description>Region Number Valid</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_BASE3_ADDR</name>
              <description>Base Address Mask</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_MPU_ATTR3</name>
          <displayName>NVIC_MPU_ATTR3</displayName>
          <description>MPU Region Attribute and Size Alias 3</description>
          <addressOffset>0x00000DB8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR3_ENABLE</name>
              <description>Region Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SIZE</name>
              <description>Region Size Mask</description>
              <lsb>1</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SRD</name>
              <description>Subregion Disable Bits</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_BUFFRABLE</name>
              <description>Bufferable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_CACHEABLE</name>
              <description>Cacheable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SHAREABLE</name>
              <description>Shareable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_TEX</name>
              <description>Type Extension Mask</description>
              <lsb>19</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_AP</name>
              <description>Access Privilege</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_XN</name>
              <description>Instruction Access Disable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_DBG_CTRL</name>
          <displayName>NVIC_DBG_CTRL</displayName>
          <description>Debug Control and Status Reg</description>
          <addressOffset>0x00000DF0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_DBG_CTRL_DBGKEY</name>
              <description>Debug key mask</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DBG_CTRL_DBGKEY</name>
                  <description>Debug key</description>
                  <value>0xA05F0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_DBG_XFER</name>
          <displayName>NVIC_DBG_XFER</displayName>
          <description>Debug Core Reg. Transfer Select</description>
          <addressOffset>0x00000DF4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_DBG_XFER_REG_SEL</name>
              <description>Register</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R0</name>
                  <description>Register R0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R1</name>
                  <description>Register R1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R2</name>
                  <description>Register R2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R3</name>
                  <description>Register R3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R4</name>
                  <description>Register R4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R5</name>
                  <description>Register R5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R6</name>
                  <description>Register R6</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R7</name>
                  <description>Register R7</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R8</name>
                  <description>Register R8</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R9</name>
                  <description>Register R9</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R10</name>
                  <description>Register R10</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R11</name>
                  <description>Register R11</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R12</name>
                  <description>Register R12</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R13</name>
                  <description>Register R13</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R14</name>
                  <description>Register R14</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R15</name>
                  <description>Register R15</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_FLAGS</name>
                  <description>xPSR/Flags register</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_MSP</name>
                  <description>Main SP</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_PSP</name>
                  <description>Process SP</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_DSP</name>
                  <description>Deep SP</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_CFBP</name>
                  <description>Control/Fault/BasePri/PriMask</description>
                  <value>0x00000014</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_DBG_XFER_REG_WNR</name>
              <description>Write or not read</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_DBG_DATA</name>
          <displayName>NVIC_DBG_DATA</displayName>
          <description>Debug Core Register Data</description>
          <addressOffset>0x00000DF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NVIC_DBG_INT</name>
          <displayName>NVIC_DBG_INT</displayName>
          <description>Debug Reset Interrupt Control</description>
          <addressOffset>0x00000DFC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_DBG_INT_RSTVCATCH</name>
              <description>Reset vector catch</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDING</name>
              <description>Core reset is pending</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDCLR</name>
              <description>Clear pending core reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_RESET</name>
              <description>Core reset status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_MMERR</name>
              <description>Debug trap on mem manage fault</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_NOCPERR</name>
              <description>Debug trap on coprocessor error</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_CHKERR</name>
              <description>Debug trap on usage fault check</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_STATERR</name>
              <description>Debug trap on usage fault state</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_BUSERR</name>
              <description>Debug trap on bus error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_INTERR</name>
              <description>Debug trap on interrupt errors</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_DBG_INT_HARDERR</name>
              <description>Debug trap on hard fault</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_SW_TRIG</name>
          <displayName>NVIC_SW_TRIG</displayName>
          <description>Software Trigger Interrupt</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_SW_TRIG_INTID</name>
              <description>Interrupt ID</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_FPCC</name>
          <displayName>NVIC_FPCC</displayName>
          <description>Floating-Point Context Control</description>
          <addressOffset>0x00000F34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_FPCC_LSPACT</name>
              <description>Lazy State Preservation Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_USER</name>
              <description>User Privilege Level</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_THREAD</name>
              <description>Thread Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_HFRDY</name>
              <description>Hard Fault Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_MMRDY</name>
              <description>Memory Management Fault Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_BFRDY</name>
              <description>Bus Fault Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_MONRDY</name>
              <description>Monitor Ready</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_LSPEN</name>
              <description>Lazy State Preservation Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPCC_ASPEN</name>
              <description>Automatic State Preservation Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_FPCA</name>
          <displayName>NVIC_FPCA</displayName>
          <description>Floating-Point Context Address</description>
          <addressOffset>0x00000F38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_FPCA_ADDRESS</name>
              <description>Address</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_FPDSC</name>
          <displayName>NVIC_FPDSC</displayName>
          <description>Floating-Point Default Status Control</description>
          <addressOffset>0x00000F3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_FPDSC_RMODE</name>
              <description>RMODE Bit Default</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RN</name>
                  <description>Round to Nearest (RN) mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RP</name>
                  <description>Round towards Plus Infinity (RP) mode</description>
                  <value>0x00400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RM</name>
                  <description>Round towards Minus Infinity (RM) mode</description>
                  <value>0x00800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RZ</name>
                  <description>Round towards Zero (RZ) mode</description>
                  <value>0x00C00000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_FPDSC_FZ</name>
              <description>FZ Bit Default</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPDSC_DN</name>
              <description>DN Bit Default</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NVIC_FPDSC_AHP</name>
              <description>AHP Bit Default</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
